"[\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://wjbq.com/maine-store-halloween-displays-early/\",\n        \"title\": \"Maine's Mr. Halloween Shocked at Halloween Display in July\",\n        \"description\": \"Halloween is over three months away, but displays are up at this Maine store.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\nMaine's Mr. Halloween Shocked at Halloween Display in July\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSkip to main contentSkip to site footerTRENDING:Bid It to Win It Online AuctionDua Duo for ACLKane Brown ContestDunkin' Gift Card ContestFire Flame FridayMaking a DifferenceAppStation MerchHomeOn-AirAll DJsQ97.9 ScheduleKrissyAndiJaddPopcrush NightsListenListen LiveMobile AppQ97.9 on AlexaQ97.9 on Google HomeKrissy in the Morning PodcastsRecently PlayedAppDownload iOSDownload AndroidWin StuffContestsContest RulesContest SupportEventsFire Flame FridayStation MerchBid It to Win It Online AuctionSeize The DealContact UsHelp & Contact InfoSend FeedbackAdvertiseJob OpportunitiesApply to Be a Content CreatorApply to Be on the Sales TeamApply to Work in Digital SalesMoreHomeOn-AirAll DJsQ97.9 ScheduleKrissyAndiJaddPopcrush NightsListenListen LiveMobile AppQ97.9 on AlexaQ97.9 on Google HomeKrissy in the Morning PodcastsRecently PlayedAppDownload iOSDownload AndroidWin StuffContestsContest RulesContest SupportEventsFire Flame FridayStation MerchBid It to Win It Online AuctionSeize The DealContact UsHelp & Contact InfoSend FeedbackAdvertiseJob OpportunitiesApply to Be a Content CreatorApply to Be on the Sales TeamApply to Work in Digital SalesVisit us on YoutubeVisit us on FacebookVisit us on TwitterVisit us on InstagramSearch The SiteMaine\\u2019s Mr. Halloween Shocked at Halloween Display in JulyLori VoornasLori VoornasPublished: July 18, 2024Peter GeigerShare on FacebookShare on TwitterHalloween is over three months away, but displays are up at this Maine store.The funny part about finding a huge Halloween display during a Maine heatwave is who found the display: Mr. Halloween himself, Peter Geiger.Halloween Lowe's DisplayPeter Geigerloading...Why is Peter Geiger 'Mr. Halloween' in Maine?Peter, who works as an editor for The Farmers' Almanac, LOVES Halloween. He turns Geiger Industries into a playground for kids with thousands (not a typo) of candy bars to hand out!Peter Geiger HalloweenPeter Geiger Halloweenloading...Above is a picture of the thousands of candy bars (around 20 different selections) that Peter had for kids last year. Peter hadn't started buying his supply of candy when he came across a Halloween display at Lowe's in Auburn,\\u00a0which made\\u00a0even him pause. He was wondering who would drop $400 for a large and scary display (spoiler alert: the answer is Peter Geiger).(READ MORE:\\u00a0Lewiston Man Handing Out 6,500 King-Sized Candy Bars to Bring Smiles to His Hometown)Where in Maine can I buy Halloween decorations in July?Lowe's in Auburn seems to be getting into the giant Halloween display wars. Home Depot started it a few years ago, with giant $800 skeletons that sold out before you could say BOO! For a mere $484, you can own this nine-foot zombie that climbs a ladder to your home.Lowes.comLowes.comloading...Are you a Halloween nut? Would you consider dropping hundreds of dollars on a Halloween decoration for your home? But more importantly, would you buy said decoration while you are sweating bullets in a heat wave (you know, because it's JULY)!?LOOK: How Halloween has changed in the past 100 yearsStacker\\u00a0compiled a list of ways that Halloween has changed over the last 100 years, from how we celebrate it on the day to the costumes we wear trick-or-treating. We\\u2019ve included events, inventions, and trends that changed the ways that Halloween was celebrated over time. Many of these traditions were phased out over time. But just like fake blood in a carpet, every bit of Halloween\\u2019s history left an impression we can see traces of today.Gallery Credit: Brit McGinnisThe 18 Most Expensive Homes in Maine in 2024Maine has a lot to offer when it comes to properties. Take a look at the priciest homes in Maine as of July 2024.Gallery Credit: Sean McKennaFiled Under: display, Halloween, July, Maine, New England, WHOMCategories: ArticlesMore From Q97.9The 6 Best New England All-You-Can-Eat Buffets Worth the DriveThe 6 Best New England All-You-Can-Eat Buffets Worth the DriveMemorial Honors WWII British Pilots Lost Over Maine\\u2019s Sebago LakeMemorial Honors WWII British Pilots Lost Over Maine\\u2019s Sebago LakeNow Open: Portland, Maine\\u2019s First Self-Pour Wine BarNow Open: Portland, Maine\\u2019s First Self-Pour Wine BarWATCH: 3 Incredible Videos of the April 8, 2024, Solar Eclipse in Maine If You Missed It or Want to See It AgainWATCH: 3 Incredible Videos of the April 8, 2024, Solar Eclipse in Maine If You Missed It or Want to See It AgainWATCH: Cumberland, Maine, Farm\\u2019s Videos of Cute Baby Goats Having a Pajama Party, Doing Parkour Will Brighten Your DayWATCH: Cumberland, Maine, Farm\\u2019s Videos of Cute Baby Goats Having a Pajama Party, Doing Parkour Will Brighten Your Day25 Gas Stations in Maine and New Hampshire With the Best Grab-and-Go Food25 Gas Stations in Maine and New Hampshire With the Best Grab-and-Go FoodThese New England Stereotype Maps Are on Point for the Most PartThese New England Stereotype Maps Are on Point for the Most PartHere Are the Suckiest Parts About Grocery Shopping in New EnglandHere Are the Suckiest Parts About Grocery Shopping in New EnglandAre We Still Leaving Massive Tips for Maine, New Hampshire, Waitstaff?Are We Still Leaving Massive Tips for Maine, New Hampshire, Waitstaff?InformationEEOMarketing and Advertising SolutionsPublic FileNeed AssistanceFCC ApplicationsReport an InaccuracyTermsContest RulesPrivacy PolicyAccessibility StatementExercise My Data RightsDo Not Sell or Share My Personal InformationContactPortland Business ListingsFollow UsVisit us on YoutubeVisit us on FacebookVisit us on TwitterVisit us on Instagram2024 Q97.9, Townsquare Media, Inc. All rights reserved.\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.445aw.afrc.af.mil/News/Article-Display/Article/3843173/buckeye-tigers-visit-445th-airlift-wing/\",\n        \"title\": \"\\r\\n\\tBuckeye Tigers visit 445th Airlift Wing > 445th Airlift Wing > Article Display\\r\\n\",\n        \"language\": \"en-US\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\r\\n\\tBuckeye Tigers visit 445th Airlift Wing > 445th Airlift Wing > Article Display\\r\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSkip to main content (Press Enter).\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nU.S. Air Force Logo\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nHome\\n\\n\\nNews\\n\\n\\nPhotos\\n\\n\\nArt\\n\\n\\n\\n\\nAbout Us\\n\\n\\nBiographies\\n\\n\\n445AW App\\n\\n\\nWPAFB Space A\\n\\n\\nFact Sheets\\n\\n\\nQuestions\\n\\n\\nUTA Schedule\\n\\n\\n\\n\\nUnits\\n\\n\\n445th WSA-Medical\\n\\n\\n445th PA\\n\\n\\nBuckeye Flyer\\n\\n\\nC-17 Tours\\n\\n\\nFlyover & speaker requests\\n\\n\\nOfficial photos\\n\\n\\nPress\\n\\n\\n\\n\\n\\n\\n445th MSG\\n\\n\\n445th MXG\\n\\n\\n445th OG\\n\\n\\n445AW Recruiters\\n\\n\\n445th Force Support Squadron\\n\\n\\nHonor Guard\\n\\n\\nChaplains\\n\\n\\n\\n\\nContact Us\\n\\n\\nCareers\\n\\n\\n655th ISRW\\n\\n\\n655th ISRW News\\n\\n\\n655th ISRG\\n\\n\\n755th ISRG\\n\\n\\n655th ISRW History\\n\\n\\n655th ISRG History\\n\\n\\n755th ISRG History\\n\\n\\n\\n\\n\\n\\nSexual Misconduct Disciplinary Actions\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n445th Airlift Wing\\n\\n\\n\\n\\nNewsAbout UsBiographiesUnitsContact UsCareers655th ISRW\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nLt. Col. Andrew Pierce, 89th Airlift Squadron flight commander/C-17 instructor pilot and Ohio Organization of Black Aerospace Professionals Ace Academy Buckeye Tigers Aviation Program director, prepares young members of Buckeye Tigers for boarding a C-17 Globemaster III during a tour of the 445th Airlift Wing at Wright-Patterson Air Force Base, Ohio, July 10, 2024. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nTech. Sgt. Shawn Haggerty, 89th Airlift Squadron loadmaster, talks about the flying capabilities of a C-17 Globemaster III to young members of Buckeye Tigers as they watch a C-17 perform touch and goes on the flightline at Wright-Patterson Air Force Base, Ohio July 10, 2024. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nCol. Michael Baker, 445th Airlift Wing Operations Group commander, speaks to young members of Buckeye Tigers about the Air Force Reserve during the group\\u2019s visit to the 445th Airlift Wing at Wright-Patterson Air Force Base, Ohio, July 10, 2024. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nSecond Lt. William Phillis III, 89th Airlift Squadron pilot, shows the cockpit of a C-17 Globemaster III to young members of Buckeye Tigers during a tour of the 445th Airlift Wing at Wright-Patterson Air Force Base, Ohio, July 10, 2024. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nSenior Airman Diegan Rhodes, 89th Airlift Squadron loadmaster, talks to a young member of Buckeye Tigers during a tour of the 445th Airlift Wing at Wright-Patterson Air Force Base, Ohio, July 10, 2024. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit the 445th Airlift Wing\\nMembers of Buckeye Tigers watch a 445th Airlift Wing C-17 Globemaster III perform touch and goes on the flightline at Wright-Patterson Air Force Base, Ohio July 10, 2024. During their visit to the wing, the group toured a 445th AW C-17 Globemaster III, received a briefing by an Air Force recruiter about career fields offered in the Air Force and what it\\u2019s like to serve in the military. The group also with Col. Michael Baker, 445th Operations Group commander, who spoke about and answered their questions about serving in the Air Force Reserve. The Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.  Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy. (U.S. Air Force photo by Mr. Patrick OReilly)\\n\\n\\n\\n\\n\\nPhoto Details\\n /\\r\\n                        \\nDownload Hi-Res\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBuckeye Tigers visit 445th Airlift Wing\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPublished July 18, 2024\\n445th Airlift Wing Public Affairs\\n\\n\\nWRIGHT-PATTERSON AIR FORCE BASE, Ohio -- \\u00a0Approximately 40 young members of Buckeye Tigers visited the 445th Airlift Wing July 10, 2024. During their visit, the group toured a 445th AW C-17 Globemaster III, received a briefing by an Air Force recruiter about career fields offered in the Air Force and what it\\u2019s like to serve in the military. They also met with Col. Michael Baker, 445th Operations Group commander, who spoke about and answered their questions about serving in the Air Force Reserve.\\nThe Buckeye Tigers Aviation Program is an aviation organization focused on exposing young adults in middle and high school to various aviation careers in the Columbus and greater Central Ohio region.\\u00a0 Members get to experience actual flight in a real single engine airplane as the culminating event of OBAP\\u2019s (Organization of Black Aerospace Professionals) sponsored A.C.E. (Aviation Career Education) Academy.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nQuick Links\\nContact UsEqual OpportunityFOIA | Privacy | Section 508Information QualityInspector GeneralJAG Court-Martial DocketLink DisclaimerNo FEAR ActOpen GovernmentOSI Tip LinePlain LanguageQuestionsResilienceRSSSite MapVeterans Crisis Line\\n\\n\\n\\nCareers\\nJoin the Air ForceAir Force BenefitsAir Force CareersAir Force ReserveAir National GuardCivilian Service\\n\\n\\nConnect\\n\\r\\n                Get Social with Us         \\r\\n            \\n\\n\\n\\n\\n\\n\\nU.S. Air Force Logo\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nOfficial United States Air Force Website\\n\\n\\n\\n\\nHosted by Defense Media Activity - WEB.mil\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.americasbestracing.net/lifestyle/2024-thoroughbred-makeover-diary-expect-the-unexpected-journey\",\n        \"title\": \"Thoroughbred Makeover Diary: Expect the Unexpected on This Journey | America's Best Racing\",\n        \"description\": \"Horses have a funny way of keeping us on our toes, don\\u2019t they? Just when you think things are going one way, we constantly have to pivot another way.\",\n        \"language\": \"No language found.\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThoroughbred Makeover Diary: Expect the Unexpected on This Journey | America's Best Racing\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nGoogle Tag Manager \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\nEnter your keywords \\n\\n\\n\\n\\n The Sport\\n\\n\\nRaces\\nLeaderboard\\nRacetracks\\n\\nLifestyle\\nGambling\\n\\n\\nGambling Calculator\\n\\nBreeders' Cup\\nHorses First\\nLearn\\nVideos\\nInternational\\nHorses First\\nFan Apparel\\nHorse Country\\nMan O' War Project\\nAbout ABR\\n \\nNewsletter Sign Up\\n\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nLifestyle \\n\\n\\n\\nNow Reading\\nThoroughbred Makeover Diary: Expect the Unexpected on This Journey\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThe Sport\\nLifestyle\\nGambling\\nBreeders' Cup\\nHorses First\\nLearn\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThoroughbred Makeover Diary: Expect the Unexpected on This Journey\\nAftercareJuly 16th, 2024\\nby\\nLauren Millet-Simpson\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRiding off property at Meadowlarke, Mr Nobility was a very good boy schooling and extraordinarily focused in between jumps, as pictured above. (Courtesy of Lauren Millet-Simpson) \\n\\n\\n\\n\\n\\n\\n\\nHorses have a funny way of keeping us on our toes, don\\u2019t they? Just when you think things are going one way, we constantly have to pivot another way.\\nOur last update saw the big horse Mr Nobility getting ready to display his progress at the LongRun open house. Unfortunately, he had other plans. The day before the open house he had blood and mucus coming out of his nose. The next day, the morning of the open house, more mucus, coughing, and lots of blood pouring out of his nose. The veterinarian came out for an emergency endoscopy to see what was going on, and unfortunately didn\\u2019t really find much other than a very irritated soft palate and a lot of bloody mucus in the throat. Needless to say, we did not ride at the open house.\\n\\n\\n\\t\\tMr Nobility naps in the weirdest places. (Courtesy of Lauren Millet-Simpson)\\t\\n\\n\\nSince we are getting down to the wire as such, we really needed to start going off property and experimenting with different adventures. My coach booked a schooling time at a local show barn for myself and her other student who is going to the Makeover for an off-property ride.\\nThe week leading up to going off property was one of the most frustrating weeks for us in a while. Mr Nobility seemed for forget all manners and went back to his super studly behavior that I thought we had worked him out of. I think we maybe had five minutes of actual forward trot the entire week \\u2014 one day he was so completely ridiculous on the lunge I didn\\u2019t even get on him.\\nI decided to throw him on the trailer anyway and that, at the absolute worst, he would walk around on a new farm and watch another horse working in the ring. I set my expectations six-feet underground so there was no way we could possibly fail!\\nOnce again, horses surprise us. He surprised everyone that day and was a very good 5-year-old for a lot of firsts.\\nAfter walking around the arena for a while getting him used to the fact that another horse was working around him, and teaching him it\\u2019s OK to let the other horse canter by and not react whatsoever, Mr Nobility was level-headed enough to hop on. In my mind, this was already a victory as I truly thought I wouldn\\u2019t even get this far. He had never been in a ring with another horse and handled that well, anything else was bonus!\\nHe was good enough walking around that we did some trot work. He had issues circling to the right and steering was optional, but I chalked that up to inexperience, lots of distractions, and new things. Overall, he was being pretty good!\\nMy coach then set up a little X to jump over. He had never jumped before but she thought he was a horse who would thrive the more we asked of him \\u2026 and boy was she right! Once he fell over the X the first couple times and sent the poles flying, he learned to pick up his feet and ended the day jumping a little vertical with filler. He loved it! He actually paid attention and had better steering while jumping than flatting. Go figure!\\nWe have continued jumping in our lessons and he amazes me each time how much he enjoys it and how engaged he becomes. He is almost a completely different horse when a jump is front of him versus attempting to master a 20-meter circle while balanced and supple. We have now put four jumps together and done a flying change in a very short period of time! Not to mention his most balanced canter seems to be the first several strides after landing a jump.\\nWe have also discovered that his massive, teenage-boy growing body does require some maintenance as we transition into this new career. He is getting regular chiropractic treatments, which he responds really well to, and occasional osteopathy sessions.\\n\\n\\n\\t\\tMr Nobility does not appreciate fly gear \\u2026 or flies. (Courtesy of Lauren Millet-Simpson)\\t\\n\\n\\nAs with any athlete, it\\u2019s important to listen to the body and react appropriately when something is not 100%. Mr Nobility is a little bit like \\u201cprincess and the pea\\u201d and he makes no qualms about letting me know immediately when he needs a treatment. He is definitely expensive, but at least he is pretty!\\nAs we continue to progress toward (hopefully!) going to Kentucky in October, and I discover more and more about this wonderful creature, I am amazed at how much they also teach us about ourselves. After my accident a year and a half ago, when a horse I was riding tripped and fell and my leg got pinned underneath him, my confidence was definitely shaken. Prior to that, I would get on anything and not think twice about it. Now there exists a little voice in the back of my head that just adds a moment of hesitation when a horse is acting frisky or stubborn. But Mr Nobility, in all his 17 hands-plus of pure athlete, is re-teaching me to ride the big trot again and to not be afraid to trust in the foundation of my riding and the skills we have developed together. He is a really nice horse that I\\u2019m very lucky to be riding, and when we have those harmonious moments, it really is the most amazing feeling.\\nI hope to take him to our first show in a few weeks and see what we have to work with. As with everything on this journey, I am expecting anything but smooth sailing, so stay tuned for our next update to find out what crazy things are thrown at us this time!\\n\\nThe Jockey Club supports\\u00a0many\\u00a0aftercare initiatives\\u00a0including the Thoroughbred Aftercare Alliance, the only accrediting body in aftercare, and Thoroughbred Incentive Program (T.I.P.), which encourages the retraining of Thoroughbreds into other disciplines upon completion of careers.\\u00a0View all of the initiatives supported by The Jockey Club.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRelated News\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\nmost popular\\t\\t\\t\\n\\n\\n\\n\\nThis Week\\nThis Month\\nThis Year\\n\\n\\n\\n\\n\\n\\nNoel\\u2019s Weekend Winners: Picks for United Nations, Haskell Stakes\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nTuscan Sky Gets Slight Edge Over Dornoch in Haskell Stakes\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nMaximizing Potential When Betting a Wide-Open Edition of the Woodbine Oaks \\n\\n\\nShare\\n\\n\\n\\n\\n \\n\\n\\n\\n\\nLady\\u2019s Secret: Horse Racing\\u2019s Iron Lady\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nCol. E. R. Bradley: Kentucky Colonel, Thoroughbred Racing Legend\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nCoaltown: Citation\\u2019s Brilliant But Overshadowed Stablemate\\n\\n\\nShare\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n2021 Kentucky Derby Cheat Sheet\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nPreakness Quick Sheet: Get to Know the 2021 Preakness Horses\\n\\n\\nShare\\n\\n\\n\\n\\n\\n\\n\\nGet to Know All 13 U.S. Triple Crown Winners\\n\\n\\nShare\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\nRelated Stories\\t\\t\\t\\n\\n\\n\\nThoroughbred Makeover Diary: Expect the Unexpected on This Journey\\n\\n\\nShare\\n\\n\\n\\n\\nWhere to Watch/Listen: Horse Racing Coverage July 17-21\\n\\n\\nShare\\n\\n\\n\\n\\nPlanning Underway to Celebrate Preakness 150 With a Festival\\n\\n\\nShare\\n\\n\\n\\n\\nBeginner\\u2019s Guide to the 2024 Del Mar Meet\\n\\n\\nShare\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nget our Newsletter\\n  \\n\\n\\n\\nSign-up now!\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nFollow Us on Social Media\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nComing Up\\nThoroughbred Makeover Diary: Trial Run for Two!\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\n \\n\\n\\nCopyright \\u00a9 2024 TJC Media Ventures. Privacy | Terms and Conditions | Responsible Gaming\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nnewsletter sign-up\\n\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n            Stay up-to-date with the best from America's Best Racing!\\n          \\n\\n\\n\\n\\n\\n\\n\\u00d7\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.nytimes.com/2024/07/12/world/asia/india-ambani-wedding-billionaire.html\",\n        \"title\": \"Ambani Wedding Shows Off India\\u2019s New Gilded Age - The New York Times\",\n        \"description\": \"Many Indians cheer the rise of moguls like Mukesh Ambani, whose son\\u2019s wedding has become a global spectacle. To them, India\\u2019s poverty is predictable, but such opulence is not.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\nAmbani Wedding Shows Off India\\u2019s New Gilded Age - The New York Times\\n  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSkip to contentSkip to site indexAsia Pacific\\u00a0Today\\u2019s PaperAsia Pacific|A Wedding Puts India\\u2019s Gilded Age on Lavish Displayhttps://www.nytimes.com/2024/07/12/world/asia/india-ambani-wedding-billionaire.htmlShare full article217AdvertisementSKIP ADVERTISEMENTYou have a preview view of this article while we are checking your access. When we have confirmed access, the full article content will load.Supported bySKIP ADVERTISEMENTA Wedding Puts India\\u2019s Gilded Age on Lavish DisplayMany Indians cheer the rise of moguls like Mukesh Ambani, whose son\\u2019s wedding has become a global spectacle. To them, India\\u2019s poverty is predictable, but such opulence is not.Listen to this article \\u00b7 8:13 min Learn moreShare full article217Anant Ambani, son of Indian businessman Mukesh Ambani, and his fianc\\u00e9e, Radhika Merchant, during a wedding welcome ceremony in Mumbai earlier this month.Credit...Ashish Vaishnav/SOPA Images, via LightRocket, via Getty ImagesBy Anupreeta DasReporting from New DelhiJuly 12, 2024Leer en espa\\u00f1olThe younger son of Mukesh Ambani, India\\u2019s richest man, is set to wed his fianc\\u00e9e in Mumbai on Friday, the finale of a monthslong extravaganza that signaled the arrival of the unapologetic Indian billionaire on the global stage \\u2014 and introduced the world to the country\\u2019s Gilded Age.For much of the year, the festivities surrounding the nuptials of Anant Ambani and Radhika Merchant, the daughter of a fellow business tycoon, have grabbed eyeballs for their lavish displays of wealth. Millions have been spent on diamonds and emeralds the size of credit cards, on haute couture saris, on wedding invitations made of silver and gold.Billionaire businessmen, Bollywood stars, models and politicians were among the more than 1,200 guests at a pre-wedding bash in March. Bill Gates stopped by. Rihanna performed. In May, the bride and groom-to-be threw a four-day party on a luxury cruise ship in the Mediterranean; Ms. Merchant told Vogue India they couldn\\u2019t find a land venue big enough to host all their guests.Jay Gatsby would have been awed.The spectacle has served as an invitation to peek inside India\\u2019s uppermost echelons, where a few individuals and families have amassed astounding fortunes in recent years. Buoyed by booming growth and a cheerleading government, the number and wealth of Indian billionaires has soared. They are overlords of the Indian economy, running the phone networks that connect millions of people, the hospitals that treat them, the supermarkets where they shop and the high-rises in which many live.ImageThe pop star Rihanna performed for guests at the pre-wedding celebrations of Anant and Radhika in Jamnagar, Gujarat, in March.Credit...Reliance Industries, via ReutersA lot of money, in the hands of the few.In 2000, India had nine billionaires, according to Oxfam. Now, India has 200 billionaires, who collectively hold around $1 trillion in wealth, according to Forbes \\u2014 nearly a quarter of the country\\u2019s 2023 gross domestic product.We are having trouble retrieving the article content.Please enable JavaScript in your browser settings.Thank you for your patience while we verify access. If you are in Reader mode please exit and\\u00a0log into\\u00a0your Times account, or\\u00a0subscribe\\u00a0for all of The Times.Thank you for your patience while we verify access.Already a subscriber?\\u00a0Log in.Want all of The Times?\\u00a0Subscribe.AdvertisementSKIP ADVERTISEMENTSite IndexSite Information Navigation\\u00a9\\u00a02024\\u00a0The New York Times CompanyNYTCoContact UsAccessibilityWork with usAdvertiseT Brand StudioYour Ad ChoicesPrivacy PolicyTerms of ServiceTerms of SaleSite MapCanadaInternationalHelpSubscriptionsManage Privacy Preferences\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://mronline.org/2024/07/15/a-failure-for-divisive-concepts-legislation-is-a-victory-for-education/\",\n        \"title\": \"A failure for \\u2018Divisive Concepts\\u2019 legislation is a victory for education | MR Online\",\n        \"description\": \"Laws like this have a chilling effect on teachers' free speech. It remains to be seen whether New Hampshire's win in federal court will become a bellwether for democracy throughout the country.\",\n        \"language\": \"en-US\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\nA failure for \\u2018Divisive Concepts\\u2019 legislation is a victory for education | MR Online\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\nMonthly Review\\nMonthly Review Press\\nMR (Castilian)\\nClimate & Capitalism\\nMoney on the Left\\n \\n\\nTwitter\\nFacebook\\nInstagram\\nYouTube\\nMastadon\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\nHomeAboutContact/SubmissionBrowse\\n\\nRecent Articles Archive by Subject\\n\\nEcology Education Imperialism Inequality Labor Literature Marxism Movements Philosophy Political Economy \\nby Region\\n\\nAfrica Americas Asia Australasia Europe Global Middle East \\nby Category\\n\\nArt Commentary Interview Letter News Newswire \\n\\nMonthly Review Essays\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\r\\n\\t\\t\\t\\t\\t\\tBanned Books Week display at Derry Public Library in Derry, New Hampshire. (Photo: Derry Public Library (CC BY 2.0))\\t\\t\\t\\t\\t\\n\\n\\n\\r\\n\\t\\t\\tA failure for \\u2018Divisive Concepts\\u2019 legislation is a victory for education\\t\\t\\n\\nOriginally published: The Progressive Magazine  on July 10, 2024 by Jacob Goodwin (more by The Progressive Magazine) \\u00a0|  (Posted Jul 15, 2024) \\n\\nCulture, Education, Movements, StrategyAmericas, United StatesNewswireNew Hampshire Department of Education, New Hampshire\\u2019s \\u201cDivisive Concepts\\u201d law, Paul Barbadoro \\n\\n\\nA few minutes after the school intercom switched off following the end of day announcements, I looked down at my phone and saw the breaking news: A federal judge struck down New Hampshire\\u2019s \\u201cDivisive Concepts\\u201d law due to its vagueness.\\nThe 2021 law was part of a nationwide push to censor teacher speech and prohibit the instruction of the complex scope of history. Overnight, topics relating to race, gender, and the legacies of racism and sexism became fraught within school districts throughout the country. Teachers who covered these grounds in their classrooms questioned if and when they might be called to an administrative office and told their services were no longer needed.\\nThe presiding judge, Paul Barbadoro, noted in\\u00a0his decision that the New Hampshire law \\u201cforce[s] teachers to guess as to which diversity efforts can be touted and which must be repudiated, gambling with their careers in the process.\\u201d\\nThis resulted both in self-censorship and the enforcement by school districts of precautionary censorship to avoid legal jeopardy.\\nBooks were taken off classroom shelves out of fear of violating the law. The New Hampshire Department of Education created a\\u00a0portal for reporting teachers who dared to speak up for honest, fact-based histories. A bounty was issued with a $500 reward for the first person to report a teacher.\\nDespite the obstacles, many teachers taught the truth and spoke out to news media, in writing, and through informal groups. These teachers did not conform under the immense pressure of the law. Others simply left the profession\\u2014a protest in itself.\\nAs similar laws spread across the country, teachers partnered with the ACLU and the Southern Poverty Law Center to challenge the constitutionality of such measures. In Rhode Island, a law was defeated in committee, and in Arizona, it was struck down by the State Supreme Court. In Georgia, on the other hand, a law has been fully enacted, and one educator was fired for reading the children\\u2019s book My Shadow Is Purple to her class.\\nAssessing the varied legal strategies, Professor Derek Black of the University of South Carolina stated in 2023 that he believed the arguments addressing the chilling effect of the laws on teachers\\u2019 free speech presented the strongest cases for combatting \\u201cDivisive Concepts\\u201d laws.\\nBlack\\u2019s analysis was prescient in New Hampshire, where Thurgood Marshall\\u2019s dissent in\\u00a0Arnett v. Kennedy held sway. Marshall had written in 1974, \\u201cFor every employee who risks his job by testing the limits of the statute, many more will choose the cautious path and not speak at all.\\u201d In the \\u201cDivisive Concepts\\u201d case, the judge concluded that the vaguely worded statute provided no clear guideline for determining what kind of educational efforts were allowed or prohibited, leaving district administrators to err on the side of an overly broad application of the law, not knowing when an accusation of a violation might surface. All of this adds tremendous strain on our profession and public schools, arguably the central institutions of our communities.\\nThe ruling could bode well for Oklahoma, where the primary argument for striking down \\u201cDivisive Concepts\\u201d was based on the vagueness of the law. Yet the positive outcome in New Hampshire comes with a warning: There\\u2019s still a possibility that the legislature could address the issue of vagueness with more direct language aimed at limiting speech on topics related to race and gender.\\nLike other states that have passed corrosive laws targeting public schools, New Hampshire must now decide the kind of civic culture we want to have today and for the next generation.\\nOur small state has long received outsized attention due to hosting the first primary election in the nation. As such, New Hampshire takes its role in the process of picking a President seriously. From the tiny hamlet of Dixville Notch down to Manchester and many small towns in between, there is a sense of civic pride in asking candidates tough questions. There is also a strong sense of pride in each of our local public schools\\u2014a trust in the professionalism and experience of our neighbors who teach.\\nThe ban on books and teaching honest history was anathema to the civic culture of New Hampshire. Or at least it put a dent in what many of us saw as our down-to-earth civic sensibility. We understood Florida, Texas, and Oklahoma had similar bills. But could it be that the politically purple Granite State could have such censorship? The answer was clear: It could and did happen here. And it would have continued to happen here had it not been for a federal judge.\\nAll of this is noteworthy in determining whether New Hampshire becomes a bellwether in the campaign for reaffirming a national commitment to a democratic, pluralistic civil society. We have seen laws that attempt to limit teaching and learning\\u2014a departure from the principle of the classroom being a \\u201cmarketplace of ideas.\\u201d We have also seen the shortcomings of past curricula that left important stories untold. This brings us to a moment where we all have a collective choice: recommit to the project or backslide on affirming the promise of a more perfect union.\\nThe long awaited win in federal court provides hope for educators. That hope is most palpably felt in my home state of New Hampshire, but educators across the United States should take it to heart. It is the hard work of educators who choose to teach the truth and to speak up for what\\u2019s right that creates the foundation of civic life and the potential for civic renewal. But the promise of liberty and justice for all takes all of us working together\\u2014victory over \\u201cDivisive Concepts\\u201d legislation is a chance to improve how we do democracy and support learning for each and every student. We cannot afford to waste this opportunity.\\n\\nJacob Goodwin is a sixth grade social studies teacher and the 2021 New Hampshire History Teacher of the Year.\\n\\n\\nMonthly Review does not necessarily adhere to all of the views conveyed in articles republished at MR Online. Our goal is to share a variety of left perspectives that we think our readers will find interesting or useful. \\u2014Eds.\\n\\n\\n\\n\\nNew Hampshire Department of Education New Hampshire\\u2019s \\u201cDivisive Concepts\\u201d law Paul Barbadoro \\n\\n\\n\\n\\nLancet: 186,000 Palestinians or more killed in Gaza \\n\\nU.S.-German missile plans at NATO summit threaten cities deep inside Russia \\n\\n\\n\\n\\nMonthly Review Essays\\nWhether Bird Flu Is on the March Misses the Point\\nRob Wallace\\n\\nThe New England Journal of Medicine reported the case of a Texan farmworker infected with HPAI H5N1. He suffered the hemorrhaging in the eye the cows he tended expressed.\\nLost & Found\\nOn The Rewriting of History\\nEds.\\n\\n[Britannica\\u2019s revisionist] distortions of the history of the Vietnamese struggle are just as radical and just as misleading [as those about the Soviet Union]. Here we may draw some valuable lessons about the hidden content of form: how apparently neutral principles of organization may shape meaning.\\nDaraja Press\\nMoving Beyond Capitalist Agriculture: Could Agroecology Prevent Further Pandemics? \\n\\n\\n\\n\\n\\nTrending\\nScience and Freedom: Toward a new revolutionary epistemology\\nJohn Bellamy Foster on Albert Einstein\\u2019s Radical Politics\\nLancet: 186,000 Palestinians or more killed in Gaza\\nNATO SUMMIT: Collectively losing their minds\\nFrom Auschwitz to Gaza\\nLuxembourg goes to war\\nWhat\\u2019s behind the rise of AI powerhouse Nvidia?\\nU.S.-German missile plans at NATO summit threaten cities deep inside Russia\\nUnprecedented inequality in the \\u2018billionaire raj\\u2019\\nAI and the digital scramble for Africa\\n\\n\\n\\n\\nPopular (last 30 days)\\nRussia overtakes Japan to become the fourth largest economy in the world in PPP terms\\nQuantum dialectics\\nIs the Reign of the Dollar Coming to an End?: The Twenty-Fifth Newsletter (2024)\\nChina rejects U.S.-led auction of Venezuelan company CITGO\\nThree lessons I learned on my visit to Cuba\\nThe revolutionary dialectic of Balzac\\u2019s \\u2018Human Comedy\\u2019\\nThe Invisibles: About mass persecution of dissidents in Ukraine\\nRed Reviews: \\u201cWages, Price, and Profit\\u201d\\nCurrent and former U.S. military personnel build a movement for Palestine within their ranks\\nThe passing of a troublemaker\\n \\n\\n\\n\\n\\n\\n MR Press NewsFrom Einstein to The Dialectics of Ecology (John Bellamy Foster on KPFA\\u2019s \\u2018Against the Grain\\u2019) July 16, 2024Watch: \\u201cThere is nothing on the horizon that is remotely like Marxism\\u201d (Helena Sheehan at the Red Flag Festival) July 16, 2024\\u201cI Heard a Machine Gun Being Loaded\\u201d (Contributer to A Land With a People in \\u2018The Nation\\u2019) July 3, 2024New! EXCERPTS: POSTCARDS TO HITLER by Bruce Neuburger June 19, 2024New! EXCERPTS: RON CAREY AND THE TEAMSTERS, by Ken Reiman June 19, 2024 \\n\\n Climate & CapitalismCapitalism\\u2019s New Age of Plagues. Part 7: Wildlife farms and wet markets July 14, 2024Carbon offsets are undermining real climate action July 3, 2024Ecosocialist Bookshelf, July 2024 July 1, 2024Capitalism\\u2019s New Age of Plagues, Part 6: China\\u2019s Livestock Revolution June 26, 2024Two views (both wrong) on Marx, degrowth, and productivism June 13, 2024 \\u00a0\\n\\n \\n\\n Monthly ReviewJuly-August 2024 (Volume 76, Number 3) July 1, 2024 The EditorsImperialism in the Indo-Pacific\\u2014An Introduction July 1, 2024 John Bellamy FosterChanges in U.S. Grand Strategy in the Indo-Pacific and China\\u2019s Countermeasures July 1, 2024 Cheng EnfuTaiwan: An Anti-Imperialist Perspective July 1, 2024 Qiao CollectiveThe Korean Linchpin: The Korean Peninsula\\u2019s Enduring Centrality in U.S. Indo-Pacific Geostrategy July 1, 2024 Tim Beal \\n\\n\\n\\n\\n\\nThis work is licensed under a\\u00a0Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License.\\n\\n\\n\\n\\n\\n\\nMonthly Review Foundation134 W 29TH ST STE 706New York NY 10001-5304Tel: 212-691-2555\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.macworld.com/article/557878/apple-vision-pro-features-specs-price-faq.html\",\n        \"title\": \"Apple Vision Pro: release date, features, specs, price & how to buy | Macworld\",\n        \"description\": \"Having launched in the U.S. in February, Apple Vision Pro is now available to buy in the U.K., Canada and elsewhere. Here's what you should know about Vision Pro before you buy one. \",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nApple Vision Pro: release date, features, specs, price & how to buy | Macworld\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\ng\\n\\n\\n\\n\\n\\nEnglish US EditionEditionEnglish UKEnglish US\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSpanish \\n\\n \\n\\n\\nMac\\niPhone\\niPad\\nApple Watch\\nAirPods\\nVision Pro\\nMore\\n\\nAccessories\\nApple\\nApple TV\\nAudio\\nSecurity\\nSoftware\\n\\n\\nBest Picks\\nReviews\\nDeals\\nOpinion\\nRumors\\nNewsletter\\nDigital Magazine \\u2013 Subscribe\\nDigital Magazine \\u2013 Info\\nSmart Answers\\n \\n\\n\\n\\nSkip to content\\n\\n\\n\\n\\n\\n\\n\\n\\nMenu\\n \\n\\n\\n\\n\\n\\n\\n\\n\\nMac\\niPhone\\niPad\\nApple Watch\\nAirPods\\nVision Pro\\nMore\\n\\nAccessories\\nApple\\nApple TV\\nAudio\\nSecurity\\nSoftware\\n\\n\\nBest Picks\\nReviews\\nDeals\\nOpinion\\nRumors\\nNewsletter\\nDigital Magazine \\u2013 Subscribe\\nDigital Magazine \\u2013 Info\\nSmart Answers\\n \\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\nType your search and hit enter\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tHOT TOPICS\\t\\t\\n\\niPhone 16\\nApple Watch 2024\\niOS 18\\nNew AirPods\\nM4 Mac mini\\nmacOS 15\\n11th-gen iPad\\nBest Mac antivirus\\nBest Mac VPN\\n \\n\\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence.\\n\\n\\n\\n\\n\\nHome / Accessories / News \\n\\n\\n\\n\\t\\t\\t\\tUpdated\\n\\t\\t\\t\\t\\nApple Vision Pro guide: Everything you need to know \\n\\t\\t\\t\\tHaving launched in the U.S. in February, Apple Vision Pro is now available to buy in the U.K., Canada and elsewhere. Here's what you should know about Vision Pro before you buy one. \\t\\t\\t\\n\\n\\n\\n By Karen Haslam and Jason Cross  \\n\\nJUL 12, 2024 10:41 am PDT \\n\\n\\n\\n\\n\\n\\n\\n\\n \\nImage: Apple \\n\\n\\n\\n\\n\\n\\nApple Vision Pro went on sale in the U.S. on February 2, 2024, and is now available to buy in the U.K., Canada and other parts of the world, with shipping starting on July 12. Vision Pro is a mixed reality headset (Apple calls it a \\u201cSpatial Computer\\u201d) that marries an M2 processor with a lot of custom silicon, sensors, cameras, and more. The starting price of $3,499 means that it\\u2019s a niche product, but it\\u2019s the first in a new category that Apple believes will be critical in the coming years.\\nUpdate July 12: Vision Pro is now available in the U.K., Canada, Australia France, and Germany.\\n\\nApple Vision Pro: Worldwide availability\\nAfter the U.S. launch in February 2024, Apple had said that the Vision Pro would be shipping to \\u201cmore countries\\u201d later in 2024. At WWDC Apple announced which countries and when: \\n\\nChina (mainland): June 28\\nHong Kong: June 28\\nJapan: June 28\\nSingapore: June 28\\nAustralia: July 12\\nCanada: July 12\\nFrance: July 12\\nGermany: July 12\\nU.K.: July 12\\n\\nVision Pro is now available to purchase in all of the above countries and the U.S. It\\u2019s unclear when or if Apple plans to launch the new headset in other countries beyond these.\\n\\n\\n\\n\\nApple Vision Pro: Price and availability\\n\\n\\n\\n\\n\\n\\n\\nApple Vision Pro\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n Read our review\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThe headset was first announced at WWDC on June 5, 2023, with pre-orders starting January 19, 2024, and availability in the U.S. only on February 2. The starting price is $3,499 for 256GB of storage, with a 512GB model available for $3,699 and a 1TB model for $3,899. \\nNow that Apple has started to sell the Vision Pro outside the U.S. we have the price for those other territories:\\n\\n\\nChina: 29,999 yuan\\nHong Kong: HK$27,999\\nJapan: 599,800 yen\\nSingapore: S$5,299\\nAustralia: A$5,999 inc. GST\\nCanada: $4,999 (CAD)\\nFrance: \\u20ac3 999 \\nGermany: \\u20ac3.999\\nU.K.: \\u00a33,499\\n\\nYou can only buy a Vision Pro online directly from Apple\\u2019s website, by using the Apple Store app on your iPhone, or at an Apple Store. Part of the reason for this is the necessity to get a proper fit and optical insert if needed. Apple takes a scan of your face (you do this yourself with your iPhone if you are buying online) to select a proper face seal size. If you wear prescription eyewear or need readers, you can order special Zeiss inserts for $99/\\u00a399 (readers) or $149/\\u00a3149 (prescription). The headset is not designed to work with your existing eyewear.\\n\\n\\n\\n\\n \\n\\n\\n\\nApple\\n\\nApple\\n\\n\\nApple\\nThere are also other accessories available for purchase, including a travel case ($199/\\u00a3199), battery ($199/\\u00a3199), Belkin Battery Holder ($50/\\u00a349.95), Solo knit Band ($99/\\u00a399), Dual Loop Band ($99/\\u00a399), Light Seal ($199/\\u00a3199), and Light Seal Cushion ($29/\\u00a325). AppleCare+ is also available for $499/\\u00a3499 for two years.\\n\\n\\nWill there be a cheaper Apple Vision Pro? \\nWe take the fact that the Vision Pro has the word \\u201cPro\\u201d in its name as a big hint that a more affordable version will be coming down the line. An \\u201cApple Vision Air,\\u201d if you will. \\nApple is thought to be working on two new Vision products: a refreshed high-end \\u201cPro\\u201d model with enhanced capabilities, and a more affordable model that Apple would aim to sell for a price similar to that of a high-end iPhone.\\n\\nNew rumors about the successor to Vision Pro \\u2013 both what it will be and when it will arrive \\u2013 change frequently. They all have one thing in common, though: there isn\\u2019t expected to be any new hardware in 2024. Bloomberg\\u2019s Mark Gurman believes that a cheaper headset will arrive in 2025. He reported in October 2023 that Apple is already working on the sequel to the headset, which will be cheaper than the original model.\\nIn June 2024 a report in The Information claimed that Apple had killed the development of the Vision Pro 2 in order to focus on a lower-cost headset for 2025. However, Apple is said to be struggling to bring down manufacturing costs without cutting back on features and performance too much.\\n\\n\\nThe Vision Pro is likely to follow the example of the HomePod with the expensive pro model paving the way for a cheaper option down the line. But it could be a while before the economies of scale and advancements in technology make a cheaper Apple Vision product viable.\\nApple Vision Pro: Compatibility \\nThe Vision Pro is its own product with its own software ecosystem. It has its own App Store, and runs software independent from other Apple products (though apps like Messages and Photos can sync via iCloud with your other Apple products).\\n\\nThere is support for iPad apps, however. By default, all iPad apps are made available for use on Vision Pro and can be found in the Vision Pro app store, but developers can opt not to allow their apps to be used on the device. White many iPad apps are available, prominent exceptions include YouTube, Spotify, and Netflix.\\nApple Vision Pro: Specs\\nThe Vision Pro is powered by an M2 processor with 8 CPU cores and 10 GPU cores\\u2013the same as you would find in a MacBook. It has 16GB of RAM and 256GB, 512GB, or 1TB of flash storage.\\n\\n\\nThere are 14 cameras on the inside and outside, a LiDAR scanner, multiple IR illuminators, an accelerometer, gyroscope, and multiple microphones. A custom R1 processor is made to process the vast amount of data from these sensors very quickly, for lightning-fast eye tracking and a delay for the video pass-through of only 12 milliseconds.\\nWhen wearing the Vision Pro you look through custom catadioptric pancake lenses at a pair of micro-OLED displays, one for each eye. About the size of a postage stamp, each of these displays has a stunning resolution of about 3,386 pixels per inch, more than 4K per eye. Of course, what matters is pixels per degree when looking through the lenses, which on Vision Pro is around 34 pixels per degree (less than you\\u2019d see looking at an iPhone display, but more than most other VR headsets).\\nApple does not disclose the field of view for the Vision Pro, but it appears to be somewhere around 110\\u00b0 horizontally and 90\\u00b0 vertically.\\nThe Vision Pro is actively cooled, with a fan inside, but the fan runs so quietly you can\\u2019t hear it.\\n\\n\\nThere are two individually amplified drivers inside each audio pod on the side of the headset near the headband connection. They deliver Personalized Spatial Audio based on the user\\u2019s own head and ear geometry. As a result, the sound feels like it is coming from the space around you. Vision Pro also matches the sound to the room using audio raytracing. \\nThe Vision Pro also recognizes the user\\u2019s iris via a new method to unlock the device and authenticate passwords and purchases called Optic ID. Like the iPhone and Mac, all data is stored on a dedicated Secure\\u00a0Enclave processor.  \\nOn the outside of the headset is an OLED display with a lenticular lens over it that Apple calls EyeSight. It projects a rendered image of your own eyes with correct perspective, so others can see you looking at them. If you are in a fully immersive environment and can\\u2019t see anyone, the EyeSight display shows a blueish haze.\\nBattery life \\nApple Vision Pro connects to an external battery via a custom tether, and the battery lasts for around 2 to 2.5 hours. The battery pack has a USB-C port that can only be used to recharge it, though you can use the Vision Pro with the battery plugged in.\\n\\n\\nWeight and dimensions\\nAccording to Apple Vision Pro tech specs, the headset weighs 21.2 to 22.9 ounces (600 to 650 grams) depending on the Light Seal and headband configuration. That\\u2019s about the weight of the 12.9-inch iPad Pro (24 ounces/682\\u00a0grams). It\\u2019s not necessarily heavier than other VR headsets but quite a bit heavier than the Meta Quest 3, which weighs 18.2 ounces (516 grams).\\nThe weight is very front-heavy, mostly in the metal and glass out in the front of the face seal instead of distributed around the sides. The battery pack weighs 12.5 ounces (353 grams). \\nApple Vision Pro: Hands-on and overall experience\\nIn our Apple Vision Pro review, we found the technology very impressive, but the comfort and software\\u2014both apps and operating system\\u2014quite limited. There\\u2019s a lot of potential there, but it will take quite a while for the software to mature enough to unlock it, and for most users, the Vision Pro will never be worth the price. \\nWith a Vision Pro headset users will be able to watch a movie, listen to music, browse photos, look at 3D objects, and even collaborate on a presentation. \\n\\n\\nUsers experience a three-dimensional interface and input system that they control with their eyes, hands, and voice. You select things by looking at them and pinching your fingers together, then dragging objects around or flicking your hand to scroll. A virtual keyboard is used to enter text where appropriate, either by poking at the keys or looking at each key in succession and pinching your fingers together. You can also use voice input to enter text, or a Bluetooth keyboard.\\nApple has posted a 10-minute guided tour explaining how navigation and gestures work as well as several apps.\\u00a0\\n\\n\\n\\n\\n \\n\\n\\n\\nApple\\n\\nApple\\n\\n\\nApple\\nWhen you first put on Vision Pro you see your surroundings. You can freely move apps to fill the space around you and they can expand into your space. The digital crown lets you adjust the volume or the degree of immersion in your environment\\u2013from fully immersed in a virtual space to seeing \\u201cpass-through\\u201d video of your own space. Here\\u2019s a primer on what the Vision Pro buttons do.\\nA user can bring a Mac wirelessly into the Apple Vision Pro space just by looking at it and choosing to connect to it if it is logged into the same Apple ID. The Mac display will blank out and be replaced by a big 4K virtual display in your Vision Pro environment; you\\u2019ll continue to use the Mac keyboard and touchpad, however, and audio will still play from the Mac.\\n\\n\\nApple Vision Pro: Software and apps\\nThe Vision Pro headset runs visionOS, an operating system that Apple has designed from the ground up for visual computing. Apple launched a number of native Vision Pro versions of its apps at launch, such as Safari, Messages, and FaceTime. Apple launched Vision Pro with more than 600 optimized apps. The latest version is visionOS 1.1, which includes support for managed profiles, improved Personas, and lots of bug fixes and minor improvements.\\nIn fall 2024, Apple will release visionOS 2, the first major update to the OS. It will bring numerous refinements and upgrades, including the ability to transform regular, 2D photos into spatial photos, and wide and ultra-wide screen views with Mac Virtual Display.\\nApple Vision Pro: Glossary and terminology\\nAs with many Apple products, the company has some of its own branding around things that may be better understood by other names. Here are some of the things you may see associated with Vision Pro and what they mean.\\nSpatial Computing: Computing that appears to happen in the environment around you rather than inside a computer (or phone). A sort of umbrella term that encapsulates AR (Augmented Reality), VR (Virtual Reality), and MR (Mixed Reality). It is not inaccurate to call Vision Pro a mixed-reality headset.\\n\\n\\nSpatial apps: Apps designed with the Vision Pro hardware in mind, as opposed to iPad apps running in a window. Some Spatial apps are fully immersive experiences, others are almost indistinguishable from iPad apps.\\nFully immersive: A \\u201cfully immersive\\u201d experience is one in which your surroundings are not visible: you\\u2019re completely surrounded in a virtual environment. In other words Virtual Reality.\\nSpatial Audio: Audio that seems to come from specific places in your environment. \\nPersona: A 3D digital recreation of you, created by scanning your face using the Vision Pro cameras. It is meant to be used to represent you in video conferencing apps like FaceTime or Zoom since the Vision Pro has no cameras that can actually see your face (just specialized internal cameras for eye tracking).\\n\\n\\nSpatial Video: A new 3D video format that can be captured with either the Vision Pro or an iPhone 15 Pro. Spatial Videos can be viewed using a Vision Pro or even a Quest headset, and look a bit like a 3D diorama of a memory. It\\u2019s an emotionally charged and effective way of capturing the moment.\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tMacworld is your best source for all things Apple. We give you the scoop on what's new, what's best and how to make the most out of the products you love.\\t\\n\\t\\t\\t\\n\\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n\\n\\nPOLICIES\\n\\nPrivacy Policy\\nCookie Policy\\nCopyright Notice\\nEuropean Privacy Settings\\nMember Preferences\\nEditorial Independence\\nLicensing & Eprints\\nCalifornia: Do not sell my Personal Info\\n\\n\\nABOUT\\n\\nAbout Us\\nContact Us\\nAdvertise\\nAd Choices\\nFoundry Careers\\nSmart Answers\\n\\n\\n \\n\\n\\n\\t\\t\\t\\tMore from Macworld \\n\\nMacworld Sweden\\nMacwelt Germany \\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tSubscribe \\n\\n\\n\\n\\nSubscribe to the Macworld Digital Magazine\\nManage Subscription\\nNewsletter\\nFollow us on WhatsApp \\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\nCopyright \\u00a9 2024 IDG Communications, Inc. \\n\\n\\n\\nExplore the Foundry Network +\\nPCWorldTechHiveTechAdvisor \\n\\n\\n\\n\\nTop Of Page\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tDo Not Sell My Info\\t\\t\\t\\t\\n\\n\\n\\n\\t\\t\\t\\t\\tPrivacy Settings\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.economist.com/united-states/2024/07/16/is-the-move-to-oust-joe-biden-over\",\n        \"title\": \"Momentum against Joe Biden is mounting again\",\n        \"description\": \"After a brief lull, pressure is growing to replace him as the Democratic nominee | United States\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"Momentum against Joe Biden is mounting againThe EconomistThe EconomistSkip to contentMenuWeekly editionThe world in briefSearchLog inOpinionLeadersLetters to the editorBy InvitationCurrent topicsBritish election 2024Israel and HamasWar in UkraineUS elections 2024The World Ahead 2024Climate changeCoronavirusThe world economyThe Economist explainsArtificial intelligenceCurrent topicsBritish election 2024Israel and HamasWar in UkraineUS elections 2024The World Ahead 2024Climate changeCoronavirusThe world economyThe Economist explainsArtificial intelligenceWorldThe world this weekChinaUnited StatesEuropeBritainMiddle East & AfricaAsiaThe AmericasInternationalA-Z of international relationsA-Z of military termsA-Z of US politicsUS election poll trackerUK election poll trackerIn depthScience & technologyGraphic detailSpecial reportsTechnology QuarterlyBriefingEssaySchools briefBusiness & economicsFinance & economicsBusinessBig Mac indexA-Z of economicsEconomic & financial indicatorsCulture & society1843 magazineCultureObituaryThe Economist readsChristmas SpecialsMorePodcastsNewslettersFilmsThe Economist appSubscriber eventsEconomist Education coursesCorporate subscriptionsIncluded in your subscriptionPodcastsNewslettersFilmsLive virtual eventsThe Economist appMy EconomistSaved storiesLog outSaved storiesAccountLog outSearchSearchTry AI-powered searchUnited States | Dem dilemmasMomentum against Joe Biden is mounting againAfter a brief lull, pressure is growing to replace him as the Democratic nomineeA matter of timePhotograph: Getty Images Jul 16th 2024 (updated Jul 17th 2024)|New YorkShareWINSTON CHURCHILL\\u2019S maxim that \\u201cnothing in life is so exhilarating as to be shot at without result\\u201d has a political corollary: when a presidential candidate survives an assassination attempt, it can have a rallying effect. Exhilarated Republicans made a display of this in Milwaukee, where the party formally chose Donald Trump as its presidential nominee. The attack on July 13th has also affected Democrats, who have been in turmoil since President Joe Biden\\u2019s catastrophic debate performance last month. It disrupted the effort within the party to replace Mr Biden as its nominee. After the shooting, the atmosphere of shock made it untenable for Democratic rebels in Congress to advance their attempt to challenge Mr Biden\\u2019s candidacy. For a few days, no new House member or senator publicly called on the president to step aside.Explore moreUnited StatesElectionsJoe BidenDonald TrumpThis article appeared in the United States section of the print edition under the headline \\u201cDem dilemmas\\u201dUnited States July 20th 2024Why MAGA is the future, not just present, of the GOPThe Trump shooting has made a mockery of the Secret ServiceWhat was the motive of Trump\\u2019s would-be assassin?A maverick judge tosses out Donald Trump\\u2019s classified-documents caseMomentum against Joe Biden is mounting againBob Menendez is found guilty of corruptionCalling Donald Trump a threat to the rule of law has backfiredFrom the July 20th 2024 editionDiscover stories from this section and more in the list of contentsExplore the editionShareReuse this contentMore from United StatesDonald Trump tries to be both unifier and pugilist in his convention speechThe candidate thrills his party but mixes his messageWhy MAGA is the future, not just present, of the GOPThe selection of J.D. Vance means that Donald Trump\\u2019s influence may lingerCalling Donald Trump a threat to the rule of law has backfiredIt strengthened him politically and led to constitutional protections for presidents, not citizensMore from United StatesDonald Trump tries to be both unifier and pugilist in his convention speechThe candidate thrills his party but mixes his messageWhy MAGA is the future, not just present, of the GOPThe selection of J.D. Vance means that Donald Trump\\u2019s influence may lingerCalling Donald Trump a threat to the rule of law has backfiredIt strengthened him politically and led to constitutional protections for presidents, not citizensThe Trump shooting has made a mockery of the Secret ServiceProtecting presidents requires communication, not just lots of men with gunsBob Menendez is found guilty of corruptionFrom head of the Senate Foreign Relations Committee to convicted foreign agentA maverick judge tosses out Donald Trump\\u2019s classified-documents caseThe ruling may be reversed\\u2014but delay helps the former presidentSubscribeCorporate subscriptionsReuse our contentHelp and contact usKeep updatedLinkedInFacebookXInstagramThreadsTikTokYouTubeRSSPublished since September 1843 to take part in \\u201ca severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.\\u201d The EconomistAboutAdvertisePress centreThe Economist GroupThe Economist GroupEconomist IntelligenceEconomist ImpactEconomist Impact EventsWorking hereEconomist Education CoursesExecutive JobsTo enhance your experience and ensure our website runs smoothly, we use\\n        cookies and similar technologies.Manage CookiesTerms of UsePrivacyCookie PolicyAccessibilityModern Slavery StatementSitemapYour Data RightsCopyright \\u00a9 The Economist Newspaper Limited 2024. All rights reserved.\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.msn.com/en-us/lifestyle/lifestyle-buzz/prince-harry-is-in-a-good-place-after-putting-on-united-display-with-meghan-markle/ar-BB1pU5Ge\",\n        \"title\": \"MSN\",\n        \"language\": \"en-us\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\nMSN\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.businesskorea.co.kr/news/articleView.html?idxno=221504\",\n        \"title\": \"Former Samsung Researcher Sentenced to Six Years for Leaking OLED Tech to China - Businesskorea\",\n        \"description\": \"A former Samsung Display researcher has been sentenced to six years in prison for leaking OLED manufacturing technology to China, a case that underscores the h\",\n        \"language\": \"ko\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nFormer Samsung Researcher Sentenced to Six Years for Leaking OLED Tech to China - Businesskorea\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\uc8fc\\uc694\\uc11c\\ube44\\uc2a4 \\ubc14\\ub85c\\uac00\\uae30\\n\\ubcf8\\ubb38 \\ubc14\\ub85c\\uac00\\uae30\\n\\ub9e4\\uccb4\\uc815\\ubcf4 \\ubc14\\ub85c\\uac00\\uae30\\n\\ub85c\\uadf8\\uc778 \\ubc14\\ub85c\\uac00\\uae30\\n\\uae30\\uc0ac\\uac80\\uc0c9 \\ubc14\\ub85c\\uac00\\uae30\\n\\uc804\\uccb4\\uc11c\\ube44\\uc2a4 \\ubc14\\ub85c\\uac00\\uae30\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\r\\n\\t\\t\\t\\tUpdated : \\r\\n\\t\\t\\t\\tFriday, July 19, 2024, 18:26\\t\\t\\t\\n\\n\\n\\nHome\\nLogin\\nSign in\\n\\ud55c\\uad6d\\uc5b4\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nNational\\n\\n\\nForeign Affairs\\n\\n\\nCentral & Regional Affairs\\n\\n\\nLabor & Social Issues\\n\\n\\n\\n\\nEconomics\\n\\n\\nMacro-Economics\\n\\n\\nTrade\\n\\n\\nForeign Exchanges\\n\\n\\n\\n\\nIndustries\\n\\n\\nICT\\n\\n\\nAutomobiles\\n\\n\\nHeavy & Chemical\\n\\n\\nDefense\\n\\n\\nEntertainment & Media\\n\\n\\nEnergy\\n\\n\\nConstruction\\n\\n\\nHealthcare & Bio\\n\\n\\nConsumers & Retail\\n\\n\\nServices\\n\\n\\nAirlines & Logistics\\n\\n\\n\\n\\nManagement & ESG\\n\\n\\nDeals & Investing\\n\\n\\nEarnings\\n\\n\\nRestructuring & Innovation\\n\\n\\nESG Management\\n\\n\\n\\n\\nMarkets & Finance\\n\\n\\nCapital Market\\n\\n\\nCompany & Stock Tracking\\n\\n\\nCrypto\\n\\n\\nBanking\\n\\n\\nInsurances\\n\\n\\n\\n\\nStartup/Ventures\\n\\n\\nNew Technologies\\n\\n\\nEntrepreneurship\\n\\n\\nVenture Capitals\\n\\n\\nVenture Policies\\n\\n\\n\\n\\nScience/Tech\\n\\n\\nScience\\n\\n\\nNew Tech\\n\\n\\nBlockchain\\n\\n\\n\\n\\nEvent\\n\\n\\nExhibitions\\n\\n\\nConferences\\n\\n\\nPeople\\n\\n\\n\\n\\nK-Culture\\n\\n\\nCinema/Drama\\n\\n\\nK-pop\\n\\n\\nFood\\n\\n\\nLifestyle\\n\\n\\nArts/Culture\\n\\n\\n\\n\\nOpinion\\n\\n\\nEditorials\\n\\n\\nContributions\\n\\n\\n\\n\\nWho's Who\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\uae30\\uc0ac\\uac80\\uc0c9\\n\\n\\uac80\\uc0c9\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\uc774\\uc804 \\uae30\\uc0ac\\ubcf4\\uae30\\n\\ub2e4\\uc74c \\uae30\\uc0ac\\ubcf4\\uae30\\n\\n\\n\\n\\nFormer Samsung Researcher Sentenced to Six Years for Leaking OLED Tech to China\\n\\n\\nPrint\\nURL Copy\\nFonts Size Down\\nFonts Size Up\\n\\n\\n\\n\\n\\n\\nScroll Move Status-bar\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\u00a0Home\\nIndustries\\nICT\\n\\n\\nFormer Samsung Researcher Sentenced to Six Years for Leaking OLED Tech to China\\n\\n\\n\\n\\n\\nEditor \\r\\n\\t\\t\\t\\t\\tKim Eun-jin\\t\\t\\t\\t\\n 2024.07.19 09:02\\n\\n\\n\\n\\n\\nPrint\\nURL Copy\\n\\nFonts Size Down\\nFonts Size Up\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nfacebook(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\n\\ntwitter(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\n\\nURL Copy(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\nSend to Email\\nShare\\nScrap\\n\\n\\n\\n\\n\\nShare the articles\\n\\n\\n\\n\\nfacebook(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\n\\ntwitter(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\n\\nURL Copy(\\uc73c)\\ub85c \\uae30\\uc0ac\\ubcf4\\ub0b4\\uae30\\n\\n\\n\\n\\n\\n\\ub2eb\\uae30\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nA former Samsung Display researcher has been sentenced to six years in prison for leaking OLED manufacturing technology to China\\n\\n\\nA former Samsung Display researcher has been sentenced to six years in prison for leaking OLED manufacturing technology to China, a case that underscores the high stakes of intellectual property theft in the tech industry. The sentencing took place on July 18 with Judge Ha Sang-je of the Suwon District Court's 12th Criminal Division presiding over the case.\\nMr. A, an expert in the OLED display field, worked at Samsung Display for over a decade before resigning to establish and operate his own display company in Korea. From 2018 to May 2020, Mr. A illegally acquired and used Samsung's trade secrets, including the \\\"OLED Display ELA (Excimer Laser Annealing) Equipment Inversion Optical System\\\" and \\\"OCR Inkjet Equipment\\\" technology, to sell and provide to Chinese companies.\\nThe ELA equipment inversion optical system is crucial for maintaining the intensity and stability of lasers used on OLED electronic circuits, while the OCR inkjet equipment is used to bond the OLED panel and the outermost cover glass of the screen. These technologies are valued at more than 340 billion won (around $251 million) and are integral to Samsung's competitive edge in the OLED market.\\nMr. A's scheme involved his juniors, subordinates, and friends from his time at Samsung, who helped siphon off trade secrets to his domestic company and replicate Samsung Display's technology. In August 2020, five accomplices were indicted. Among them, three former Samsung Display researchers were sentenced to one to two years in prison, while two friends received suspended sentences.\\nIn October 2020, Mr. A was indicted and detained on charges of violating the Unfair Competition Prevention Act (leaking trade secrets abroad). His detention period was set to expire in March of this year, and he was released on bail to be tried without detention. However, following the sentencing on July 18, Mr. A was immediately taken into custody.\\nSamsung is a global leader in OLED technology, which is known for its superior image quality, including better contrast, faster response times, and more vibrant colors compared to traditional LCD displays. The company has invested heavily in research and development to maintain its competitive edge in the display market. The theft of such advanced technology can have significant repercussions, affecting the competitive landscape and leading to financial losses for Samsung. \\n\\n\\n\\n\\n\\n\\n\\n\\nKim Eun-jin\\npr@businesskorea.co.kr\\n\\n\\n\\nView More Article \\n\\nCopyright \\u00a9 BusinessKorea. Prohibited from unauthorized reproduction and redistribution\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPlease enable JavaScript to view the comments powered by Disqus.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMOST POPULAR\\n\\n\\n\\n1\\nPreliminary Selection Results Expected Soon for $25 Billion Czech Nuclear Reactor Contract\\n\\n\\n\\n\\n2\\nSamsung Electronics' Semiconductor Division Sales Potentially Surpasses That of TSMC in Q2\\n\\n\\n\\n\\n3\\nChinese Companies Poised to Challenge SK Hynix, Samsung, and Micron by Developing HBM2 by 2026\\n\\n\\n\\n\\n4\\nU.S. Tariff Hike on Chinese ESS Batteries Presents New Opportunities for Korean ESS Industry\\n\\n\\n\\n\\n5\\nSamsung SDI Targets U.S. Market with Advanced ESS Batteries, Securing Deal with NextEra Energy\\n\\n\\n\\n\\n6\\nTrump's Semiconductor Comments Trigger Stock Market Declines of Taiwan and Korea\\n\\n\\n\\n\\n7\\nKorea Exchange Initiates Development of \\u201cShort Selling System\\u201d\\n\\n\\n\\n\\n8\\nSamsung Electronics Union Sees Sharp Drop in Number of Participants in Strike Rallies\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nAbout Us\\nContact Us\\nPrint Editions\\nSubscribe\\nPrivacy Policy\\nYouth Policy\\n\\n\\n\\n\\n\\n\\n\\n\\nNational\\n\\n\\nForeign Affairs \\n\\nCentral & Regional Affairs \\n\\nLabor & Social Issues \\n\\n\\n\\nEconomics\\n\\n\\nMacro-Economics \\n\\nTrade \\n\\nForeign Exchanges \\n\\n\\n\\nIndustries\\n\\n\\nICT \\n\\nAutomobiles \\n\\nHeavy & Chemical \\n\\nDefense \\n\\nEntertainment & Media \\n\\nEnergy \\n\\nConstruction \\n\\nHealthcare & Bio \\n\\nConsumers & Retail \\n\\nServices \\n\\nAirlines & Logistics \\n\\n\\n\\nManagement & ESG\\n\\n\\nDeals & Investing \\n\\nEarnings \\n\\nRestructuring & Innovation \\n\\nESG Management \\n\\n\\n\\nStock Market\\n\\n\\nCompany & Stock Tracking \\n\\nMarket Trend & Outlook \\n\\n\\n\\nMarkets & Finance\\n\\n\\nCapital Market \\n\\nCompany & Stock Tracking \\n\\nCrypto \\n\\nBanking \\n\\nInsurances \\n\\n\\n\\nStartup/Ventures\\n\\n\\nNew Technologies \\n\\nEntrepreneurship \\n\\nVenture Capitals \\n\\nVenture Policies \\n\\n\\n\\nScience/Tech\\n\\n\\nScience \\n\\nNew Tech \\n\\nBlockchain \\n\\n\\n\\nESG\\n\\n\\nEnvironment \\n\\nSocial \\n\\nGovernance \\n\\n\\n\\nEvent\\n\\n\\nExhibitions \\n\\nConferences \\n\\nPeople \\n\\n\\n\\nK-Culture\\n\\n\\nCinema/Drama \\n\\nK-pop \\n\\nFood \\n\\nLifestyle \\n\\nArts/Culture \\n\\n\\n\\nOpinion\\n\\n\\nEditorials \\n\\nContributions \\n\\n\\n\\nWho's Who\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBusiness Korea Free Daily Newsletter\\nNever miss another article! Enter your email address below to receive our free daily newsletter:\\n\\n\\n\\nEmail address\\n\\n\\n\\nSubscribe\\n\\n\\n\\n\\n\\n\\n\\n\\nCopyright \\u00a9 2013-2023 Businesskorea Co., Ltd.\\n3rd Fl. Samdo Building, 12-1, Yeoido-dong, Yeongdeungpo-gu, Seoul, Korea 150-01\\n\\nTel : +82-2-578-3220\\nFax : +82-2-578-3224\\n\\nEmail : pr@businesskorea.co.kr\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\uc704\\ub85c\\n\\ubaa8\\ubc14\\uc77c\\ubc84\\uc804\\n\\n\\n\\n\\n\\n\\n\\n\\nAll articles\\n\\nNational\\n\\n\\uc804\\uccb4\\n\\nForeign Affairs \\n\\nCentral & Regional Affairs \\n\\nLabor & Social Issues \\n\\n\\n\\nEconomics\\n\\n\\uc804\\uccb4\\n\\nMacro-Economics \\n\\nTrade \\n\\nForeign Exchanges \\n\\n\\n\\nIndustries\\n\\n\\uc804\\uccb4\\n\\nICT \\n\\nAutomobiles \\n\\nHeavy & Chemical \\n\\nDefense \\n\\nEntertainment & Media \\n\\nEnergy \\n\\nConstruction \\n\\nHealthcare & Bio \\n\\nConsumers & Retail \\n\\nServices \\n\\nAirlines & Logistics \\n\\n\\n\\nManagement & ESG\\n\\n\\uc804\\uccb4\\n\\nDeals & Investing \\n\\nEarnings \\n\\nRestructuring & Innovation \\n\\nESG Management \\n\\n\\n\\nStock Market\\n\\n\\uc804\\uccb4\\n\\nCompany & Stock Tracking \\n\\nMarket Trend & Outlook \\n\\n\\n\\nMarkets & Finance\\n\\n\\uc804\\uccb4\\n\\nCapital Market \\n\\nCompany & Stock Tracking \\n\\nCrypto \\n\\nBanking \\n\\nInsurances \\n\\n\\n\\nStartup/Ventures\\n\\n\\uc804\\uccb4\\n\\nNew Technologies \\n\\nEntrepreneurship \\n\\nVenture Capitals \\n\\nVenture Policies \\n\\n\\n\\nScience/Tech\\n\\n\\uc804\\uccb4\\n\\nScience \\n\\nNew Tech \\n\\nBlockchain \\n\\n\\n\\nESG\\n\\n\\uc804\\uccb4\\n\\nEnvironment \\n\\nSocial \\n\\nGovernance \\n\\n\\n\\nEvent\\n\\n\\uc804\\uccb4\\n\\nExhibitions \\n\\nConferences \\n\\nPeople \\n\\n\\n\\nK-Culture\\n\\n\\uc804\\uccb4\\n\\nCinema/Drama \\n\\nK-pop \\n\\nFood \\n\\nLifestyle \\n\\nArts/Culture \\n\\n\\n\\nOpinion\\n\\n\\uc804\\uccb4\\n\\nEditorials \\n\\nContributions \\n\\n\\n\\nWho's Who\\n\\n\\n\\n\\n\\uc804\\uccb4\\uba54\\ub274\\ub2eb\\uae30\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://ca.news.yahoo.com/apple-launches-most-advanced-smartphone-220931313.html?src=rss\",\n        \"title\": \"Apple launches \\u2018most advanced\\u2019 smartphone display with iPhone 14\",\n        \"description\": \"The technology giant unveiled four new models retailing at up to \\u00a31,199.\",\n        \"language\": \"en-CA\"\n      },\n      \"page_content\": \"Apple launches \\u2018most advanced\\u2019 smartphone display with iPhone 14        HOME    MAIL    NEWS    SPORTS    FINANCE    CELEBRITY    STYLE    MOVIES    WEATHER    MOBILE                  Yahoo News       Search query             Sign in    Mail  Sign in to view your mail      News     Originals     Israel-Hamas War     COVID-19     Canada     World     Business     Entertainment     Weather     Videos     Sports     Science    \\u2026  AdvertisementClose this contentRead full articleEvening StandardApple launches \\u2018most advanced\\u2019 smartphone display with iPhone 14Benedict SmithSeptember 8, 2022 at 7:09 a.m.\\u00b72 min readLink CopiedThe logo in the window of the Apple Store on Regent Street, London. The technology giant has smashed the global record for quarterly profits after racking up a surplus of 18 billion US dollars (\\u00a311.9 billion). (PA Archive)Apple has launched its \\u201cmost advanced\\u201d smartphone yet with the iPhone 14, which features battery life and camera upgrades over its predecessor.Its four new models are between 6.1 and 6.7 inches in length, meaning they have larger screens than the iPhone 13, while lasting all day on a single charge.However, one expert noted that Apple had reserved the \\u201cbiggest leaps\\u201d \\u2013 such as a more powerful processor \\u2013 for the Pro, its more expensive handset.The iPhone 14 and 14 Plus feature an upgraded 12MP camera, while the Pro and Pro Max have a 48MP camera.All are equipped with a larger light sensor which can produce low-light photographs twice the previous generation\\u2019s quality.\\u201cLow-light photography has always been a challenge given the sensor size in mobile phones,\\u201d Ru Bhikha, mobiles expert at Uswitch.com, told the PA news agency.\\u201cSo any sort of improvements there, given the amount of pictures we take on a daily basis, will definitely be seen as a worthy upgrade compared to the iPhone 13.\\u201dMeet iPhone 14 Pro, iPhone 14, Apple Watch Series 8, Apple Watch Ultra, and AirPods Pro. All that and more from the #AppleEvent\\u2014 Apple (@Apple) September 7, 2022However, while the standard iPhone 14 uses its predecessor\\u2019s A15 bionic chip, the Pro will be equipped with the faster A16 chip.\\u201cApple has stuck to its guns and reserved its biggest leaps in innovation for its most premium handsets, despite the economic challenges facing many consumers,\\u201d Mr Bikha noted.Similarly, the Pro versions boast an \\u201cAlways-On Display\\u201d, meaning users can see basic notifications while the screen is locked.Unveiling the feature at a virtual event, Apple executive Greg Joswiack said: \\u201cIt\\u2019s easy to see the time and other core information without raising your iPhone or tapping the display.\\u201cThis keeps the central information available for the moments where all you need is just a glance\\u2026 this is the most advanced display we\\u2019ve ever shipped.\\u201dMr Joswiack added that it was made possible by the Pro\\u2019s \\u201cincredibly power-efficient\\u201d display, which operates with a refresh rate as low as 1Hz.Apple has ditched the iPhone mini seen in previous generations \\u2013 the \\u201ccheapest and most pocket-friendly phone from the main series\\u201d, Mr Bikha said.The virtual event also saw the unveiling of the Apple Watch Ultra, which the company\\u2019s chief operating officer Jeff Williams labelled \\u201cthe most rugged and capable Apple Watch yet\\u201d.It is aimed at those taking part in extreme sports \\u2013 such as deep-sea diving \\u2013 and is fortified by titanium casing and a sapphire crystal display protector.The iPhone 14 will be available for \\u00a3849 on September 16, while the Plus will appear on shelves for \\u00a3949 on October 7.The Pro and Pro Max retail for \\u00a31,099 and \\u00a31,199 on September 16 and 23.Up nextUp nextUp nextUp nextLatest StoriesHuffPostNew York Mag Cover Of Near-Naked Trump And Biden Sparks BacklashPeople were not impressed with the revealing cover image of the current and former president.CBCGuelph woman waited hours in court for son's hearing, only to learn he died after night in OPP custodyFaye Dzikewich waited in a Guelph, Ont., courtroom all day for her son's bail hearing before learning he had died four hours earlier.Now, she's searching for answers.Nathaniel Schofield, 36, went into medical distress while in custody at an Ontario Provincial Police (OPP) facility in Rockwood. The case now involves the province's Special Investigations Unit (SIU) \\u2014 the civilian law enforcement agency investigates circumstances involving police that result in serious injury, death or allegations Ad\\u2022\\uc5f0\\uc138\\ud790\\uce58\\uacfc\\uc758\\uc6d0Why this Ad?I don't like this adGo ad-free*Ad\\uc784\\ud50c\\ub780\\ud2b8 \\uac00\\uaca9 \\uad81\\uae08\\ud558\\uc2dc\\ub2e4\\uba74?  The Canadian Press'One screen, two movies': Conflicting conspiracy theories emerge from the Trump rally shootingWASHINGTON (AP) \\u2014 A former president is wounded in a shooting, the gunman quickly neutralized, and all of it is caught on camera. But for those who don't believe their eyes, that's just the start of the story.The Canadian PressBob Newhart mourned by Carol Burnett, Kaley Cuoco, Judd Apatow, Al Franken and moreLOS ANGELES (AP) \\u2014 Former co-stars and famous fans paid tribute to comedian and actor Bob Newhart, known for his deadpan humor and the sitcoms he starred in bearing his name, after his death Thursday at age 94.HuffPost'That Is Absolutely Real': Jimmy Fallon Stunned Speechless By Hilarious RNC ClipThe \\\"Tonight Show\\\" host said the viral video of West Virginia Gov. Jim Justice was \\\"unbelievable.\\\" Ad\\u2022\\uc5f0\\uc138\\uc0dd\\ud65c\\uac74\\uac15Why this Ad?I don't like this adGo ad-free*Ad\\\"\\uc11c\\uc7a5\\ud6c8 \\uc601\\uc591\\uc81c\\u201d \\uac15\\ub0a8\\ub9d8 \\ud654\\uc81c 180cm\\uae4c\\uc9c0 \\ud0a4\\uc6b4 \\ube44\\ubc95??  The Canadian PressEven with restrictive rules, swimsuit wars heat up in an Olympic yearThe iconic LZR Racer, the swimsuit that Michael Phelps wore while winning eight golds medals at the Beijing Olympics, is still revered around Speedo's design center. It serves as a reminder of just how much a suit can push a swimmer to greater heights. \\u201cIn so many ways, that was the golden era,\\u201d said Coora Lavezzo, the head of innovation at Speedo\\u2019s Aqualab in London. \\u201cWe\\u2019ve got those suits upstairs, and even though I wasn\\u2019t there at the time, I\\u2019m fascinated by them and just how we can get backHuffPost UKWhy King Charles Is Facing Backlash After Another Seemingly Tetchy Moment Caught On CameraIs this the sequel to pengate?PeopleDubai Princess Appears to Divorce Husband Via Instagram Post: \\u2018Take Care. Your Ex-Wife\\u2019\\\"As you are occupied with other companions, I hereby declare our divorce,\\\" Sheikha Mahra bint Mohammed bin Rashid Al Maktoum said in a social media post Ad\\u2022\\ubcf4\\ud5d8\\ube44\\uad50 No.1Why this Ad?I don't like this adGo ad-free*Ad\\\"\\uc2e4\\ube44\\ubcf4\\ud5d8\\\" \\uc65c \\uc774\\ub807\\uac8c \\uc2fc\\uac00\\uc694? \\uc804\\uad6d \\ucd5c\\uc801\\uac00 \\uacf5\\uac1c!...  Yahoo Canada StyleWayne Gretzky and Janet Jones Gretzky celebrate 36 years of marriage: What to know about the couple and their familyThe Canadian NHL legend and his wife tied the knot in 1988, and they share five children between each other.Hello!Emily Ratajkowski's micro mini shorts just schooled us in heatwave dressingEm Rata just proved shes the queen of summer stye once again. See photosHuffPostElizabeth Warren Bluntly Summarizes The Evolution Of JD VanceThe Democrat spoke of her Senate colleague, Trump's vice presidential pick, in an appearance on \\\"The Late Show.\\\" Ad\\u2022\\uc6d0\\ub370\\uc774 \\uc784\\ud50c\\ub780\\ud2b8Why this Ad?I don't like this adGo ad-free*Ad\\ube60\\uc9c4 \\uce58\\uc544 \\ub9ce\\ub098\\uc694? \\uc804\\uccb4 \\uc784\\ud50c\\ub780\\ud2b8  PeopleKate Middleton Releases a New Statement Related to Her Royal Work Days After Wimbledon AppearanceThe Princess of Wales, who is undergoing cancer treatment, spoke about the \\\"transformative\\\" power of nature as one of her patronages made an exciting announcementThe Daily BeastOpinion: Usha Vance Is About to Transform Into a Trumpian Trad WifeIn the reality show that is Trumpian politics, appearance is not just important\\u2014it\\u2019s everything.On Monday, as a noticeably slimmed down J.D. Vance basked in the glow of a vice presidential nomination, the spotlight inevitably also fell on his wife, Usha. Gripping her husband\\u2019s hand as the RNC crowd hustled him for selfies, she could not have looked more supportive\\u2014or more out of place. Dressed in the professional woman\\u2019s uniform of a sleeveless taupe sheath dress, Usha appeared suited to take aInStyleKing Charles Is Reportedly \\u201cExasperated\\u201d Over Princes Harry and WilliamInsiders say he\\u2019s focusing on more pressing matters than family drama. Ad\\u2022\\uc5ec\\ub984 \\uc774\\ubd88Why this Ad?I don't like this adGo ad-free*Ad\\ub2ff\\uae30\\ub9cc \\ud574\\ub3c4 \\uc2dc\\uc6d0\\ud55c \\ub0c9\\uac10\\uc18c\\uc7ac \\uc5ec\\ub984\\uc774\\ubd88  BuzzFeedA Pregnant Woman Was Forced To Sit In A Meeting While In Labor, And Her Coworkers Are Now Blaming Her For Reporting The Boss\\\"I reiterated that I was in active labor and needed to go to the hospital immediately. John snapped back, 'It's just a meeting. Sit through it, and then you can go. It\\u2019s not like the baby is going to pop out right now.'\\\"HuffPostFather Of Parkland Shooting Victim Says He's Infuriated By Fake Ear Bandages At RNCMultiple people were grievously injured during last week's shooting in Pennsylvania, while Donald Trump escaped with a bloodied ear.CNNIf the Trump classified documents case is reinstated, Judge Aileen Cannon would be difficult to removeProsecutors would face deeply unfavorable odds at getting the Donald Trump-nominated judge from the case if it is ever revived. Ad\\u2022\\uc18c\\ub178\\ud638\\ud154\\uc564\\ub9ac\\uc870\\ud2b8Why this Ad?I don't like this adGo ad-free*Ad\\uad6d\\ub0b4 1\\uc704 \\ub9ac\\uc870\\ud2b8! VIP \\ud2b9\\ubcc4 \\ud68c\\uc6d0\\uad8c \\uc2e0\\uaddc \\ubd84\\uc591 \\uc9c4\\ud589\\u4e2d  HuffPost UKWe May Finally Know How The Pyramids Were Built Thanks To This DiscoveryArchaeologists have uncovered a vital piece of information that may explain how the pyramids were built.BuzzFeedThis Woman Rattled Off All The Things She Won't Do For Her Husband, And It's Possibly The Best Thing I've Seen On The Internet In A While\\\"I don't make his doctor's appointments. He's not making mine.\\\"PeopleAfter Son Opened Fire at Trump Rally, Shooter's Dad Called Police Worried that Son and Rifle Were Missing: ReportThe 20-year-old shooter was fatally shot by Secret Service after he opened fire at a Trump rally in Butler, Pa.More Stories\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://athlonsports.com/nfl/tennessee-titans/all-titans/breakdown/remembering-a-titan-keith-bullock-and-the-legacy-of-mr-monday-night-football\",\n        \"title\": \"athlonsports.com\",\n        \"language\": \"No language found.\"\n      },\n      \"page_content\": \"athlonsports.comPlease enable JS and disable any ad blocker\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.nytimes.com/2024/07/18/arts/television/jd-vance-trump-apprentice.html\",\n        \"title\": \"J.D. Vance Becomes Trump\\u2019s New Apprentice - The New York Times\",\n        \"description\": \"In his prime-time debut, the senator and \\u201cHillbilly Elegy\\u201d author showed what he has to offer his running mate.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\nJ.D. Vance Becomes Trump\\u2019s New Apprentice - The New York Times\\n  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSkip to contentSkip to site indexTelevision\\u00a0Today\\u2019s PaperliveG.O.P. ConventionJuly 18, 2024, 12:33 p.m. ETliveBiden CampaignJuly 18, 2024, 12:37 p.m. ETPoll TrackerInside the R.N.C.Trump\\u2019s G.O.P. PlatformCan Biden Be Replaced?AdvertisementSKIP ADVERTISEMENTYou have a preview view of this article while we are checking your access. When we have confirmed access, the full article content will load.Supported bySKIP ADVERTISEMENTCritic\\u2019s NotebookJ.D. Vance Becomes Trump\\u2019s New ApprenticeIn his prime-time debut, the senator and \\u201cHillbilly Elegy\\u201d author showed what he has to offer his running mate.Listen to this article \\u00b7 5:49 min Learn moreShare full articleSenator J.D. Vance of Ohio accepted the Republican nomination for vice president on Wednesday, casting himself as an ideological heir to Donald Trump.Credit...Haiyun Jiang for The New York TimesBy James PoniewozikJuly 18, 2024, 10:56 a.m. ETSpeaking Wednesday at the Republican National Convention, Senator J.D. Vance of Ohio became the latest, and potentially most consequential, of Donald J. Trump\\u2019s apprentices to accept the position in prime time.For years as the host of \\u201cThe Apprentice,\\u201d Mr. Trump picked out prot\\u00e9g\\u00e9s from boardrooms full of young supplicants. There was a delicate art to getting the nod. Offend him and you might be dismissed; appear too thirsty and you could get the boot as well. The key was to be yourself but also be him, to be a mirror but a flattering one, to be an echo auto-tuned to please the boss\\u2019s ear.Mr. Vance spent much of his two years in the Senate auditioning for the promotion to vice-presidential nominee, cultivating a relationship, apologizing for his Never-Trumper apostasy and recently blaming Biden campaign rhetoric for leading \\u201cdirectly\\u201d to the assassination attempt against Mr. Trump.Accepting the nomination on Wednesday night, he cast himself as a loyal fighter, an ideological heir and a grateful son of the working class with roots in Appalachia and the Rust Belt.With Merle Haggard\\u2019s \\u201cAmerica First\\u201d as his walk-on music, he began his speech praising Mr. Trump: \\u201cHe didn\\u2019t need politics,\\u201d Mr. Vance said, \\u201cbut the country needed him.\\u201d Mr. Trump looked on smiling in split-screen, as if watching a winner at a season finale.When it came to introducing himself, Mr. Vance had a head start and a challenge. He was telling a story he had already told, in the memoir \\u201cHillbilly Elegy,\\u201d and so had Ron Howard, in the 2020 film adaptation.We are having trouble retrieving the article content.Please enable JavaScript in your browser settings.Thank you for your patience while we verify access. If you are in Reader mode please exit and\\u00a0log into\\u00a0your Times account, or\\u00a0subscribe\\u00a0for all of The Times.Thank you for your patience while we verify access.Already a subscriber?\\u00a0Log in.Want all of The Times?\\u00a0Subscribe.AdvertisementSKIP ADVERTISEMENTSite IndexSite Information Navigation\\u00a9\\u00a02024\\u00a0The New York Times CompanyNYTCoContact UsAccessibilityWork with usAdvertiseT Brand StudioYour Ad ChoicesPrivacy PolicyTerms of ServiceTerms of SaleSite MapCanadaInternationalHelpSubscriptionsManage Privacy Preferences\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.telecomlead.com/smart-phone/xr-industry-developments-and-near-eye-display-market-outlook-117090\",\n        \"title\": \"XR industry developments and near-eye display market outlook - TelecomLead\",\n        \"description\": \"Kimi Lin and a team of analysts at Omdia have published a report on the growth potential of the near-eye display market.\",\n        \"language\": \"en-US\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\nXR industry developments and near-eye display market outlook - TelecomLead\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTwitter\\n\\n \\n\\n\\n\\n\\n\\n4G\\n5G\\nSTATISTICS\\nOPERATOR\\nINTERNET\\nBROADCAST\\nNETWORK\\nCHIPS\\nINDEPTH\\nPHONE\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n  \\n\\n\\n\\n\\n\\n\\nSearchSearch \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n4G\\n5G\\nSTATISTICS\\nOPERATOR\\nINTERNET\\nBROADCAST\\nNETWORK\\nCHIPS\\nINDEPTH\\nPHONE\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nXR industry developments and near-eye display market outlook\\n\\n\\n\\n\\nJuly 12, 2024 \\n\\n\\n\\nTweetShareSharePinKimi Lin and a team of analysts at Omdia have published a report on the growth potential of the near-eye display market.\\n\\nGrowth in the near-eye display business will be powered by the innovation spearheaded by stakeholders in the XR industry for their fans for AR, VR and MR headsets. This article has covered observations made by analysts at IDC and Omdia on the recent developments in the XR industry.\\nDespite a projected stagnation in near-eye display shipments for 2024, the long-term outlook for the market remains positive, Kimi Lin said in a recent Omdia report.\\n\\u201cWith advancements in display, optical, and other component technologies, Omdia is optimistic about the long-term outlook. Near-eye display shipments are projected to grow rapidly from 2027, reaching 92.9 million units by 2030,\\u201d stated Kimi Lin, Senior Research Analyst at Omdia.\\nThe global display industry is set to convene at the Omdia Display Conference from September 12-13, 2024, in Shanghai, China. During the event, Kimi Lin and a team of Omdia analysts will present their research on the latest innovations within the display sector.\\nXR market\\nThe XR market, which includes AR, VR, and MR, is currently facing a downturn, causing significant layoffs at leading companies and prompting several smartphone brands to halt or scale back their XR projects. Despite these setbacks, industry leaders are determined to rejuvenate the market and drive growth in the coming years, Omdia said.\\nFor instance, Microsoft announced layoffs primarily targeting its mixed reality (MR unit, responsible for the HoloLens 2 AR headset.\\nTechnology major Google is cutting hundreds of jobs in its AR (Augmented Reality) hardware and voice assistant businesses, according to reports.\\nAnother tech giant Meta Platforms, which owns Facebook, Instagram and WhatsApp, has announced plans to cut 10,000 jobs in 2023.\\nChina-based ByteDance-owned virtual reality (VR) headset maker Pico is conducting a new round of\\u00a0job cuts\\u00a0in line with a restructuring.\\nThe latest IDC report said global shipments of augmented reality and virtual reality (AR VR) headsets fell 67.4 percent in the first quarter of 2024 as the market is transitioning to include new categories such as Mixed Reality (MR) and Extended Reality (ER).\\n\\nThe average selling price (ASP) of AR and VR headsets rose to over $1000 as Apple entered the market and incumbents such as Meta focused on premium headsets such as the Quest 3.\\nVirtual Reality headsets are forecast to reach 24.7 million units by the end of 2028, representing a five-year compound annual growth rate (CAGR) of 29.2 percent as the consumer base slowly grows beyond core gaming use cases and as businesses adopt more headsets for training, design, and more.\\nAugmented Reality headsets will grow from a smaller base of less than a million units in 2024 to 10.9 million in 2028, representing an 87.1 percent CAGR over the same period, Jitesh Ubrani, research manager,\\u00a0Mobility and Consumer Device Trackers\\u00a0at IDC, said.\\nGrowth plans\\nMeta and PICO plan to launch the Quest 3S and PICO 4S in the second half of 2024, both at lower prices than their predecessors to stimulate sales. Meanwhile, Sony\\u2019s PlayStation VR2 (PS VR2) will now support PC VR games, expanding beyond its previous PS5 exclusivity, which is anticipated to boost PS VR2 sales, Omdia said.\\nIDC report on share of AR VR vendors Q1 2024\\nAdditionally, Meta Platforms has announced the initial release of its XR operating systems to third-party OEMs, including ASUS, Lenovo, and Microsoft Xbox. Meta will also focus on enhancing the quality and quantity of its platform and application software to improve hardware terminal sales.\\nIn 2024, the XR market\\u2019s primary focus will be on the Apple Vision Pro. Its high price is expected to limit its sales, preventing it from significantly boosting overall market growth.\\nOmdia predicts that total XR set shipments in 2024 will remain steady compared to 2023, with near-eye display shipments also flat at 17.2 million units. Nonetheless, the Vision Pro has significantly increased the share of OLED on silicon (OLEDoS) displays.\\nThe XR industry is expected to remain stagnant for the next one to two years. While set shipments will experience slight fluctuations, near-eye display shipments are projected to increase more significantly due to the inevitable shift from single to dual displays.\\nBaburajan Kizhakedath\\nTweetShareSharePin\\n\\nPrevious articleEricsson posts 7% drop in sales to $5.7 bn in second-quarterNext articleTPG Telecom and Optus network sharing deal faces review in Australia\\n\\n\\nLatest\\n\\n\\n\\n\\n\\n \\n\\nTelia revenue grows 2.3% in Q2 as 5G yet to attract customers\\n\\n\\n\\n\\n\\n\\n \\n\\nNetflix grows revenue and subscriptions powered by strong video content\\n\\n\\n\\n\\n\\n\\n \\n\\nTelecom minister releases theme of 2024 India Mobile Congress\\n\\n\\n\\n\\n\\n\\n \\n\\nAirtel secures contract with CBDT for Taxnet-2.0 program\\n\\n\\n\\n\\n\\n\\n \\n\\nTelenor reveals 3% growth in revenue in Q2 after price hike\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMore like thisRelated\\n\\n\\n\\n\\n\\n \\n\\nSamsung dropped to third in India smartphone market\\n\\n\\n Telecom Lead -  July 18, 2024 \\n\\nThe latest Canalys research report has revealed two interesting...\\n\\n\\n\\n\\n\\n\\n \\n\\nUK regulators probe Big Tech\\u2019s growing influence in digital payment\\n\\n\\n Telecom Lead -  July 16, 2024 \\n\\nBritish regulators are investigating the increasing use of digital...\\n\\n\\n\\n\\n\\n\\n \\n\\nApple sale in India reaches $8 bn in 2023-24 fiscal\\n\\n\\n Telecom Lead -  July 15, 2024 \\n\\nApple has generated sales of almost $8 billion in...\\n\\n\\n\\n\\n\\n\\n \\n\\nSmartphone market growth and leading vendors in second-quarter\\n\\n\\n Telecom Lead -  July 15, 2024 \\n\\nIDC and Canalys have shared the growth trends in...\\n\\n\\n\\n  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\nABOUT US\\nPARTNERSHIP\\nPRIVACY POLICY\\nCONTACT US\\n\\n\\n\\n\\nAbout us\\n\\nNews website for 4G, 5G, Statistics, Telecom Services, Internet, Broadband, Broadcast, Network, Chips, and Smartphones.\\n\\n\\nFacebookLinkedinTwitter\\n\\nCompany\\n\\nABOUT US\\nPARTNERSHIP\\nPRIVACY POLICY\\nCONTACT US\\n\\n\\nThe latest\\n\\n\\n\\n\\n\\n \\n\\nTelia revenue grows 2.3% in Q2 as 5G yet to attract customers\\n\\n4G LTE\\n\\nJuly 19, 2024 0 \\n\\nTelecom operator Telia has revealed its main achievements in...\\n\\n\\n\\n\\n\\n\\n \\n\\nNetflix grows revenue and subscriptions powered by strong video content\\n\\nBroadcasting\\n\\nJuly 19, 2024 0 \\n\\nVideo streaming major Netflix, which provides exciting content including...\\n\\n\\n\\n\\n\\n\\n \\n\\nTelecom minister releases theme of 2024 India Mobile Congress\\n\\nTelecom Services\\n\\nJuly 19, 2024 0 \\n\\nJyotiraditya M Scindia, Minister for Communications, has released the...\\n\\n\\n\\n\\n\\n\\n\\n\\u00a9 2024 Kizhakedath Media Services. All rights reserved. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.dexerto.com/tech/mrbeast-gifts-retro-gaming-handhelds-airpods-to-youtubers-in-latest-video-2823019/\",\n        \"title\": \"MrBeast gifts retro gaming handhelds & AirPods to YouTubers in latest video - Dexerto\",\n        \"description\": \"Each content creator part of Mr Beast\\u2019s latest YouTube video received a package of goodies as thank you, including their very own retro gaming handheld.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"MrBeast gifts retro gaming handhelds & AirPods to YouTubers in latest video - DexertoRegisterSign inLogin to enable dark mode.Sign up for free to unlock exclusive perks:See fewer adsAn Ad-lite experience on articles.Dark ModeCustomize your Dexerto experience, choose between dark or light.Great deals with our monthly newsletterRecommendations for unmissable entertainment. Save money with the best online deals in Gaming, TV and Movies, and Tech.Already have a Dexerto Media Group account?LoginRegisterGamingEntertainmentTV & MoviesEsportsTechConnect With UsTwitterTwitchYouTubeMoreAbout UsAdvertise With UsArchiveAll NewsLaptopsPCsDisplaysPeripheralsFurnitureAlltechAll NewsLaptopsPCsDisplaysPeripheralsFurnitureSign up free nowSign inTechAll NewsLaptopsPCsDisplaysPeripheralsFurnitureTechMrBeast gifts retro gaming handhelds & AirPods to YouTubers in latest videoRosalie Newcombe\\u00a0 \\u2758 \\u00a0 Published: 2024-07-15T10:47:55MrBeast/Anbernic\\nEach content creator part of Mr Beast\\u2019s latest YouTube video received a package of goodies as thank you, including their very own retro gaming handheld.\\nMrBeast is no stranger to creating content involving some highly recognizable YouTubers and his latest video is no exception. 50 famous content creators faced off in his brand new video, ranging from everyone from Logan Paul to Moistcr1tikal, and Kai Cenat, all in a bid to win $1,000,000 for their subscriber base.Article continues after ad\\nWhile one lucky winner took home the big $1 million prize, everyone involved still got a consolation prize featuring some bottles of Prime and AirPods. Not only that, each of the 50 YouTubers received a retro gaming handheld to call their own.\\nThe discovery was made on r/SBCGaming, where a screenshot of LilyPichu\\u2019s vlog of her experience being in the MrBeast competition surfaced. Each participant was given a goody bag, which features custom AirPods, and something a little more unusual: An Anbernic RG353V handheld.Article continues after adArticle continues after ad\\n\\n\\n\\nThe Anbernic RG353V isn\\u2019t one of the priciest retro handhelds out there. In fact, the device with its 3.4-inch IPS display, and up to 2GB LPDDDR4 of RAM (depending on the version) has an MRSP of $120.99. \\nEven with all 50 YouTubers each receiving their own, that\\u2019s still just over $6000 USD of handhelds alone.\\nWhile the Anbernic RG353V is not the most expensive, or even the most high-powered retro handheld out there, MrBeast\\u2019s choice to give it away makes sense. The YouTuber has cited his love of the Nintendo Game Boy repeatedly in the past, even going so far as to commission a custom Game Boy from The Retro Future years ago.Related:MrBeast reveals insane ad revenue earned from Twitter/X videoArticle continues after ad\\nAlthough the RG353V is not an official Nintendo handheld, it takes after the Game Boy in multiple ways. Its form factor is highly reminiscent of that of the DMG model Game Boy but with some added extras. Article continues after ad\\nInstead of just a D-pad and two-button layout, the RG353V features a left stick, a full ABXY button layout, and built-in WiFi. \\nDepending on the version MrBeast gave away, the retro handheld also has a touch-screen to use alongside Android-based games, a microSD card slot, and a 3200mAH rechargeable battery. Maybe some of these creators will fall in love with the emerging retro handheld emulator scene.Article continues after ad\\nkeep readingYouTubeMrBeast breaks his own record for day-one viewership with latest videoDaniel ApplefordYouTubeEvery creator in MrBeast\\u2019s $1 million YouTuber challenge & how they got eliminatedCarver FisherYouTubeMrBeast reveals video idea he wasn\\u2019t allowed to makeAlice Sj\\u00f6bergEntertainmentHow to apply for MrBeast\\u2019s $5 million Beast Games competitionMeera JackaYouTubeMrBeast urges billionaires to put their \\u201cunfathomable wealth\\u201d into YouTube contentMichael GwilliamYouTubeMrBeast reveals how much money he\\u2019s made reposting old YouTube videos to XMeera JackaYouTubeMrBeast\\u2019s Beast Games: Prize, where to watch & moreShay RobsonEntertainmentCreators furious as MrBeast nets $250K on Twitter/X for posting old videoVirginia GlazeRelated TopicsHandheldslilypichuMrbeastAbout The AuthorRosalie NewcombeDexerto's Senior Tech Writer. Rosalie is an expert on all things handhelds, and has been picking them up since the original Game Boy, all the way up to the Steam Deck. Before working at Dexerto, they covered all things hardware for PCGamesN and Custom PC. Get in touch via email at rosalie.newcombe@dexerto.com.Sign up to Dexerto for free and receive:Fewer Ads|Dark Mode|Deals in Gaming, TV and Movies, and TechEmailSign upAbout Dexerto: Editorial staff, standards and policiesAdvertise with usCookies PolicyPrivacy PolicyTerms and ConditionsAcceptable Use PolicyEditorial StaffWe may earn an affiliate commission from links on this pageDexerto.esDexerto.fr\\u00a9 Copyright 2024 Dexerto Ltd.\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://au.news.yahoo.com/victorian-mans-high-voltage-christmas-display-programmed-to-ac-dc-goes-viral-33539630.html\",\n        \"title\": \"Victorian man's high voltage Christmas display programmed to AC/DC goes viral\",\n        \"description\": \"A Victorian electronics and computer whiz has become an online sensation, with a video of his Christmas lights display, programmed in tune with Aussie classic Thunderstruck, going viral.\",\n        \"language\": \"en-AU\"\n      },\n      \"page_content\": \"Victorian man's high voltage Christmas display programmed to AC/DC goes viral        HOME    MAIL    NEWS    FINANCE    SPORT    LIFESTYLE    ENTERTAINMENT    WEATHER    MORE...                  Yahoo News       Search query             Sign in    Mail  Sign in to view your emails      News     Latest    National    Sydney Melbourne Brisbane Adelaide Perth     World     Environment    \\u2026  AdvertisementClose this contentRead full articleYahoo News AustraliaVictorian man's high voltage Christmas display programmed to AC/DC goes viralMel ButtigiegUpdated 14 December 2016 at 12:41 pmLink copiedA Victorian electronics and computer whiz has become an online sensation, with a video of his Christmas lights display, programmed in tune with Aussie classic Thunderstruck, going viral.Greg Jaeschke wired his Shepparton home with an impressive light spectacular, complete with flame blasts, timed with the AC/DC hit.Shepparton man Greg Jaeschke has created a Christmas light spectacular to the tune of AC/DC's Thunderstruck. Picture: Greg Jaeschke/FacebookDespite his neighbours not being a huge fan of the spectacular, the 24-year-old\\u2019s efforts have been applauded by the 5.5 million people who have viewed the video of the show online in just one week.Mr Jaeschke has been putting on a light and music display each December since 2014.RELATED: 'How could you do this?': Christmas Grinch ransacks family yard Lindsay Lohan apologises for snubbing Christmas lights switch on 'I was crying so hard': Santa impersonator devastated after little boy dies in his arms\\u201cI use controllers I\\u2019ve customised meself. I cut all the wires off the ones you buy from the shop and wire them all into me controllers,\\u201d he told Sunrise on Wednesday morning.To achieve the pyrotechnic affect where flames are shot from the roof of the home, Mr Jaeschke used an aerosol can connected to an instant engine starter.Greg Jaeschke's handiwork has gone viral, with a video of the display viewed 5.5 million times in one week. Picture: SunriseAlong with the Acca Dacca classic, Mr Jaeschke\\u2019s lighting displays have also been set to other songs including Black Betty and Here\\u2019s Johnny. Each of the musical displays about six hours to program.The lighting guru said a new song would be added to the display each night until Christmas Eve.Asked if he would consider a Justin Bieber song in future, Mr Jaeschke told Sunrise he \\u201cwouldn\\u2019t be doing Bieber\\u201d.Up nextUp nextUp nextUp nextLatest storiesCountry LivingA Body Language Expert Reveals Kate Middleton's 3 \\\"Tells\\\" at WimbledonA body language expert Revealed Kate Middleton's 3 \\\"tells\\\" at Wimbledon.HuffPostNew York Mag Cover Of Near-Naked Trump And Biden Sparks BacklashPeople were not impressed with the revealing cover image of the current and former president.CosmoBlake Lively's hugeee tutu skirt and sequin bra top is serving sugarplum fairy realnessBlake Lively is currently promoting her new film It Ends With Us but transformed into a ballerina for the latest press event wearing a Bode tutu and sequin bra.Yahoo Sport AustraliaNRL makes call on Reece Walsh sanction as fans call out QLD fullback over ugly Origin scenesReece Walsh has been sanctioned by the NRL. Read more here.Yahoo Sport AustraliaChannel 9 cops backlash over 'deplorable' State of Origin move as commentary divides NRL fansChannel 9's commentary team are often at the centre of backlash. Read more here.HuffPost UKWhy King Charles Is Facing Backlash After Another Seemingly Tetchy Moment Caught On CameraIs this the sequel to pengate?Yahoo Sport AustraliaQueensland's pathetic reaction to State of Origin loss that shows they're kidding themselvesCorey Parker and Billy Slater have been put in their place. Read more here.ParadeQueen Camilla Honored on Her 77th Birthday With Personal Portrait Taken By Kate Middleton'What an absolutely beautiful photo this is,' one fan declared.Yahoo News AustraliaRare $500k collection removed from Aussie home after tip from European authoritiesOver 3,404 items have been seized from a Tasmanian home. Find out why.The IndependentRoyal news live: Prince Harry suffers Invictus blow as it emerges Trump gunman researched royal family memberThe Duke of Sussex controversially accepted the Pat Tillman Award last week.Yahoo Sport AustraliaDustin Martin's overseas trip comes to light as Richmond hit by new blow around AFL champRichmond fans are growing increasingly frustrated with Dustin Martin. Read more here.InStyleWhy Prince William and Kate Middleton Passed on a Castle Queen Elizabeth Saved for ThemPetition for the royals to have their own real estate show.HuffPostBlake Lively Captures Life With Ryan Reynolds In Hilarious 'Family Portrait'The photo was missing four key family members, but that's beside the point.CNNMan who escaped Oregon prison 30 years ago was found in Georgia with a stolen identity, authorities sayA man who escaped from an Oregon state prison nearly 30 years ago and stole the identity of a deceased child was captured in Georgia on Tuesday, according to authorities.The IndependentMAGA Republican Kari Lake is schooled by reporter at RNC over JD Vance\\u2019s Trump is \\u2018Hitler\\u2019 comment\\u2018I actually think you need your head examined,\\u2019 failed Arizona candidate tells ex-BBC presenter Emily MaitlisHuffPostEx-RNC Chair Michael Steele Asks 5 Pressing Questions About Trump's Rally InjuriesThe former president has \\\"not provided any medical updates or information, neither has the hospital that treated him,\\\" the former GOP grandee noted.Yahoo LifestyleKourtney Kardashian reveals 'terrifying' reason she could never move to AustraliaIn a new episode of The Kardashians, Kourtney shared a 'terrifying' experience she had in Australia. Read more.BuzzFeedOkay, I Can't Stop Laughing At These Extremely Petty People Who Got Even In Literally The Best Way PossibleDon't just get even... get petty.NewsWireBombshell after camper murder verdictThe guilty verdict against a former Jetstar pilot in the murder of a missing camper is \\u201cin great doubt\\u201d, the killer\\u2019s lawyer says.BANG ShowbizNick Jonas's birthday tribute to Priyanka ChopraNick Jonas has gushed about how \\\"lucky\\\" he is to be married to Priyanka Chopra, as they celebrate her 42nd birthday.More stories\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.mirror.co.uk/3am/us-celebrity-news/prince-harry-in-good-place-33234136\",\n        \"title\": \"Prince Harry is \\u2018in a good place\\u2019 after putting on united display with Meghan Markle - Mirror Online\",\n        \"description\": \"Prince Harry is \\u2018in a good place\\u2019 after putting on united display with Meghan Markle at the ESPY awards during the week, with the Duke of Sussex winning an award and making a speech\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPrince Harry is \\u2018in a good place\\u2019 after putting on united display with Meghan Markle - Mirror Online\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n US Edition \\u25bcUS EditionUK EditionIrish MirrorNewsUK NewsUS NewsWorld NewsWeird NewsReal LifeMore HopefulTeamDogsIn Your AreaPoliticsHealthWeatherCrimeRoyalsMoneyTechScienceSportFootballBoxingUFCCricketRugby UnionRugby LeagueF1RacingGolfTennisAthleticsDartsSnookerUS SportsBettingTravelNewsUK & IrelandEuropeUSA & CanadaCaribbeanAfricaCruisesCheap FlightsAsia & Middle EastAustralia & New ZealandCentral & South AmericaLifestyleFamilyFashion & BeautyMotoringSex & RelationshipsFood & DrinkGamingGardeningCelebsTVFilmsUS Celebrity NewsPartnersBingoCartoonsCompetitionsCrosswordsDatingFuneral NoticesHoroscopesOffersPartner StoriesNewsletter signupVoucher codesAsosNikeArgosJohn LewisCurrysBookingSHEINPrettylittlethingGrouponBoohooMirror ChoiceOpinionSearchFollow us on socialMoneyIn Your AreaGot A Story?ShopShareNewsPoliticsFootballCelebsTVShoppingRoyalsShare\\n\\nNewsPoliticsFootballCelebsTVShoppingRoyals\\nPrince Harry is \\u2018in a good place\\u2019 after putting on united display with Meghan MarklePrince Harry is \\u2018in a good place\\u2019 after putting on united display with Meghan Markle at the ESPY awards during the week, with the Duke of Sussex winning an award and making a speechPrince Harry is \\u2018in a good place\\u2019 (Image: (Image: Getty))ByMollie QuirkUS Showbiz & TV Reporter09:04, 13 Jul 2024Updated09:50, 13 Jul 2024|commentsPrince Harry is said to be \\\"in a good place\\\" after he displayed a \\\"sense of honour\\\" and \\\"felt every word\\\" when he accepted an award at the ESPYs this week. The Duchess of Sussex accompanied her husband at a ceremony in Los Angeles on Thursday night, where the Duke of Sussex received the Pat Tillman Award for Service, awarded by sports channel ESPN to individuals in the sporting world who have made significant contributions to the lives of others. Harry was awarded the gong for founding the Invictus Games a decade ago to support injured and sick servicemen and women.  Harry opened his acceptance speech by acknowledging the family of Mr Tillman, \\\"especially Mrs Mary Tillman \\u2013 Pat's mother. Her advocacy for Pat's legacy is deeply personal, and one that I respect,\\\" he said. \\\"The bond between a mother and son is eternal and transcends even the greatest losses,\\\" he added.  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThe couple were in attendance and smiled for the camera\\n (\\n\\nImage:\\nGetty Images for W+P)\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMeghan Markle and Harry looked smitten at the event\\n (\\n\\nImage:\\nGetty Images for W+P)\\n\\n  Speaking on behalf of Betfair Roulette, body language expert Darren Stanton revealed that the Duke is \\\"in a good place\\\". He said: \\\"Prince Harry \\u2019s body language was very strong when he accepted the award. He displayed a sense of honour and inner pride. When he was speaking about the Invictus Games, it was clear it was very close to his heart.\\\" Mr Stanton added: \\\"When we look at his body language more specifically, both his feet were planted on the floor and barely moved. This is a clear sign of Harry feeling in control without an ounce of nervousness. He\\u2019s in a good place right now. Harry spoke with clarity, confidence, and passion - revealing he felt every word he came out with.\\\" Then, touching on when Harry spoke of the \\\"bond between a mother and son\\\", Mr Stanton noted: \\\"When Harry paid a tribute to his mother, you can tell he was processing his emotions.  \\\"He flashed expressions of sadness, which was understandable as he was thinking about her in that moment throughout his speech. However, he was able to keep calm and level-headed. This shows how comfortable Harry is with speaking publicly.\\\" This comes after Harry and Meghan put on a loved-up display at the awards, with \\\"ownership\\\" hinted from Meghan by an expert. Judi James, a renowned body language expert, told The Mirror yesterday: \\\"Meghan\\u2019s pose on the red carpet with her husband and her friend Serena does make it look as though she\\u2019s either got his back or acting as back-up as he turns his torso partly towards Serena, placing an arm around her waist, while Meghan poses behind him using gestures of ownership and loving support.\\\" Follow Mirror Celebs on    TikTok    ,    Snapchat    ,    Instagram    ,    Twitter    ,    Facebook    ,    YouTube    and    Threads    .  \\n\\n\\n\\n\\n\\n\\n\\n\\nBeauty fans swear Rihanna\\u2019s Fenty Hair is a \\u2018game changer\\u2019 \\n\\nTop Stories     Don't Miss  FollowMirrorFacebookTwitterComment MORE ONPrince HarryRoyal FamilyGet our daily royal round-up direct to your inboxSign upInvalid EmailSomething went wrong, please try again later.We use your sign-up to provide content in ways you\\u2019ve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you. More infoThank you for subscribingWe have more newslettersShow meSee ourPrivacy NoticeStory SavedYou can find this story in \\u00a0My Bookmarks.Or by navigating to the user icon in the top right.Top StoriesRecommended\\nHome3amUS Celebrity NewsPrince Harry\\nTop StoriesGLOBAL CHAOS: Huge IT outage grinds world to a halt as airports, banks and supermarkets go offline - follow LIVE hereThameslinkMillions of Windows PCs show dreaded blue screen of death after worldwide IT outageMicrosoft OfficeGlobal IT outage: All of the UK airports hit by horror issue sparking travel chaos and flight delaysGatwick AirportDoctors' surgeries hit by global IT outage as patients unable to book GP appointmentsNHSMan Utd among Premier League clubs forced to halt ticket sales amid global IT outageManchester United FCA STATE OF EMERGENCY: Keir Starmer urged to call Cobra meeting as global IT outage causes chaosPoliticsSkincare fans swear by these pimple patches to help clear spots up 'overnight'BeautyStrictly Come Dancing's Giovanni Pernice splits from girlfriend following abuse scandal Giovanni PerniceWindows users urged to take urgent action now to fix PCs after global IT outageMicrosoftGlobal IT outage: Flight and airport hell after Microsoft computer carnageAmerican AirlinesMicrosoft breaks silence on mass IT outage which sparked global chaosMicrosoftGlobal IT outage: List of UK businesses affected including Gail's and Sky NewsMicrosoft\\n\\n\\n\\nPopular TopicsNewsWeird NewsTravelTechPoliticsShowbizLife & StyleMumsFootballFamilyMoneyFilmTVSportFashionTeamDogsMotoringSubscribeNewsletter preference centreSubscribe to Daily Mirror and Sunday Mirror newspapersSubscribe to tablet editionSecondary Menu ItemsOur PartnersBeauty Box SubscriptionMirror BingomynewsassistantCrosswords, Puzzles & GamesBettingFree BetsPartner StoriesSupportHow to ComplainNotifications and alerts helpCorrections and ClarificationsCompanyAbout UsWork for usContact UsIrish MirrorSyndication & LicensingSell your storyResourcesMarketplaceFind a local businessFind a jobShopDiscount codesInYourArea\\u00a92024 a Reach plc subsidiaryPrivacy NoticeAI NoticeCookie NoticeTerms and ConditionsCommunity Standards\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://jerseyeveningpost.com/news/2024/07/18/air-display-organisers-appeal-to-the-public-to-save-the-event/\",\n        \"title\": \"Air Display organisers appeal to the public to save the event - Jersey Evening Post\",\n        \"description\": \"ORGANISERS of the Jersey International Air Display are appealing to the public to help save this year\\u2019s event.Mike Higgins \\u2013 who has run the event for [\\u2026]\",\n        \"language\": \"en-GB\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\nAir Display organisers appeal to the public to save the event - Jersey Evening Post\\n\\n\\n\\nAir Display organisers appeal to the public to save the event - Jersey Evening Post\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nProperty\\nJobs\\nMotoring\\nFamily Notices\\nPicture Sales\\nRead the eEdition\\nSign-up to our newsletter\\nMy account\\n  \\n \\n\\n\\n \\n \\n\\n\\nHome\\nNews\\nBusiness\\nSport\\n\\nSport\\nUK Sport\\nViral Sport\\n\\n\\nMore News\\n\\nLooking Back\\nVoices\\nUK News\\nWorld News\\nViral News\\nEntertainment\\nMotoring\\n\\n\\nWeather\\nPuzzles\\nCompetitions\\nSubscribe\\n\\n \\n\\n\\n\\n\\n \\n\\n \\n\\n\\n\\n\\n\\n\\r\\n        Search\\r\\n        \\n\\n  \\n \\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nHome\\nNews\\nBusiness\\nSport\\n\\nSport\\nUK Sport\\nViral Sport\\n\\n\\nMore News\\n\\nLooking Back\\nVoices\\nUK News\\nWorld News\\nViral News\\nEntertainment\\nMotoring\\n\\n\\nWeather\\nPuzzles\\nCompetitions\\nSubscribe\\n\\nProperty\\nJobs\\nMotoring\\nFamily Notices\\nPicture Sales\\nRead the eEdition\\nSign-up to our newsletter\\nMy account\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\r\\n        Search\\r\\n        \\n\\n \\n\\n\\n\\n\\n\\n\\n\\nAir Display organisers appeal to the public to save the event\\n\\n\\nNews, Top Stories        |\\r\\n    \\n\\nPublished: 1 day ago        |\\r\\n    \\n\\nLast Updated: 1 day ago        |\\r\\n    \\n  \\r\\n        By Rod McLoughlin    \\n\\n\\n\\n Patrouille de France performing at last year\\u2019s event Picture: DAVID FERGUSON (38594556)\\n\\n\\n\\n\\n\\n\\n \\n\\nORGANISERS of the Jersey International Air Display are appealing to the public to help save this year\\u2019s event.\\nMike Higgins \\u2013 who has run the event for the last 23 years \\u2013 said that while they welcomed the support they received from Ports of Jersey and the government, they needed Islanders to help close their funding gap.\\n\\u201cIn 2023 and 2022 we received \\u00a360,000 from the government. In previous years various amounts up to \\u00a3100,000 were received as a grant. However this year, due to budgetary restrictions, the annual grant has been limited to \\u00a340,000 and sadly costs have not gone down and in fact have increased substantially,\\u201d Mr Higgins said.\\nA Lancaster flying high at the Jersey International Air Display in 2023 Picture: DAVID FERGUSON. (38594549)\\n\\nA crowdfunding page has been launched and Mr Higgins said that if each person who watched the display were to donate \\u00a35, it would not only fund this year\\u2019s display but also put the event on a more sustainable footing for the future.\\n\\u201cThe Jersey International Air Display is part of the DNA of our Island community. Not only is it a significant event in the Island\\u2019s calendar for locals and visitors alike but, with its origins in the previous Battle of Britain Air Display, it also remains a poignant reminder of the reasons behind our Liberation, and our liberty. It also remains a significant day for relevant charities to raise funds to care for our military veterans,\\u201d Mr Higgins said.\\nWatched in person and online by more than 50,000 people \\u2013 the organisers say \\u2013 the display is funded from a combination of private and government sources. Mr Higgins explained that, having had to reduce its scale as a result of restrictions following the Covid pandemic, they now aspired to return the event to its previous stature with enhanced static displays and educational areas.\\nJersey International Air Display organiser Mike Higgins at the 2023 display Picture: James Jeune (38598762)\\n\\nAircraft booked for the 2024 display include the \\u00c9quipe de Voltige de l\\u2019Arm\\u00e9e de l\\u2019Air (French Air Force Extra 330), the RAF Falcons parachute display team, the RAF Battle of Britain Memorial Flight Lancaster, the French North American OV-10 Bronco, French Conair Turbo Firecat (ex-S\\u00e9curit\\u00e9 Civile fire fighting aircraft), Consolidated PBY Catalina flying boat and the Dutch Fokker D.XXI WW II fighter.\\nMr Higgins said that, in the event that the 2024 display did not take place, all funds raised would be put towards next year\\u2019s event, or split between Jersey\\u2019s Helping Wings charity and British Military Service charities if the decision were taken not to proceed permanently.\\nThose wishing to support the event can do so using the link: sportsgiving.co.uk/sponsor/activity/appeal-for-12-september-2024/jersey-international-air-display.\\n\\n\\n\\n\\n\\n \\n\\n\\n\\nPlease enable JavaScript to view the comments powered by Disqus. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\u2013 Advertisement \\u2013\\n\\n\\n\\n\\n \\n\\n\\n\\n\\t\\t\\tTrending Stories\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tParamedics convicted of failing to provide reasonable care receive conditional discharge\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tHospital staff \\u2018upset and furious about defamatory and erroneous criticism\\u2019\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tWoman found in the sea had \\u2018remarkable\\u2019 level of alcohol in her system, inquest hears\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tRoyal visit: March past is deluged by April showers in mid-July\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCar \\\"driven into man\\\" during road-rage incident in Jersey\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\u2013 Advertisement \\u2013\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\tUK News\\t\\t\\t\\n\\n\\n\\n \\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUK News\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tMore than 15,000 migrants arrive in UK crossing English Channel this year so far\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t19 July, 2024\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n \\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUK News\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tPolice remain in Leeds suburb as West Yorkshire Mayor condemns violent disorder\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t19 July, 2024\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n \\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUK News\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUK public sector borrowing higher than forecast in June\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t19 July, 2024\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n \\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUK News\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tRetailers blame \\u2018election uncertainty\\u2019 as sales drop in June\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t19 July, 2024\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\tMore UK News\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tRead the latest free supplements\\t\\t\\n\\n\\t\\t\\tRead the Town Crier, Le Rocher and a whole host of other subjects like mortgage advice, business, cycling, travel and property.\\t\\t\\nRead More\\n\\n\\n \\n\\n\\n\\n\\u2013 Advertisement \\u2013\\n\\n\\n\\n\\n\\n\\n\\n\\n\\u2013 Advertisement \\u2013\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n \\u00a9 2024 Jersey Evening Post. All rights reserved.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\nGet involved\\nSend us your news\\nDelivery And Subscriptions\\nPride of Jersey\\nHelp Lines\\n  \\n\\nUseful links\\nAdvertise with us\\nOur services and platforms\\nMaking A Complaint\\nBailiwick Express\\nConfidential\\n  \\n\\nAbout the website\\nAbout Us\\nContact us\\nTerms of website use\\nPrivacy policy\\nComment Policy\\n  \\n \\n\\n\\nPowered by PageSuite\\n \\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.thehindu.com/news/national/telangana/hyderabad-mp-slams-up-police-fiat-to-display-names-of-owners-staff-of-eateries/article68417913.ece\",\n        \"title\": \"\\n\\tAIMIM chief Asaduddin Owaisi slams UP police fiat to display names of owners, staff of eateries - The Hindu\\n\",\n        \"description\": \"AIMIM president Asaduddin Owaisi criticises the UP government for discriminatory order against Muslim eatery staff during Kanwar Yatra.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\tAIMIM chief Asaduddin Owaisi slams UP police fiat to display names of owners, staff of eateries - The Hindu\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIndia\\n\\n\\n\\nWorld\\n\\n\\n\\nMovies\\n\\n\\n\\nBudget 2024\\n\\n\\n\\ne-Paper\\n\\n\\n\\nMenu\\n\\n\\n\\n\\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\nFREE TRIALGIFT a Subscription\\nSubscribe\\nLOGIN\\nACCOUNT\\n\\nPREMIUM\\n\\nOpen in The Hindu AppFREE TRIALLOGINGIFT a Subscription\\nACCOUNT\\n\\nPREMIUM\\nSubscribe \\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\nIndia\\n\\n\\n\\nWorld\\n\\n\\n\\nMovies\\n\\n\\n\\nBudget 2024\\n\\n\\n\\ne-Paper\\n\\n\\n \\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\n\\nEntertainment\\n\\n\\n\\n\\nLife & Style\\n\\n\\n\\n\\nSociety\\n\\n\\n\\n\\nTechnology\\n\\n\\n\\n\\nVideos\\n\\n\\n\\n\\nSport\\n\\n\\n\\n\\nCities\\n\\n\\n\\n\\nStates\\n\\n\\n\\n\\nScience\\n\\n\\n\\n\\nShow More\\n\\n\\n\\n\\n\\n\\n\\nChennai\\n\\n\\n\\n\\nDelhi\\n\\n\\n\\n\\nBengaluru\\n\\n\\n\\n\\nHyderabad\\n\\n\\n\\n\\nMovies\\n\\n\\n\\n\\nFood\\n\\n\\n\\n\\nChildren\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nKochi\\n\\n\\n\\n\\nBooks\\n\\n\\n\\n\\nEducation\\n\\n\\n\\n\\nPodcast\\n\\n\\n\\n\\nBrandhub\\n\\n\\n\\n\\nTo enjoy additional benefitsFREE TRIALGIFT a Subscription\\nSubscribe\\nLOGIN\\nACCOUNT\\n\\nPREMIUM\\nShowcaseSubscribe to NewslettersCrossword+CONNECT WITH US\\nHome\\n\\nNews\\n\\nIndia\\n\\nTelangana\\n\\nAIMIM chief Asaduddin Owaisi slams UP police fiat to display names of owners, staff of eateries\\nHyderabad parliamentarian Asaduddin Owaisi describes the order as a move to bring back untouchabilityUpdated  - July 18, 2024 09:32 pm IST Published - July 18, 2024 07:32 pm IST - HYDERABAD The Hindu Bureau\\nCopy link\\n\\nEmail\\n\\nFacebook\\n\\nTwitter\\n\\nTelegram\\n\\nLinkedIn\\n\\nWhatsApp\\n\\nReddit\\nREAD LATER\\nRemove\\n\\nSEE ALL\\nPRINT\\nAll India Majlis-e-Ittehadul Muslimeen (AIMIM) president Asaduddin Owaisi. File\\n| Photo Credit: PTI\\nAll India Majlis-e-Ittehadul Muslimeen (AIMIM) president Asaduddin Owaisi on Thursday lambasted the Uttar Pradesh (UP) government after a police order reportedly instructed owners of eateries along the Kanwar Yatra to display names of staff. He said this order was akin to reviving untouchability.Speaking to the media at party headquarters in Darussalaam, the Hyderabad parliamentarian said the oral order was in violation of the articles in the Constitution that deal with the right to live, the right to a livelihood and abolishing of untouchability. \\u201cWe have removed untouchability under Article 17, and you are bringing it back. It is a clear-cut discriminatory order. It shows that they want to make Muslims second-class citizens in UP, and in the country,\\u201d he said, adding that since the Uttar Pradesh government gave the order, Muslims working in the dhabas of Muzaffarnagar have been fired.Contesting the Uttar Pradesh government stand, Mr. Owaisi said: \\u201cI challenge you to issue a written order. The Yogi Adityanath government should release a written order and show it to us. There is clear discrimination that is happening against Muslims. The Constitution is being smashed to smithereens.\\u201dThe AIMIM chief said the order gives the impression that Adolf Hitler\\u2019s spirit have entered Uttar Pradesh Chief Minister Yogi Adityanath\\u2019s body. \\u201cThis is like the krystallnacht moment. Hitler did a Judenboykott. This kind of a boycott is being done by the Uttar Pradesh government. Who are you to do this? Will you give a yatra so much importance at the cost of ruining the livelihoods of others? Will you work for just one community? Where will the Constitution go? In the dustbin?\\u201d Mr. Owaisi said.He ascribed the move to the pressure exerted by Hindutva organisations, and claimed that the move has radicalised sections of the Hindu community. \\u201cWhy is there so much hate in the BJP for the Muslims?\\u201d he sought to know.\\nRead Comments \\nCopy link\\n\\nEmail\\n\\nFacebook\\n\\nTwitter\\n\\nTelegram\\n\\nLinkedIn\\n\\nWhatsApp\\n\\nReddit\\nREAD LATER\\nRemove\\n\\nSEE ALL\\nPRINT\\nRelated Topics\\n\\nTelangana\\n\\n/\\n\\nAll India Majlis-E-Ittehadul Muslimeen\\nTop News Today0 / 0\\nRead in App\\n\\n\\n\\nThe Hindu\\n\\n\\n\\nAbout Us\\n\\n\\n\\n\\nCode of Editorial Values\\n\\n\\n\\n\\nNews Archive\\n\\n\\n\\n\\nSitemap\\n\\n\\n\\n\\nPrint Subscription\\n\\n\\n\\n\\nDigital Subscription\\n\\n\\n\\n\\nSubscribe to Newsletters\\n\\n\\n\\n\\nRss Feeds\\n\\n\\n\\n\\nReaders Editor-Terms of Reference\\n\\n\\n\\n\\nAuthors & Contributors\\n\\n\\n\\n\\n\\nContact us\\n\\n\\n\\nContact Us\\n\\n\\n\\n\\nSocial Media\\n\\n\\n\\n\\nAdvertise With Us\\n\\n\\n\\n\\n\\nGroup News Sites\\n\\n\\n\\nBusiness Line\\n\\n\\n\\n\\nBL on Campus\\n\\n\\n\\n\\nSportstar\\n\\n\\n\\n\\nFrontline\\n\\n\\n\\n\\n\\u0b87\\u0ba8\\u0bcd\\u0ba4\\u0bc1 \\u0ba4\\u0bae\\u0bbf\\u0bb4\\u0bcd \\u0ba4\\u0bbf\\u0b9a\\u0bc8\\n\\n\\n\\n\\nThe Hindu Centre\\n\\n\\n\\n\\nYoung World Club\\n\\n\\n\\n\\nThe Hindu ePaper\\n\\n\\n\\n\\nBusiness Line ePaper\\n\\n\\n\\n\\nCrossword + Free Games\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nOther Products\\n\\n\\n\\nRoofandFloor\\n\\n\\n\\n\\nSTEP\\n\\n\\n\\n\\nImages\\n\\n\\n\\n\\nClassifieds - Print\\n\\n\\n\\n\\nBookstore & Special Publications\\n\\n\\n\\n\\n\\nPopular Sections\\n\\n\\n\\nElections\\n\\n\\n\\n\\nIsraeli\\u2013Palestinian conflict 2023\\n\\n\\n\\n\\nLatest News\\n\\n\\n\\n\\nNational News\\n\\n\\n\\n\\nInternational News\\n\\n\\n\\n\\nVideos\\n\\n\\n\\n\\nLife & Style\\n\\n\\n\\n\\nFood\\n\\n\\n\\n\\nPodcast\\n\\n\\n\\n\\nShowcase\\n\\n\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\n\\nEditorial\\n\\n\\n\\n\\nColumns\\n\\n\\n\\n\\nComment\\n\\n\\n\\n\\nCartoon\\n\\n\\n\\n\\nLetters\\n\\n\\n\\n\\nInterview\\n\\n\\n\\n\\nLead\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\n\\nAgri-Business\\n\\n\\n\\n\\nIndustry\\n\\n\\n\\n\\nEconomy\\n\\n\\n\\n\\nMarkets\\n\\n\\n\\n\\nBudget\\n\\n\\n\\n\\n\\n\\nSport\\n\\n\\n\\n\\nCricket\\n\\n\\n\\n\\nFootball\\n\\n\\n\\n\\nHockey\\n\\n\\n\\n\\nTennis\\n\\n\\n\\n\\nAthletics\\n\\n\\n\\n\\nMotorsport\\n\\n\\n\\n\\nRaces\\n\\n\\n\\n\\nOther Sports\\n\\n\\n\\n\\n\\n\\nSci-Tech\\n\\n\\n\\n\\nScience\\n\\n\\n\\n\\nTechnology\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nAgriculture\\n\\n\\n\\n\\nEnvironment\\n\\n\\n\\n\\nGadgets\\n\\n\\n\\n\\nInternet\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nStates\\n\\n\\n\\n\\nAndhra Pradesh\\n\\n\\n\\n\\nKarnataka\\n\\n\\n\\n\\nKerala\\n\\n\\n\\n\\nTamil Nadu\\n\\n\\n\\n\\nTelangana\\n\\n\\n\\n\\n\\n\\nCities\\n\\n\\n\\n\\nBengaluru\\n\\n\\n\\n\\nChennai\\n\\n\\n\\n\\nCoimbatore\\n\\n\\n\\n\\nDelhi\\n\\n\\n\\n\\nHyderabad\\n\\n\\n\\n\\nKochi\\n\\n\\n\\n\\nKolkata\\n\\n\\n\\n\\nKozhikode\\n\\n\\n\\n\\nMadurai\\n\\n\\n\\n\\nMangaluru\\n\\n\\n\\n\\nMumbai\\n\\n\\n\\n\\nPuducherry\\n\\n\\n\\n\\nThiruvananthapuram\\n\\n\\n\\n\\nTiruchirapalli\\n\\n\\n\\n\\nVijayawada\\n\\n\\n\\n\\nVisakhapatnam\\n\\n\\n\\n\\n\\n\\nTrending on The Hindu\\nNews\\n\\nIndia News\\n\\nLive News from the Hindu\\n\\nNEET-UG 2024 hearing LIVE\\n\\nAanvi Kamdar News: Travel influencer dies after falling into gorge\\n\\nTDS Fraud Case\\n\\nSC directs NTA to publish results by July 20 noon\\n\\nIndia vs Sri Lanka Squad: Suryakumar Yadav to lead India in T20Is\\n\\nLast universal common ancestor (LUCA)\\n\\nED raids premises of Haryana Congress MLA, others in \\u20b91,400 crore bank fraud case\\nTrending on Group sites\\nStock Market Live Updates\\n\\nStocks to buy today\\n\\nLok Sabha Election Results 2024\\n\\nSpain vs England LIVE\\n\\nGold Rate Today\\n\\nSilver Rate Today\\n\\nCSK vs SRH LIVE\\n\\nFootball News\\n\\nPolitics News\\n\\nFrontline Current Issue\\n\\n\\n\\nTerms of Use\\n\\n\\n\\n\\nPrivacy Policy\\n\\n\\n \\n\\nCopyright\\u00a9 2024, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\\nBACK TO TOPSign in to unlock member-only benefits!Access 10 free stories every monthSave stories to read laterAccess to comment on every storySign-up/manage your newsletter subscriptions with a single clickGet notified by email for early access to discounts & offers on our products\\u2715Looks like you are already logged in from more than 3 devices!To continue logging in, remove at least one device from the below listLog outLog Out from all devicesTerms & conditions\\u00a0\\u00a0|\\u00a0\\u00a0Institutional SubscriberCommentsComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.thehindu.com/news/cities/puducherry/administration-launches-dedicated-number-to-complain-display-of-illegal-hoardings-in-puducherry/article68418021.ece\",\n        \"title\": \"\\n\\tAdministration launches dedicated number to complain display of illegal hoardings in Puducherry - The Hindu\\n\",\n        \"description\": \"Puducherry launches helpline for reporting illegal hoardings, banners, and cut-outs, urging residents to cooperate in maintaining cleanliness.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\tAdministration launches dedicated number to complain display of illegal hoardings in Puducherry - The Hindu\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIndia\\n\\n\\n\\nWorld\\n\\n\\n\\nMovies\\n\\n\\n\\nBudget 2024\\n\\n\\n\\ne-Paper\\n\\n\\n\\nMenu\\n\\n\\n\\n\\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\nFREE TRIALGIFT a Subscription\\nSubscribe\\nLOGIN\\nACCOUNT\\n\\nPREMIUM\\n\\nOpen in The Hindu AppFREE TRIALLOGINGIFT a Subscription\\nACCOUNT\\n\\nPREMIUM\\nSubscribe \\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\nIndia\\n\\n\\n\\nWorld\\n\\n\\n\\nMovies\\n\\n\\n\\nBudget 2024\\n\\n\\n\\ne-Paper\\n\\n\\n \\n\\n\\n\\nOlympics\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\nSEARCH\\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\n\\nEntertainment\\n\\n\\n\\n\\nLife & Style\\n\\n\\n\\n\\nSociety\\n\\n\\n\\n\\nTechnology\\n\\n\\n\\n\\nVideos\\n\\n\\n\\n\\nSport\\n\\n\\n\\n\\nCities\\n\\n\\n\\n\\nStates\\n\\n\\n\\n\\nScience\\n\\n\\n\\n\\nShow More\\n\\n\\n\\n\\n\\n\\n\\nChennai\\n\\n\\n\\n\\nDelhi\\n\\n\\n\\n\\nBengaluru\\n\\n\\n\\n\\nHyderabad\\n\\n\\n\\n\\nMovies\\n\\n\\n\\n\\nFood\\n\\n\\n\\n\\nChildren\\n\\n\\n\\n\\nData\\n\\n\\n\\n\\nKochi\\n\\n\\n\\n\\nBooks\\n\\n\\n\\n\\nEducation\\n\\n\\n\\n\\nPodcast\\n\\n\\n\\n\\nBrandhub\\n\\n\\n\\n\\nTo enjoy additional benefitsFREE TRIALGIFT a Subscription\\nSubscribe\\nLOGIN\\nACCOUNT\\n\\nPREMIUM\\nShowcaseSubscribe to NewslettersCrossword+CONNECT WITH US\\nHome\\n\\nNews\\n\\nCities\\n\\nPuducherry\\n\\nAdministration launches dedicated number to complain display of illegal hoardings in Puducherry\\n Published - July 18, 2024 10:30 pm IST - PUDUCHERRYRajesh B Nair\\nCopy link\\n\\nEmail\\n\\nFacebook\\n\\nTwitter\\n\\nTelegram\\n\\nLinkedIn\\n\\nWhatsApp\\n\\nReddit\\nREAD LATER\\nRemove\\n\\nSEE ALL\\nPRINT\\nDistrict Administration has launched a WhatsApp number for residents to complain on display of banners in Puducherry. A view of the political banner on ECR Road at Lawspet.\\n| Photo Credit: S.S. KUMAR\\nResidents have welcomed the district administration\\u2019s decision to launch a dedicated helpline for people to lodge complaints on illegal hoardings, banners and cut-outs in Puducherry.Sub-Divisional Magistrate, North, Arjun Ramakrishnan, had a few days ago, announced the launch of Whatsapp number 9443383418 for people to report on display of illegal publicity materials in public places. Mr. Ramakrishnan, in a release, had requested vigilant citizens to post the photos of illegally displayed publicity structures. The photos should have date, time and location stamp, he said.Welcoming the decision of the district administration to launch a grievance mechanism pertaining to construction of hoardings, President of PeoplesPulse P. Devanathan said it was one of the long pending demands of residents\\u2019 associations and non-governmental groups in dealing with hoardings.\\u201cIn fact, we had written to the administration to introduce a Whatsapp number for residents to complain about banner culture. We hope the move would help residents to immediately bring to the notice of administration the difficulty faced by illegal banners in a particular area,\\u201d he said.Bhoominathan, a resident of Karuvadikuppam, said that though there had been some improvement in the implementation of the ban on putting up hoardings, politicians continue to erect sizeable cut-outs during birthday celebrations and during political meetings.\\u201cWe have seen several proactive steps from the District Administration in removing illegal banners during the last few months but still the rules are violated by a section of politicians. The ECR, near Sivaji Statue was full of banners and hoardings coinciding the birthday of a politician a few days ago. The culture can be defeated only when people completely cooperate with the government,\\u201d Mr. Boominathan said. He added that banners were displayed on Bussy Street to mark the birthday of a prominent actor on Thursday.Hamper vehicle movementOfficials in the Public Works Department said they are facing stiff resistance in removing hoardings and cut-outs from public places. \\u201cTwo weeks ago, our workers were prevented from removing the structures at Thavalakuppam. We faced a similar situation at Murungapakkam a few days ago. People are not understanding that putting up of such display materials hamper vehicle and pedestrian movement. It is also a threat to public life,\\u201d said a PWD official. Mr. Ramakrishnan told The Hindu that the administration would take severe action against those violating the ban order. Around 20 cases were registered under section 6 of the Pondicherry Open Places (Prevention of Disfigurement Act, 2000) for construction of hoardings and cut-outs in public places, he said. \\u201cWe have come across reports of obstruction caused by people to government servants while removing such illegal materials. It is an offence under section 221 of the Bharathiya Nyaya Sanhita, 2023, punishable with imprisonment or fine or both. We seek cooperation of people to keep Puducherry free from illegal banners and to prevent any threat to the safety and lives of the innocent public from banners and cut-outs,\\u201d he said.\\nRead Comments \\nCopy link\\n\\nEmail\\n\\nFacebook\\n\\nTwitter\\n\\nTelegram\\n\\nLinkedIn\\n\\nWhatsApp\\n\\nReddit\\nREAD LATER\\nRemove\\n\\nSEE ALL\\nPRINTTop News Today0 / 0\\nRead in App\\n\\n\\n\\nThe Hindu\\n\\n\\n\\nAbout Us\\n\\n\\n\\n\\nCode of Editorial Values\\n\\n\\n\\n\\nNews Archive\\n\\n\\n\\n\\nSitemap\\n\\n\\n\\n\\nPrint Subscription\\n\\n\\n\\n\\nDigital Subscription\\n\\n\\n\\n\\nSubscribe to Newsletters\\n\\n\\n\\n\\nRss Feeds\\n\\n\\n\\n\\nReaders Editor-Terms of Reference\\n\\n\\n\\n\\nAuthors & Contributors\\n\\n\\n\\n\\n\\nContact us\\n\\n\\n\\nContact Us\\n\\n\\n\\n\\nSocial Media\\n\\n\\n\\n\\nAdvertise With Us\\n\\n\\n\\n\\n\\nGroup News Sites\\n\\n\\n\\nBusiness Line\\n\\n\\n\\n\\nBL on Campus\\n\\n\\n\\n\\nSportstar\\n\\n\\n\\n\\nFrontline\\n\\n\\n\\n\\n\\u0b87\\u0ba8\\u0bcd\\u0ba4\\u0bc1 \\u0ba4\\u0bae\\u0bbf\\u0bb4\\u0bcd \\u0ba4\\u0bbf\\u0b9a\\u0bc8\\n\\n\\n\\n\\nThe Hindu Centre\\n\\n\\n\\n\\nYoung World Club\\n\\n\\n\\n\\nThe Hindu ePaper\\n\\n\\n\\n\\nBusiness Line ePaper\\n\\n\\n\\n\\nCrossword + Free Games\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nOther Products\\n\\n\\n\\nRoofandFloor\\n\\n\\n\\n\\nSTEP\\n\\n\\n\\n\\nImages\\n\\n\\n\\n\\nClassifieds - Print\\n\\n\\n\\n\\nBookstore & Special Publications\\n\\n\\n\\n\\n\\nPopular Sections\\n\\n\\n\\nElections\\n\\n\\n\\n\\nIsraeli\\u2013Palestinian conflict 2023\\n\\n\\n\\n\\nLatest News\\n\\n\\n\\n\\nNational News\\n\\n\\n\\n\\nInternational News\\n\\n\\n\\n\\nVideos\\n\\n\\n\\n\\nLife & Style\\n\\n\\n\\n\\nFood\\n\\n\\n\\n\\nPodcast\\n\\n\\n\\n\\nShowcase\\n\\n\\n\\n\\n\\n\\nOpinion\\n\\n\\n\\n\\nEditorial\\n\\n\\n\\n\\nColumns\\n\\n\\n\\n\\nComment\\n\\n\\n\\n\\nCartoon\\n\\n\\n\\n\\nLetters\\n\\n\\n\\n\\nInterview\\n\\n\\n\\n\\nLead\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\n\\nAgri-Business\\n\\n\\n\\n\\nIndustry\\n\\n\\n\\n\\nEconomy\\n\\n\\n\\n\\nMarkets\\n\\n\\n\\n\\nBudget\\n\\n\\n\\n\\n\\n\\nSport\\n\\n\\n\\n\\nCricket\\n\\n\\n\\n\\nFootball\\n\\n\\n\\n\\nHockey\\n\\n\\n\\n\\nTennis\\n\\n\\n\\n\\nAthletics\\n\\n\\n\\n\\nMotorsport\\n\\n\\n\\n\\nRaces\\n\\n\\n\\n\\nOther Sports\\n\\n\\n\\n\\n\\n\\nSci-Tech\\n\\n\\n\\n\\nScience\\n\\n\\n\\n\\nTechnology\\n\\n\\n\\n\\nHealth\\n\\n\\n\\n\\nAgriculture\\n\\n\\n\\n\\nEnvironment\\n\\n\\n\\n\\nGadgets\\n\\n\\n\\n\\nInternet\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nStates\\n\\n\\n\\n\\nAndhra Pradesh\\n\\n\\n\\n\\nKarnataka\\n\\n\\n\\n\\nKerala\\n\\n\\n\\n\\nTamil Nadu\\n\\n\\n\\n\\nTelangana\\n\\n\\n\\n\\n\\n\\nCities\\n\\n\\n\\n\\nBengaluru\\n\\n\\n\\n\\nChennai\\n\\n\\n\\n\\nCoimbatore\\n\\n\\n\\n\\nDelhi\\n\\n\\n\\n\\nHyderabad\\n\\n\\n\\n\\nKochi\\n\\n\\n\\n\\nKolkata\\n\\n\\n\\n\\nKozhikode\\n\\n\\n\\n\\nMadurai\\n\\n\\n\\n\\nMangaluru\\n\\n\\n\\n\\nMumbai\\n\\n\\n\\n\\nPuducherry\\n\\n\\n\\n\\nThiruvananthapuram\\n\\n\\n\\n\\nTiruchirapalli\\n\\n\\n\\n\\nVijayawada\\n\\n\\n\\n\\nVisakhapatnam\\n\\n\\n\\n\\n\\n\\nTrending on The Hindu\\nNews\\n\\nIndia News\\n\\nLive News from the Hindu\\n\\nNEET-UG 2024 hearing LIVE\\n\\nAanvi Kamdar News: Travel influencer dies after falling into gorge\\n\\nTDS Fraud Case\\n\\nSC directs NTA to publish results by July 20 noon\\n\\nParody account\\u2019s post lands YouTuber Dhruv Rathee in legal trouble\\n\\nNEET-UG 2024 Counselling\\n\\nIAS officers reshuffle in TN\\nTrending on Group sites\\nStock Market Live Updates\\n\\nStocks to buy today\\n\\nLok Sabha Election Results 2024\\n\\nSpain vs England LIVE\\n\\nGold Rate Today\\n\\nSilver Rate Today\\n\\nCSK vs SRH LIVE\\n\\nFootball News\\n\\nPolitics News\\n\\nFrontline Current Issue\\n\\n\\n\\nTerms of Use\\n\\n\\n\\n\\nPrivacy Policy\\n\\n\\n \\n\\nCopyright\\u00a9 2024, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\\nBACK TO TOPSign in to unlock member-only benefits!Access 10 free stories every monthSave stories to read laterAccess to comment on every storySign-up/manage your newsletter subscriptions with a single clickGet notified by email for early access to discounts & offers on our products\\u2715Looks like you are already logged in from more than 3 devices!To continue logging in, remove at least one device from the below listLog outLog Out from all devicesTerms & conditions\\u00a0\\u00a0|\\u00a0\\u00a0Institutional SubscriberCommentsComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.monitor.co.ug/uganda/news/national/house-of-deals-parliament-faces-withering-accusations-of-rampant-corruption-4688900\",\n        \"title\": \"House of deals: Parliament faces withering accusations of rampant corruption | Monitor\",\n        \"description\": \"\\nChatter about a march to Parliament on July 23 in protest against fraudulent conduct by those in power keeps gaining in amplitude\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nHouse of deals: Parliament faces withering accusations of rampant corruption | Monitor\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nClose\\nMenu\\n\\n\\n\\n\\nePaper\\n\\n\\n\\n\\nUganda Edition\\n\\n\\n\\n\\n\\n\\n\\nAfrica Edition\\n\\n\\nKenya Edition\\n\\n\\nTanzania Edition\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\n\\nLog in\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSign up\\n\\n\\n\\n\\n\\n\\n\\nMy Account\\n\\n\\nPersonal details\\n\\n\\nChange password\\n\\n\\nPurchases\\n\\n\\nSign out\\n\\nLogging you out...\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\nNational\\n\\n\\n\\n\\n\\n\\nNational\\n\\n\\n\\n\\nEducation\\n\\n\\n\\n\\nInsight\\n\\n\\n\\n\\nWorld\\n\\n\\n\\n\\n\\n\\n\\nMore\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\n\\nNational\\n\\n\\nEducation\\n\\n\\nInsight\\n\\n\\nWorld\\n\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\nProsper\\n\\n\\nCommodities\\n\\n\\nFinance\\n\\n\\nMarkets\\n\\n\\nTechnology\\n\\n\\nInsurance\\n\\n\\nAuto\\n\\n\\n\\n\\n\\nOpEd\\n\\n\\n\\nEditorial\\n\\n\\nColumnists\\n\\n\\nCommentary\\n\\n\\nLetters\\n\\n\\nCartoon\\n\\n\\n\\n\\n\\nSpecial Reports\\n\\n\\n\\nMonitor@30\\n\\n\\nElections\\n\\n\\nUganda@50\\n\\n\\nGender\\n\\n\\nProject Success\\n\\n\\nAmin\\n\\n\\n\\n\\n\\nMagazines\\n\\n\\n\\nFull Woman\\n\\n\\nPeople & Power\\n\\n\\nHealthy Living\\n\\n\\nJobs and Career\\n\\n\\nScore\\n\\n\\nLife\\n\\n\\nHomes and Property\\n\\n\\nFarming\\n\\n\\n\\n\\n\\nSports\\n\\n\\n\\nSoccer\\n\\n\\nWorld Cup\\n\\n\\nBasketball\\n\\n\\nBoxing\\n\\n\\nCricket\\n\\n\\nAthletics\\n\\n\\nRugby\\n\\n\\nGolf\\n\\n\\nMotor Sport\\n\\n\\nOther Sport\\n\\n\\nSports Columnists\\n\\n\\n\\n\\n\\nLifestyle\\n\\n\\n\\nDining\\n\\n\\nEntertainment\\n\\n\\nTravel\\n\\n\\nReviews & Profiles\\n\\n\\nReligion\\n\\n\\nHeart to Heart\\n\\n\\nFashion & Beauty\\n\\n\\n\\n\\n\\nJobs\\n\\n\\n\\nTenders\\n\\n\\nSupplements\\n\\n\\n\\n\\n\\nAudio\\n\\n\\n\\nNews Podcasts\\n\\n\\nSports Podcasts\\n\\n\\nBusiness Podcasts\\n\\n\\nLifestyle Podcasts\\n\\n\\n\\n\\n\\nPuzzles\\n\\n\\n\\n \\n\\n\\n\\nEditions\\n\\n\\nAfrica\\n\\n\\nKenya\\n\\n\\nUganda\\n\\n\\nThe Citizen\\n\\n\\n\\n\\n\\nePaper\\n\\n\\nDaily Monitor\\n\\n\\nDaily Nation\\n\\n\\n\\n\\n \\n \\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\nCaption for the landscape image:\\n\\n\\nHouse of deals: Parliament faces withering accusations of rampant corruption\\n\\n\\nSaturday, July 13, 2024\\n\\n\\n\\n\\n\\n\\nScroll down to read the article\\n\\n\\n\\n\\nMembers of Parliament during the plenary session chaired by Speaker Anita Among on July 2, 2024. PHOTO/DAVID LUBOWA \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBy\\u00a0\\nEMMANUEL MUTAIZIBWA\\u00a0\\n\\u00a0&\\u00a0\\nROBERT MADOI\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSummary\\n\\n\\nArticle\\n\\n\\nRelated\\n\\n\\n\\n\\n\\nWhat you need to know:\\n\\n\\nChatter about a march to Parliament on July 23 in protest against fraudulent conduct by those in power keeps gaining in amplitude.\\u00a0 \\n\\n\\n\\n\\nThank you for reading Nation.Africa\\n\\n\\nShow plans\\n\\n\\n\\n\\n\\n\\n\\nAmid the bad optics of a House Speaker being sanctioned, the embarrassing spectacle of rogue elements severally using parliament\\u2019s boardroom to dupe foreign investors into loosening their purse strings, and lawmakers staring custodial sentences in the face, one voice of derision has recently resonated more powerfully than others. \\n\\nDuring a recent Cabinet Introspection Retreat at the National Leadership Institute Kyankwanzi, President Museveni for the umpteenth time publicly castigated the House. It has, he opined, got a bad rap, deservedly so. \\n\\n\\u201cUndoubtedly, the strict measures implemented by the NRA have had unparalleled success in combating corruption in the past, earning the respect and trust of the masses. We, however, have been let down primarily by a few individuals responsible for financial matters, procurement, and the distribution of supplies and equipment,\\u201d Mr Museveni offered, adding, \\u201cThe problem worsened when political leaders, particularly MPs, started paying themselves excessively, which diverted them from their primary responsibility of safeguarding the interests of the people they represent. We are now coming in directly to restore the NRA heritage. The young people, with their passion-driven outlook, and the victims of corruption have a chance to lead this effort.\\u201d \\n\\n\\n\\n\\n\\n\\nPresident Museveni gestures during the opening ceremony of a\\u00a0cabinet introspection\\u00a0at the National Leadership Institute in Kyankwanzi District on July 8, 2024. PHOTO/HANDOUT/PPU\\n\\n \\n\\nCaught in the shiver of excitement after watching what the youth in Kenya have been able to achieve, it remains to be seen what the yields of the \\u201cpassion-driven outlook\\u201d of Uganda\\u2019s young people will look like. Chatter about a march to Parliament on July 23 in protest against fraudulent conduct by those in power keeps gaining in amplitude.\\u00a0 \\n\\nEmpirical evidence shows that, globally, no demographic cohort has seen more wind taken out of its sails by the cost-of-living crisis as the Zoomers or Generation Z. Born anywhere from 1997 to 2012, Zoomers have seen most, if not all, of their dreams and hopes take root in barren soil. \\n\\nLargely written off as passive, a violent inner rage has flared in a great deal of them recently. And not just in Kenya. Zoomers in Uganda demonstrated an underlying outrage on online spaces when Speaker Anita Among claimed that funds pilfered by government bureaucrats eventually trickle down to your average ordinary person.\\u00a0 \\n\\nThe Speaker of Parliament made the comments\\u2014a stunning moral recalibration\\u2014at the backend of June during the launch of the Ssentaayi Development Foundation in Lwengo, whose District Woman Representative in Parliament Cissy Namujju, is incarcerated. \\n\\n\\n\\n\\n\\n\\nParliament Speaker Anita Among and President Museveni's younger brother\\u00a0Michael Nuwagira Kaguta aka\\u00a0Toyota attend an event organized by MP\\u00a0Muhammad\\u00a0Muyanja\\u00a0Ssentaayi in Lwengo District on June 22, 2024. PHOTO/GERTRUDE MUTYABA\\u00a0\\n\\n \\n\\nMs Namujju and two other lawmakers\\u2014Yusuf Mutembeli (Bunyole East), and Paul Akamba (Busiki County)\\u2014stand accused of trying to extract a kickback from the Uganda Human Rights Commission during the budgeting process for the Fiscal Year (FY) 2024/2025. \\n\\nFall from grace\\u00a0Only recently, President Museveni, apoplectic with rage, refused to sign the Appropriations Bill until more than Shs700 billion, which had been reallocated by lawmakers in this year\\u2019s financial budget, was reinstated. Before, the President joined many Ugandans in questioning the wisdom of expending north of Shs1 billion on a so-called service award for four backbench parliamentary commissioners.\\u00a0 \\n\\n\\u201cI could have blocked the moves by the MPs to award themselves high salaries. I opposed [it] but did not block because it is not always correct to block everything you consider a mistake. It is better, sometimes, to oppose but also allow people to learn from their mistakes or for the issue at hand to be clearer,\\u201d Mr Museveni said at the recent Cabinet retreat in Kyankwanzi.\\u00a0 \\n\\nThe embarrassment of riches of Ugandan lawmakers continues to be greeted with horror and dismay by not just the impoverished country\\u2019s President but also the citizenry. The laundry list of perks the lawmakers receive includes a one-off vehicle allowance of Shs150m; a net salary of Shs6.1m; a housing allowance of Shs6.5m; a constituency support fee of Shs17.03m; as well as a town running fee of Shs1.945m. They also receive a fuel allowance of anywhere between Shs10.3m and Shs31m, as well as a free iPad and a Shs50,000 allowance for attending committee sessions, among others. \\n\\nMUST READ:\\u00a0Luxury cars for leaders: Necessity or profligacy? \\n\\nCamels will pass through eyes of needles before Museveni fights corruption \\n\\nReviewing President Museveni\\u2019s \\u201cWhat is Africa\\u2019s problem?\\\" \\n\\nWhat if Museveni uses anti-corruption card? \\n\\nYet, with barely a year left towards the end of its term, the desecrated Eleventh Parliament is serving as a cautionary tale after its lawmakers became agents of quid-pro-quo deals with senior government officials to feather their nests. \\n\\n\\n\\n\\n\\n\\nMinisters and other government officials attend their retreat at the National Leadership Institute in Kyankwanzi District on July 8, 2024. PHOTO/PPU\\n\\n \\n\\nHow did Uganda\\u2019s Parliament, which in the past was a respected citadel against Executive overreach, turn into the poster child of graft? Mr Moses Khisa, an associate professor of Political Science at NC State University, USA, believes the buck stops with President Museveni. \\n\\n\\u201cAs Museveni\\u2019s regime has become rusty, the extent of transactional politics has become brazen. It\\u2019s an accumulation of decay, dysfunction and decline. Parliament is the centre of national politics. It\\u2019s where elite accommodation and compromises take place, it\\u2019s where quid-pro-quo is marshalled, and Museveni has always understood this very well, that\\u2019s why he ensures that the NRM maintains a super-majority,\\u201d he told Monitor. \\n\\nIts genesisThis creeping hand of graft orchestrated by an intricately woven government syndicate began to seep across the hallowed grounds of the Seventh Parliament. The vice has not spared the Opposition, whose lawmakers chair oversight committees, including the Public Accounts Committee (PAC), the Committee on Commissions, Statutory Authorities and State Enterprises (Cosase), and the Local Government Accountability Committee, among others. \\n\\nMany of these accountability committees created the perfect storm for graft as government officials implicated in corruption scandals used part of their stolen loot to bribe lawmakers tasked with an oversight role at the committee level. In turn, the lawmakers, including those in the Opposition used this smokescreen to pander to the gallery. This is because they used their powers to intimidate government officials implicated in graft reports to seek higher thresholds.\\u00a0 \\n\\nHow did Parliament, whose lawmakers during the National Resistance Council (NRC), the first Parliament of the National Resistance Movement government, drove Stout pick-up trucks as their official vehicles and only earned allowances\\u2014turn its hallowed grounds into an ostentatious display of nouveau-riche symbols? \\n\\nMr Gerald Karuhanga, who served as the Ntungamo Municipality MP in the Ninth and Tenth Parliament, said he witnessed the \\u2018ingenuity\\u2019 that sustained corruption at Parliament.\\u00a0 \\n\\n\\u201cI was in the Public Accounts Committee and saw many ugly cases. Something told me that much of the rot is in the Budget Committee where heavily syndicated cartels I saw with my naked eyes operate,\\u201d he disclosed, adding, \\u201cThe Budget Committee cleared the budgets of all the other committees, and it was so powerful that you could read between the lines that almost anything the Budget Committee chairperson pursued, could go through. For instance, a budget for a specific ministry could be passed in totality.\\u201d \\n\\n\\n\\n\\n\\n\\nFormer MP Gerald Karuhanga.\\u00a0\\n\\n \\n\\nMr Karuhanga said the less-aggressive ministries would receive 70 percent of their budgets and this habit was largely perpetrated by heads of agencies and departments from \\u2018western Uganda.\\u2019 The lawmaker raised this matter on the floor of Parliament and personally pursued public interest litigation against graft. \\n\\n\\u201cThe chairperson of the Budget Committee could pursue this personally with promises after the Permanent Secretary of a ministry conducted a secret meeting with the chairperson. I reported these incidents of collusion, and it is on the record of the Hansard, but no action was taken, that is how some ministries, state agencies and parastatals received 100 percent of their budgets,\\u201d he told Saturday Monitor.\\u00a0 \\n\\nUnderhanded practicesMr Karuhanga notes that there were various methods of receiving bribes and some of the cunning MPs physically received cash from those who wanted to conceal their dirty deals. \\u00a0\\u00a0\\u201cIt was never one approach to receiving bribes. There was ingenuity when receiving this money. On one occasion, some unknown men showed up at Parliament in my office over the Lubowa incident and tried to offer me money, which I rejected,\\u201d he reveals, adding, \\u201cThey were emissaries and I threatened them that they could be arrested. They apologised and told me they were shocked that I rejected the bribe money. I did not call the police because I believed that these men accessed Parliament through the connivance of the House security.\\u201d \\n\\nThe former Ntungamo Municipality lawmaker said it was usually during report writing when the cunning nature of MPs who had been compromised reared its ugly head.\\u00a0 \\n\\n\\u201cThe report was a stark contrast of what had been unearthed during the probe, and this was so shocking,\\u201d he discloses. \\n\\nREAD: How Canadian investors were conned by Ugandans at Parliament \\n\\nInvestors bribe State House officials to meet me - Museveni \\n\\nAmong, Magogo, Lugoloobi among eight Ugandan officials sanctioned by US \\n\\nTrips outside the country where MPs earn large amounts in allowances, have also been used to reward and punish allies in Parliament. Mr Karuhanga said this practice began during the Ninth Parliament, where the Speaker made the final decision on who could travel. \\u00a0 \\n\\nIn April 2020, Karuhanga triumphantly walked out of the Constitutional Court after suing his colleagues for a dubious payment of Shs10 billion, which was slashed from a Shs304 billion supplementary Covid-19 budget to their accounts. Each MP had received Shs20m for sensitisation campaigns in their constituencies. However, in a consent judgment by the Constitutional Court, they were ordered to refund the funds.\\u00a0 \\n\\n\\u201cWhen I tried to raise it on the floor, some MPs threatened to assault me. A few MPs protected me. What encouraged me to challenge it in court was not just that isolated case,\\u201d he said, adding, \\u201cSadly I noted that Parliament had turned into a deals workshop and was so overt in its corrupt practice.\\u201d \\n\\nMr Karuhanga posits that \\u201cthis consistent pattern has bred a culture of self-aggrandizement.\\u00a0\\u201cFor instance, the Covid-19 budget incident was so shocking when the chairperson, [Amos] Lugoolobi read that there was a gift for MPs when it had not been discussed at the Committee, which I was part of, then all of a sudden, a take-home of Shs20m was introduced,\\u201d he notes. \\n\\n\\n\\n\\n\\n\\nState minister for Planning Amos Lugoloobi (centre) at the Anti-Corruption Court in Kampala on April 17, 2023. PHOTO/ ABUBAKER LUBOWA\\n\\n \\n\\nMr Lugoolobi was subsequently appointed a junior Finance minister. In August 2023, High Court Judge, Margaret Tibulya, charged Mr Lugoolobi for contravening sections of the Anti-Corruption Act for the offence of diverting iron sheets meant for the vulnerable people of Karamoja Sub-region.\\u00a0 \\n\\nA den of thieves?Mr Karuhanga said he was shocked when these syndicates scaled what he thought was a robust Integrated Financial Management System (IFMS). One of the major graft incidents, he recalls, was captured in the Auditor General\\u2019s report for the FY 2014/2015. \\n\\nThe report raised accountability queries in the Local Government ministry. Mr Patrick Mutabwire, the acting Permanent Secretary then, was accused of diverting Shs12 billion meant to procure 111 vehicles for district chairpersons in the country. \\n\\nOnly Shs1.5 billion was spent. The rest was diverted to the Local Government ministry\\u2019s recurrent expenditure and doled out as staff field allowance. Mr Karuhanga said the PAC probed this matter and unearthed rot at the heart of the diversion. \\n\\n\\u201cCommercial banks have CCTV that show how these syndicates work. About four staff members were interrogated from 10 am till midnight [by PAC lawmakers] and told us that they would pick up the money almost every week from the bank and hand it over to the accounting officer in tranches of Shs100m. We were surprised that some staff had field allowance days of 1,200 each, others 900 days and 800 days each in one calendar year, which has 365 days,\\u201d he recalled.\\u00a0 \\n\\nSupreme Court Justice Irene Mulyagonja, who was the ombudsman at the time, on October 27, 2015, wrote to the Head of Public Service then, Mr John Mitala, and ordered the interdiction of Mutabwire on corruption allegations. Save for being replaced with John Walala, nothing became of Mr Mutabwire.\\u00a0 \\n\\n\\n\\n\\n\\n\\nJustice Irene Mulyagonja. PHOTO/FILE\\n\\n \\n\\nMr Karuhanga also recalled questioning a suspected budget allocation of Shs26 billion where Shs16 billion was doled out to the human resource empowerment vote and another Shs10 billion was for capacity building at the Finance ministry. All of this was presented in a 300-voluminous report.\\u00a0 \\n\\n\\u201cIf you were in a rush, you would miss these figures. I asked what is the difference between these two items was and the Finance ministry dropped the Shs16 billion vote. Capacity building and human resource development are quite good votes because the hotels usually get business and quickly provide accountability through invoices,\\u201d Mr Karuhanga reveals. \\n\\n\\u201cCorruption in Uganda is like the bloodline of the ruling party. It has permeated every sector, all the ministries, departments, and agencies and sadly most of the population. When the Speaker changes, the workers at Parliament look at it from an ethnic lens,\\u201d Mr Karuhanga argues, mimicking the words of British author, Michela Wrong, who authored the book titled It is Our Turn to Eat: The Story of a Kenyan Whistle-blower, which is an eye-opening account of tribal rivalries, pervasive graft, and the rising anger of a prospect-less youth in Kenya.\\u00a0 \\n\\nTo which Khisa concurs, noting thus: \\u201cOn Parliament and deals, I think the current state speaks perfectly to what Nelson Kasfir analyses in the book as \\u2018late-stage clientelism.\\u2019\\u201d \\n\\nA lost innocence\\u00a0Mr Augustine Ruzindana, who served as the first Inspector General of Government under the NRM government, and later as the Ruhaama MP in the Sixth and Seventh Parliament, says there was modesty exhibited by Speakers such as James Wapakhabulo, Francis Ayume, and Edward Ssekandi. \\n\\nThe trio studied law at the University of Dar es Salaam, which was a bastion of Marxist political thought and anti-colonial revolutionary lore influenced by the works of Guyana scholar Walter Rodney, Jamaica\\u2019s Marcus Garvey, Algerian revolutionary leader Frantz Fanon and the Sudan People\\u2019s Liberation Army leader, John Garang, among others. The trio\\u2019s depiction of statecraft was premised on modesty, argues Ruzindana. \\n\\n\\n\\n\\n\\n\\nL-R: Former Foreign Affairs Minister Sam Kutesa, Security Minister Jim Muhwezi, Science and Technology Minister Dr Monica Musenero and State Minister for Luweero Triangle and Rwenzori Region Alice Kaboyo. PHOTOS/ FILE\\n\\n \\n\\nRuzindana says corruption was hardly detected in the Sixth Parliament, which censured two ministers\\u2014Sam Kutesa and Jim Muhwezi\\u2014on allegations of corruption.\\u00a0 \\n\\n\\u201cDuring the Sixth Parliament, there was good faith, you wouldn\\u2019t detect seeking favours. [MPs] were concerned with institutional building. We set up the remuneration structure of Parliament, and there was no sitting allowance for chairing a Committee of Parliament or attending plenary. \\n\\nWe had laid the groundwork that committee and plenary work were substantive duties of MPs,\\u201d the former ombudsman discloses, drawing a parallel with recent times where Committee chairpersons get a monthly stipend believed to be Shs2m. \\n\\nMr Ruzindana says vibrant associations like the Young Parliamentarians Association (YPA), which led the moral crusade against graft, were established through \\u201cour own pockets.\\u201d\\u00a0 \\n\\nHe adds: \\u201cEven being a minister was not lucrative. An amendment was made for a minister to earn a paltry allowance.\\u201d \\n\\nHe says the government negotiated with a vehicle company to purchase vehicles for MPs on a loan scheme whose interest was 12 percent. This was hardly the riches of embarrassment of today where a one-off vehicle allowance of Shs150m keeps a stark and undeniable injustice in the public eye. Per Ruzindana, the point of inflexion came during the Seventh Parliament.\\u00a0 \\n\\n\\u201cThe habit that crept up was the policy paper conference with the relevant committee where MPs were paid allowances. We advised against it, but we failed to halt this practice,\\u201d he recalls. \\n\\nMr Ruzindana says he detected corruption at the Finance ministry as the ombudsman. \\u201cThere was a racket that could send the pension to the wrong place. It would then be resent back through the connivance of government officials and shared.\\u201d \\n\\nIt was during the Seventh Parliament that reports emerged that a trio of lawmakers had attempted to extort funds from a businessman. These allegations were not proven. During the Seventh Parliament, it was also agreed that Committee chairpersons be paid a lump sum allowance of Shs500,000 per month. \\u00a0 \\n\\n\\u201cFor instance, I stood in as the chairperson of the Budget Committee for [Beatrice] Kiraso when she went to study at Harvard University and did not earn any allowance,\\u201d he told Monitor. \\n\\nMr Ruzindana, who served as the deputy Secretary General of FDC, says during the five-year term of the Seventh Parliament, he only travelled twice outside the country to Cuba and Mozambique. He also recalled that the House Parliamentary Commission\\u2019s role was not remunerated.\\u00a0 \\n\\n\\n\\n\\n\\n\\nThe commissioners accused of sharing Shs1.7b (L-R): Mathias Mpuuga (Nyendo \\u2013 Mukungwe MP), Prossy Mbabazi Akampurira (Rubanda Woman MP), Esther Afoyochan (Zombo Woman MP) and Solomon Silwanyi (Bukooli Central MP). PHOTOS/ FILE/ COURTESY\\u00a0\\n\\n \\n\\nMr Mathias Mpuuga, the immediate past Leader of Opposition in Parliament, has been pilloried for receiving Shs500m as a service award as a commissioner. Fellow commissioners, including Ms Esther Afoyochan, Mr Solomon Silwany, and Ms Prossy Akampurira, also received Shs400m apiece.\\u00a0 \\n\\nWill the penny drop?\\u00a0 \\n\\nSpeaking recently at the Cabinet retreat, President Museveni made a pitch for modesty, noting that \\u201cthe excuse of low pay should be rejected.\\u201d \\n\\nHe added: \\u201cThe corruption we are facing now has got two dimensions. One is the stealing of government money\\u2014taking bribes from the public to provide government services, misusing the procurement procedures to cheat the state, and corruptly handling personnel issues e.g. nepotism and selling government jobs [\\u2026] The other dimension of corruption is employee dishonesty in a private company.\\u201d \\n\\n\\n\\n\\n\\n\\nPresident Museveni and Speaker of Parliament Anita Among.\\n\\n \\n\\nThe House Commission is in the spotlight for hiring relatives and cronies of the senior leadership and lawmakers in coveted staff roles at Parliament. \\n\\n\\u201cToday, the job of an MP is an investment, in this type of situation, it becomes difficult to carry out the oversight role,\\u201d Mr Augustine Ruzindana, who served as the first Inspector General of Government under the NRM government, notes. \\n\\nHis comments mirror the decadent grassroots and constituency politics, which has been commoditised where a seat of Parliament is sold to the highest bidder who \\u2018immediately seeks to recoup the investment after his election, through extortion.\\u2019\\u00a0 \\n\\nThe other ugly offshoot of the commercialisation of politics is that lawmakers join Parliament when they are heavily indebted. They are consequently made vulnerable to a cartel of shylocks, who reportedly extend loans to them on generous terms on account that they do the lender\\u2019s bidding. \\n\\nProbably the greatest disappointment is that the proverbial penny is yet to drop. When lawmakers recently returned from recess to address corruption tendencies around the budgeting process, the House Speaker instead prodded them to be one\\u2019s \\u201cbrother\\u2019s keeper\\u201d just as when she made a stopover in Lwengo.\\u00a0 \\n\\nIf it is any consolation, not every lawmaker is living in denial. Speaking on the floor of Parliament during that special sitting, Jonathan Odur (Erute South) offered thus: \\u201cThe strongest justification for not sending this Bill to the Budget Committee is that there is a very serious allegation of grave corruption of the Budget Committee [\\u2026] the wording of the President\\u2019s letter specifically mentions allegations of corruption.\\u201d \\n\\nHe added: \\u201c[The President] isn\\u2019t [raising the red flag] for the first time. When he came to pay tribute to the late Cecilia Ogwal, he accused Parliament of being corrupt. When we went to [the] State of Nation Address, he said that. On Budget Day, he said that. And in the letter, the accusation is on all members of the Budget Committee.\\u201d \\n\\nWhat they say \\n\\nMr Gerald Karuhanga, who served as the Ntungamo Municipality MP in the Ninth and Tenth Parliament:\\u00a0I was in the Public Accounts Committee and saw many ugly cases. Something told me that much of the rot is in the Budget Committee where heavily syndicated cartels I saw with my naked eyes operate. The Budget Committee cleared the budgets of all the other committees, and it was so powerful that you could read between the lines that almost anything the Budget Committee Chairperson pursued, could go through. For instance, a budget for a specific ministry could be passed in totality.\\u201d \\n\\nMr Moses Khisa, an Associate Professor of Political Science at NC State University, USA:\\u00a0As Museveni\\u2019s regime has become rusty, the extent of transactional politics has become brazen. It\\u2019s an accumulation of decay, dysfunction and decline. Parliament is the centre of national politics. It\\u2019s where elite accommodation and compromises take place, it\\u2019s where quid-pro-quo is marshalled, and Museveni has always understood this very well, that\\u2019s why he ensures that the NRM maintains a super-majority. \\n\\nMr Augustine Ruzindana, who served as the first Inspector General of Government under the NRM government: During the Sixth Parliament, there was good faith, you wouldn\\u2019t detect seeking favours. [MPs] were concerned with institutional building. We set up the remuneration structure of Parliament, and there was no sitting allowance for chairing a Committee of Parliament or attending plenary. We had laid the groundwork that committee and plenary work were substantive duties of MPs \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPRIME\\n\\n\\n Museveni: A thief in my govt? Deny them bail\\n\\n\\nPresident Museveni urges Judiciary to \\u201csupport us by placing corruption in the category of offences that are not considered for bail.\\u201d\\n\\nNational\\n\\n\\nJul 11\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPRIME\\n\\n\\n Game of Thrones\\n\\n\\nThe crowd roared after punching the air with fists when Ms Among said Ms Namujju would be Lwengo District Woman Representative to Parliament \\u201cforever\\u201d\\n\\nNational\\n\\n\\nJun 24\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPRIME\\n\\n\\n In fighting graft, Museveni has headmaster\\u2019s problem\\n\\n\\nThose in the know argue that it was easier for the President to fight corruption in the early years of his government, when the thieves were fewer, than now when they are in droves\\n\\nNational\\n\\n\\nJun 25\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPRIME\\n\\n\\n War on corruption: I am not joking, says Museveni\\n\\n\\nPresident Museveni said he is not in the habit of discussing matters before the court because that would be sub judice\\n\\nNational\\n\\n\\nJun 25\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRegister to continue reading this premium article\\n\\n\\n\\n\\n\\n\\nYes, please!\\n\\n\\n\\n\\n\\nYou already have an account?\\n\\nLog in\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRegister to begin your journey to our premium content\\n\\n\\nSubscribe for full access to premium content\\n\\n\\n\\n\\n\\n\\n\\nSubscribe\\n\\n\\n\\n\\n\\nYou already have an account?\\n\\nLog in\\n\\n\\n\\n\\n\\n\\n\\nMonitor. Empower Uganda.\\n\\nWe come to you.\\nWe are always looking for ways to improve our stories. Let us know what you liked and what we can improve on.\\n\\nI've got feedback!\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\nOops\\n\\nWe're sorry, we couldn't load the article\\n\\n\\nIf you have an Ad-blocker please disable it and reload the page or try again later.\\n\\nReload page\\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\n\\nNational\\n\\n\\nEducation\\n\\n\\nInsight\\n\\n\\nWorld\\n\\n\\n\\n\\n\\nBusiness\\n\\n\\n\\nProsper\\n\\n\\nCommodities\\n\\n\\nFinance\\n\\n\\nMarkets\\n\\n\\nTechnology\\n\\n\\nInsurance\\n\\n\\nAuto\\n\\n\\n\\n\\n\\nOpEd\\n\\n\\n\\nEditorial\\n\\n\\nColumnists\\n\\n\\nCommentary\\n\\n\\nLetters\\n\\n\\nCartoon\\n\\n\\n\\n\\n\\nSpecial Reports\\n\\n\\n\\nMonitor@30\\n\\n\\nElections\\n\\n\\nUganda@50\\n\\n\\nGender\\n\\n\\nProject Success\\n\\n\\nAmin\\n\\n\\n\\n\\n\\nMagazines\\n\\n\\n\\nFull Woman\\n\\n\\nPeople & Power\\n\\n\\nHealthy Living\\n\\n\\nJobs and Career\\n\\n\\nScore\\n\\n\\nLife\\n\\n\\nHomes and Property\\n\\n\\nFarming\\n\\n\\n\\n\\n\\nSports\\n\\n\\n\\nSoccer\\n\\n\\nWorld Cup\\n\\n\\nBasketball\\n\\n\\nBoxing\\n\\n\\nCricket\\n\\n\\nAthletics\\n\\n\\nRugby\\n\\n\\nGolf\\n\\n\\nMotor Sport\\n\\n\\nOther Sport\\n\\n\\nSports Columnists\\n\\n\\n\\n\\n\\nLifestyle\\n\\n\\n\\nDining\\n\\n\\nEntertainment\\n\\n\\nTravel\\n\\n\\nReviews & Profiles\\n\\n\\nReligion\\n\\n\\nHeart to Heart\\n\\n\\nFashion & Beauty\\n\\n\\n\\n\\n\\nJobs\\n\\n\\n\\nTenders\\n\\n\\nSupplements\\n\\n\\n\\n\\n\\nAudio\\n\\n\\n\\nNews Podcasts\\n\\n\\nSports Podcasts\\n\\n\\nBusiness Podcasts\\n\\n\\nLifestyle Podcasts\\n\\n\\n\\n\\n\\nPuzzles\\n\\n\\n\\n\\n\\n\\nOur Blog Rules\\nContact Us\\nAdvertise with us\\nFrequently asked questions\\nNMG Privacy Policy\\nTerms and Conditions of Use\\nTerms of use\\nWebmail\\n\\n\\n\\nNation Media Group \\u00a9 2024\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRegister to continue reading this premium article\\n\\n\\n\\nIt's free!\\n\\n\\n\\n\\n\\nYes, please!\\n\\n\\n\\n\\n\\nYou already have an account?\\n\\nLog in\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRegister to begin your journey to our premium content\\n\\n\\nSubscribe for full access to premium content\\n\\n\\n\\n\\nAccess the best of Monitor's Independent Journalism\\n\\n\\n\\n\\n\\nSubscribe\\n\\n\\n\\n\\n\\nYou already have a Subscription?\\n\\nLog in\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.iwradio.co.uk/news/local-community-news/one-of-a-kind-classic-volvo-on-exclusive-display-at-van-mossel-esplanade-dealership/\",\n        \"title\": \"One-Of-A-Kind Classic Volvo On Exclusive Display At Van Mossel Esplanade Dealership - Isle of Wight Radio\",\n        \"description\": \"Cowes based Van Mossel Esplanade has welcomed a new and pristine example of a classic Volvo to its fleet of vehicles on the Island.\",\n        \"language\": \"en\"\n      },\n      \"page_content\": \"\\n\\n\\n\\nOne-Of-A-Kind Classic Volvo On Exclusive Display At Van Mossel Esplanade Dealership - Isle of Wight Radio\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIsle of Wight Radio\\n\\n\\nListen Live\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nOn Air Now\\nNick Osborne\\n 10:00am - 3:00pm\\n\\n\\n\\n\\n\\n\\n\\n\\nPink - Who Knew\\n\\nSchedule\\n\\n\\n\\n\\n\\n\\n\\n\\nNavigation\\n\\nOn Air\\n\\nSchedule\\n\\nTopping In The Morning\\n\\nEvents\\n\\nMusic Playlists\\n\\nPlaylist Search\\n\\nArtist Info\\n\\nListen To Isle of Wight Radio On Your Smart Speaker\\n\\nPop For Pounds!\\n\\nWin\\n\\nUltimate Tech Bundle!\\n\\nWheel of Destiny\\n\\nNews\\n\\nBreaking News Alerts\\n\\nIsle of Wight News\\n\\nTravel\\n\\nSearch\\n\\nIsle of Wight Foodbank\\n\\nNational News\\n\\nLocal Community News\\n\\nVideo News\\n\\nEntertainment News\\n\\nWeather\\n\\nBest in Business Directory\\n\\nHidden\\n\\nMore\\n\\nAdvertising\\n\\nPrivacy and Data Protection\\n\\nPrivacy Statement\\n\\nPublic File\\n\\nTotal Sense Media Advertising\\u00a0 Terms and Conditions\\u00a0\\n\\nGeneral Terms\\n\\nTotal Sense Media COMPETITION GENERAL TERMS & CONDITIONS\\n\\nContact\\n\\n\\n\\n\\n\\n\\nMenu\\n\\n\\n\\n\\n\\nFacebook\\n\\n\\n\\n\\nTwitter\\n\\n\\n\\n\\nInstagram\\n\\n\\n\\n\\nYoutube\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nOne-Of-A-Kind Classic Volvo On Exclusive Display At Van Mossel Esplanade Dealership\\n\\n\\n\\nNews Home\\n\\n\\nMore from Local Community News\\n\\n\\n\\n\\n\\n\\nFriday, 12 July 2024 11:38\\n\\n\\nBy Dominic Kureen\\n\\n\\n@WriteOnDom\\n\\n\\n\\n\\n\\n\\n\\nShare on Facebook\\n\\n\\n\\n\\n\\nShare on Messenger\\n\\n\\n\\n\\n\\nShare on Messenger\\n\\n\\n\\n\\n\\nShare on X\\n\\n\\n\\n\\n\\nShare on Whatsapp\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nCowes based Van Mossel Esplanade has welcomed a new and pristine example of a classic Volvo to its fleet of vehicles on the Island.\\n\\nOn temporary loan from the Volvo Car UK Heritage Fleet is a model 144E from 1974.\\nOriginally in production as one of Volvo\\u2019s volume marques in 1966 the car continued in various model forms and was sold all the way through until the early 1990s.\\nThis exciting loan was arranged by Mike Trigg, Van Mossel Esplanade\\u2019s resident Volvo Master Technician.\\nMike collected the car from Volvo Southampton and before putting on display in the showroom he took it on a tour of the Island.\\n\\nMike said:\\n\\\"I really enjoy classic cars and Volvo have done such a great job in curating a collection of restored older models. \\n\\\"It was interesting but fun to drive. \\n\\\"The steering wheel is very thin compared to that of a modern car and amazingly the air-conditioning is still in full working order! \\nThis 144E is not only a lovely example of classic car with an interesting history but also a great illustration of the quality that has always been associated with Volvo cars.\\\"\\nWith a unique provenance this car was originally the property of the late Mr Leslie Charteris who wrote the \\u2018Saint\\u2019 novels.\\nThey were successfully turned into the TV series starting Roger Moore and the famous Volvo P1800 \\u2018ST1\\u2019 which helped promote the brand worldwide.\\nOrdered to a high specification this model 144E has some unique features for the period including air conditioning, heated rear window and a twin fog light grille.\\nWhen he passed away Mr Charteris gifted the 144E to his chauffeur who couldn\\u2019t bear to use it.\\nHe put it into long term storage in the early 90\\u2019s after only 33,400 miles of usage.\\nCurrently it is the only 144E recorded by the DVLA as being roadworthy.\\nAs the only approved retailer and repairer for Volvo on the Isle of Wight, Van Mossel Esplanade would like to invite anyone wishing to see this unique classic car to their premises.\\nThe showroom can be found at Airfield Way, Cowes, PO31 8BF and is open Monday to Saturday with plenty of parking.\\n\\n\\nShare\\n\\n\\n\\nShare on Facebook\\n\\n\\n\\n\\n\\nShare on Messenger\\n\\n\\n\\n\\n\\nShare on Messenger\\n\\n\\n\\n\\n\\nShare on X\\n\\n\\n\\n\\n\\nShare on Whatsapp\\n\\n\\n\\n\\n\\n\\nMore from Local Community News\\n\\n\\n\\n\\nPolly's Fund Totland Bay Concerts Deliver Unforgettable Evenings Of Music And Sunshine\\n\\n\\n\\nLast week, the much-anticipated charity events in aid of Polly\\u2019s Fund delivered two extraordinary evenings of music, fun, and community spirit under the glorious summer sun.\\n\\n\\n\\n\\n\\n\\nBlooming Great Afternoon As Isle Of Wight Garden Heroes Revealed\\n\\n\\n\\nThe results of the annual Wight in Bloom competition, organised by Visit Isle of Wight were revealed yesterday (Thursday) at a ceremony at Albert Cottage in East Cowes.\\n\\n\\n\\n\\n\\n\\nRescue Of Head Injured Yachtsman\\n\\n\\n\\nA yachtsman who received a head injury aboard a classic yacht became the object of a rescue operation by Cowes RNLI lifeboat yesterday (Thursday).\\n\\n\\n\\n\\n\\n\\nSummer Activities On The Horizon At East Cowes Based Mad-Aid Dot\\n\\n\\n\\nThe MAD-Aid DOT in East Cowes is the place to head for some inexpensive summer fun for all the family.\\n\\n\\n\\n\\n\\n\\nNorthwood Cemetery Receives Coveted Green Flag Award\\n\\n\\n\\nThe Friends of Northwood Cemetery are celebrating after being awarded a coveted Green Flag Award.\\n\\n\\n\\n\\n\\nComments\\n\\n\\nAdd a comment\\n\\n\\nLog in to the club or enter your details below.\\n\\n\\n\\n\\n\\n\\nDisplay Name *\\n\\n\\n\\n\\n\\n\\nLocation *\\n\\n\\n\\n\\n\\n\\nEmail Address *\\n\\n\\n\\n\\n\\n\\nComment *\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nI have read and agreed to the privacy policy and terms & conditions\\n*\\n\\n\\n\\n\\n\\n\\nSubmit Comment\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nLatest News\\n\\n\\nShanklin FC And VYCC Recognised Among UK's Best Community Projects With Coveted Green Flag Award\\n\\nMass IT Outage Hits Companies Around The World With Isle Of Wight Radio Off-Air\\n\\nCowes RNLI Lifeboat Aids Fire-Damaged Motor Cruiser\\n\\nOne Card Membership Bounces Back To Exceed Pre-Covid Levels\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nShanklin FC And VYCC Recognised Among UK's Best Community Projects With Coveted Green Flag Award\\n\\n\\n\\n\\n\\n\\n\\nMass IT Outage Hits Companies Around The World With Isle Of Wight Radio Off-Air\\n\\n\\n\\n\\n\\n\\n\\n\\nCowes RNLI Lifeboat Aids Fire-Damaged Motor Cruiser\\n\\n\\n\\n\\n\\n\\n\\nOne Card Membership Bounces Back To Exceed Pre-Covid Levels\\n\\n\\n\\n\\n\\n\\n\\nLegendary Isle Of Wight Radio DJ Dave 'Cass' Casson Dies Aged 72 Following Cancer Battle\\n\\n\\n\\n\\n\\nMore News\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRecently Played\\n\\n\\n\\n\\n\\n\\n\\nWho Knew\\nPink\\n\\nDownload\\n\\n\\n\\n\\n\\n\\n\\n\\nLeft Outside Alone\\nAnastacia\\n\\nDownload\\n\\n\\n\\n\\n\\n\\n\\n\\nDon't Break The Heart\\nTom Grennan\\n\\nDownload\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nShanklin FC And VYCC Recognised Among UK's Best Community Projects With Coveted Green Flag Award\\n\\n\\nIn a record-breaking year Shanklin Football Club and Voluntary Youth & Community Centre is raising its prestigious Green Flag Award.\\n\\n\\n\\n\\nMass IT Outage Hits Companies Around The World With Isle Of Wight Radio Off-Air\\n\\n\\nIsle of Wight Radio is among a slew of global businesses affected by a global IT outage this morning (Friday).\\n\\n\\n\\n\\nCowes RNLI Lifeboat Aids Fire-Damaged Motor Cruiser\\n\\n\\nA fire aboard a 35 foot motor cruiser with a man and a woman aboard led to a cross Solent dash by Cowes RNLI lifeboat today (Thursday).\\n\\n\\n\\n\\nOne Card Membership Bounces Back To Exceed Pre-Covid Levels\\n\\n\\nMembership numbers across the Isle of Wight Council's leisure centres have bounced back to exceed pre-Covid levels.\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nAlso on Isle of Wight Radio\\n\\nIsle of Wight Radio and Isle of Wight Radio On-line is a valued part of the Total Sense Media family\\n\\n\\nGoogle\\n\\n\\n\\nUseful Links\\n\\nPrivacy Statement\\n\\n\\nData Protection\\n\\n\\nCOMPETITION GENERAL TERMS & CONDITIONS\\n\\n\\nPublic File\\n\\n\\nGoogle\\n\\n\\n\\n\\nDownload our App\\n\\n\\n\\n\\nFollow Us on Social Media\\n\\n\\n\\n\\nFacebook\\n\\n\\n\\n\\nTwitter\\n\\n\\n\\n\\nInstagram\\n\\n\\n\\n\\nYoutube\\n\\n\\n\\n\\n\\n\\n\\n\\n\\u00a9 Isle of Wight Radio and Aiir 2024 | 8-10 Dodnor Park, Newport, Isle of Wight, PO30 5XE\\n\\n\\n\\nOn Air\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.racenet.com.au/news/leap-to-fame-thrashes-swayzee-in-mr-feelgood-open-ahead-of-rematch-in-black-a-fake-20240714\",\n        \"title\": \"Leap To Fame makes big statement ahead of Blacks A Fake rematch\",\n        \"description\": \"Leap To Fame now holds a 2-1 advantage over older sibling Swayzee after a blistering win in the Mr Feelgood, and will be out to exact revenge in the Black A Fake.\",\n        \"language\": \"No language found.\"\n      },\n      \"page_content\": \"\\n\\n\\nLeap To Fame makes big statement ahead of Blacks A Fake rematch\\n\\n\\n  Search Racenet       Search Racenet        \\n          Sign-Up\\n         \\n          Login\\n               Home     Racenet iQ           Latest News      \\n                Videos\\n               Fields and Form     Premium Tips      \\n                The Guru\\n              \\n                Greg Polson\\n              \\n                Mark Guest\\n               Greyhounds          Results      \\n                Horse Racing\\n              \\n                Greyhound Racing\\n              \\n                Harness Racing\\n                     Scratchings & Updates      \\n                Scratchings\\n              \\n                Dual Acceptors\\n              \\n                Rider Alterations\\n               Blackbook      Bookie Reviews      \\n                Betr\\n              \\n                Sportsbet\\n              \\n                TAB\\n              \\n                TopSport\\n              \\n                BetNation\\n              \\n                Ladbrokes\\n                Bonus Bets        Free Tips      \\n                Horse Racing\\n              \\n                Greyhound Racing\\n              \\n                Harness Racing\\n                   Profiles      \\n                Horse Profiles\\n              \\n                Trainer Profiles\\n              \\n                Jockey Profiles\\n                 Race Tracks      \\n                Flemington\\n              \\n                Randwick\\n              \\n                Rosehill\\n              \\n                Caulfield\\n              \\n                Moonee Valley\\n               Group 1 & Feature Races    Racing Calendars \\n                Group 1 Races\\n              \\n                Group 2 Races\\n              \\n                Group 3 Races\\n              \\n                Listed Races\\n              Upcoming \\n                Caloundra Cup\\n              \\n                Grafton Cup\\n              Popular \\n                Melbourne Cup\\n              \\n                Cox Plate\\n              \\n                The Everest\\n              \\n                Caulfield Cup\\n              \\n                Golden Eagle\\n                 Hong Kong Racing    Race Track Conditions          Odds Comparison     \\n                Horse Racing\\n              \\n                Greyhounds Racing\\n              \\n                Futures\\n               home  latest news   \\n      Harness\\n      Leap To Fame makes big statement ahead of Blacks A Fake rematch  Leap To Fame takes out the Mr Feelgood Open by more than eight lengths at Albion Park on Saturday night. Picture: Dan Costello  \\n      By\\n      \\n        Adam Hamilton\\n        03:44am \\u2022 14 July 2024    Fresh from his greatest win, champion pacer Leap To Fame will delight fans by racing again at Albion Park over the next two Saturday nights. Leap To Fame turned a long-awaited third clash with arch rival and older sibling Swayzee into a display of equine supremacy in last Saturday night's Mr Feelgood Open at Albion Park. In contrast to last year's Blacks A Fake when Leap To Fame found the task of sitting outside Swayzee too much, albeit after copping a flat tyre, he did it with ease this time to take a 2-1 lead. Leap To Fame had Swayzee beaten before the home bend and raced clear to win by 8.5m, seemingly with trainer-driver Grant Dixon just nursing him to the line. \\\"He did it really well. He's as good as we've ever had him,\\\" trainer-driver Grant Dixon said. The five-year-old smashed his own track record with the 1min 51sec flat mile rate taking 0.7sec off his previous mark for 2138m.  He now holds three of the five current track records at Albion Park. Dixon confirmed Leap To Fame would back up in Saturday night's $200,000 Group 1 Sunshine Sprint \\u2013 a race he won last year \\u2013 and the $400,000 Group 1 Blacks A Fake a week later. \\\"He thrives on backing up, He actually loves the racing and the hard runs seem to bring him on rather than take anything out of him,\\\" Dixon said.  LARRY goes BANG! ???? Leap To Fame bolts in the Mr Feelgood Open, making it 2-1 over brother Swayzee in style with another track record \\u23f1\\ufe0f That was absolutely brilliant from Leap To Fame, what a horse!@TheCreekAlbion#QLDisRacingpic.twitter.com/snWSgl1vl6 \\u2014 RaceQ (@RaceQLD) July 13, 2024  The Blacks A Fake has long been billed as the ultimate rematch, but Leap To Fame now dominates pre-post betting at $1.40.  He is also $1.35 to win the Sunshine Sprint. While Leap To Fame beat Swayzee easily last Saturday night, Dixon is expecting a much harder contest in the Blacks A Fake. \\\"Swayzee hasn't had much racing so I'm sure he'll improve on that and be better in two weeks,\\\" he said.  \\\"You've also got to take into account the early work he did, he really had to go hard to hold the lead and that would've taken a bit out of him.\\\" Leap To Fame's latest win was his 15th from his past 16 starts and his 39th from just 50 lifetime starts. The five-year-old is eighth on the all-time Australasian prizemoney list with $2,857,485 and is a realistic chance of taking top spot from fellow Queenslander Blacks A Fake ($4,575,438) over the next 12 months. Beyond the next two weeks, Leap To Fame's major targets for the rest of 2024 include the $300,000 Group 1 Victoria Cup (Melton, October 12), $NZ1m Group 1 NZ Cup (Addington, November 12) and the $500,000 Group 1 Sydney Inter Dominion final (Menangle, December 14). The other highlight on Saturday night will be the second clash of Australia's two top mares, Ladies In Red and Aardies Express, in the $150,000 Group 1 Golden Girl. Aardies Express upstaged Ladies In Red at their only meeting in the Group 1 Queen Elizabeth II Mile at Menangle on May 4. Both mares capped their preparations with wins last Saturday night, Ladies In Red at Melton and Aardies Express at Albion Park. * Adam Hamilton is a paid contributor writing on harness racing for News Corp   \\n      Read all news by \\n        Adam Hamilton\\n       View by Tags \\n          Harness\\n        \\n          Racing\\n          Click to Register   Top Bookmakers         Contact FAQ Privacy Terms & Conditions Sitemap News Archive Category Archive \\n            Copyright \\u00a9 Racing Internet Services Pty Ltd. 2024\\n            Sign up for our newsletter \\n    Click To Register\\n    Register for Newsletter                Home       News Form iQ Tips      Results   \\n \\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://www.bridgwatermercury.co.uk/news/24451512.photos-winners-sedgemoor-vintage-show-2024/\"\n      },\n      \"page_content\": \"\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"http://www.uniindia.com/asian-granito-india-ltd-opens-agl-universe-showroom-at-garhwa-jharkhand/pnn/news/3242374.html\",\n        \"title\": \"\\r\\n\\tAsian Granito India Ltd opens AGL Universe showroom at Garhwa, Jharkhand\\r\\n\",\n        \"description\": \"Uniindia: Asian Granito India Ltd opens AGL Universe showroom at Garhwa, Jharkhand\",\n        \"language\": \"No language found.\"\n      },\n      \"page_content\": \"\\n\\n\\n\\r\\n\\tAsian Granito India Ltd opens AGL Universe showroom at Garhwa, Jharkhand\\r\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nAbout UNI\\u00a0|\\u00a0\\nContact us\\u00a0|\\u00a0\\nJOBS\\u00a0|\\u00a0\\n\\n\\n\\n\\n \\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\nFriday, Jul 19 2024 | Time 15:03 Hrs(IST)\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\nHomeNewsIndiaWorldSports WorldcupCricketTennis/Badminton/T THockeyFootballTennisEventsAsian GamesOlympic GamesOther Games IPLCommonwealth GamesNational GameSouth Asian GamesBusiness & Economy NewsPRNewsEconomyParliamentEntertainmentStates\\r\\n EastWestNorthSouthAutoworldStartup WorldElectionLandingVideoTokyo OlympicsGraphicsPhotoHindiUrduAbout UNIContact usJOBSCIRP of UNIPRESS RELEASESBusiness Wire IndiaPNNprnewswire\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIndiaWorldSports WorldcupCricketTennis/Badminton/T THockeyFootballTennisEventsAsian GamesOlympic GamesOther Games IPLCommonwealth GamesNational GameSouth Asian GamesBusiness & Economy NewsPRNewsEntertainment States\\r\\n EastWestNorthSouthParliament\\n\\n\\n\\n\\n\\n\\n\\nPress Releases \\u00bb PNNPosted at: Jul 17 2024  5:45PM Asian Granito India Ltd opens AGL Universe showroom at Garhwa, JharkhandGarhwa (Jharkhand) [India], July 17: Asian Granito India Limited (AGL), a leading brand in luxury surface products such as Tiles, Marbles, Quartz, and Bathware solutions has inaugurated AGL Universe - a mega size showroom in Garwha, Jharkhand. The showroom showcases the company's production, technological and innovation excellence at one place and boasts a lavish display ambiance, featuring creatively enhanced mockups that invite customers to envision the product in a remarkably realistic manner.Experience an unparalleled range of AGL Tiles, Engineered Marble, Quartz, Sanitaryware, Bathware, Grand Slabs and Faucets, all thoughtfully curated under one roof.The showroom was inaugurated by Chief Guest, Honorable Sri Mithilesh Kumar Thakur (Minister, Drinking water & Sanitation Department, Government of Jharkhand and MLA, Garhwa), Mr. Manish Singh (DGM) Sales & Marketing - East 1, Asian Granito India Ltd in the presence of Mr. Manish Kumar (RSM-Sales & Marketing-Jharkhand), dignitaries of the city and esteemed guests on 15 July 2024. Located near Namdhari Collage, the AGL Universe in Garhwa is opened in association with Abhishek Hardware and Sanitary owned by Mr. Rahul Jaiswal.Spread across the area of 2700 sq ft, this will be one of the most advanced display showroom in the state of Jharkhand and will have the latest range of products like Marblex, Stylex, Fresco, Tuffguard, Signature collection and Artware as main attraction to experience.The showroom aims to display the entire range of exclusive and elegant range of premium tiles and surfaces collection including Glazed Vitrified tiles, Grand Slabs, Engineered marble, Quartz, Sanitaryware & bathware range including 1400 plus products in all sizes, designs and finishes, all under one roof.Speaking on this occasion, Mr. Kamlesh Patel, Chairman and Managing Director, Asian Granito India Ltd said, \\\"AGL Universe at Garhwa aims to present our newest collection, delivering an unmatched shopping experience for our valued customers. This destination is set to revolutionize tile shopping, offering sophisticated designs and immersive visuals. Customers will be able to explore trendy designs and a contemporary shopping atmosphere, sparking creativity in space creation. Our showroom is a valuable resource for corporate clients, architects, interior designers, and trade partners, offering a comprehensive range of premium tiles, GVT collection, slabs, engineered marble, quartz, sanitaryware, and faucets-all conveniently housed under one roof.In a strategic move to elevate its brand, the company has signed Bollywood superstar Ranbir Kapoor as its brand ambassador and launched the \\\"Premium ka Pappa\\\" campaign. This partnership underscores the brand's dedication to excellence and promises an exciting future. With Kapoor's endorsement, the brand seeks to expand its reach, particularly among the youth, driving forward its vision of growth and connectivity. It also aims to resonate with consumers' aspirations and emotions, establishing a strong connection with both trade partners and customers through its emphasis on premium experiences and sophisticated appeal.As a young and fastest-growing brand, Asian Granito India Ltd continues to push boundaries with its innovative and rich collection of products and is committed to staying ahead of the curve. With Ranbir Kapoor on board, the brand aims to further elevate its presence in the market and connect with a wider audience, especially the youth segment.In a short span of two decades, Asian Granito India Ltd has emerged as India's leading Luxury Surfaces and Bathware Solutions brand. The Company manufacture and markets a range of Tiles, Engineered Marble and Quartz, Sanitaryware and Faucets. The Company has 235 plus exclusive franchisee showrooms, 11 company owned display centers and an extensive marketing and distribution network pan India with 14,000 plus touchpoints including distributors, dealers and sub-dealers in India. The Company also exports to more than 100 countries.Asian Granito has 2,942 plus SKUs on offer in Tiles segment, 1,100 plus SKUs in Bathware and faucets and 126 plus SKUs in Engineered Marble and Quartz Stone. Over the years, the company has invested heavily in expanding production capabilities, product portfolio, distribution network and global reach. This dedication has propelled it on a path of continuous growth, positioning the company among the leading ceramic tiles companies in India and an emerging brand in the global markets. \\u00a0About Asian Granito India LimitedEstablished in the year 2000, Asian Granito India Ltd. (AGL) has emerged as India's leading Luxury Surfaces and Bathware Solutions brand in a short span of two decades. The Company manufactures and markets a wide range of Tiles, Engineered Marble and Quartz, Sanitaryware and Faucets. AGL products are synonymous with reliability, adaptability, innovation, quality consciousness and the company has created a strong brand identity, well recognized globally and loyal customer following across segments. Today it is 4th largest listed ceramic tile company in India with employee strength of 6,000 plus.Ranked amongst the top ceramic tiles companies in India, AGL has achieved over 65 times growth in its production capacity, from 0.83 Million Sq. Mtrs. Per Annum in FY 2000 to 54.5 Million Sq. Mtrs. Per Annum in FY 2023. AGL is also the only tiles company to be acknowledged in the Vibrant Gujarat Summit 2015 for achieving phenomenal growth.The Company has 14 state-of-the-art manufacturing units spread across Gujarat and 235 plus exclusive franchisee showrooms, 12 company owned display centers across India. Further, the Company has an extensive marketing and distribution network pan India with 14,000 plus touchpoints including distributors, dealers and sub-dealers in India. The company also exports to more than 100 countries.The Company looks to strengthen its identity as the leader in the Indian ceramic industry by consistently introducing innovative and value-added products in the market to keep pace with its valued customers. Headquartered in Ahmedabad, AGL is listed on NSE & BSE and reported net consolidated turnover of INR 1530.6 crore in FY 2024. (For more information, please visit: www.aglasiangranito.com)If you have any objection to this press release content, kindly contact pr.error.rectification@gmail.com to notify us. We will respond and rectify the situation in the next 24 hours.Disclaimer: This is syndicated feed from PR agency and any legal liability for the content is theirs only.Tags: #Asian Granito India Ltd opens AGL Universe showroom at Garhwa# Jharkhand\\n\\n\\n\\n\\n\\n\\n\\n\\nMore News413 students selected in NIMCET 2024 from Jitendra Mishra Academy, Highest Number of Selections in All over India19 Jul 2024 | 12:58 PM413 students selected in NIMCET 2024 from Jitendra Mishra Academy, Highest Number of Selections in All over Indiasee more..Experience Future of Retail with BillMade at Bengaluru Retail Summit 202419 Jul 2024 | 1:09 PMExperience Future of Retail with BillMade at Bengaluru Retail Summit 2024see more..Acharya Prashant: Spirituality you can fall in love with18 Jul 2024 | 8:56 PMsee more..Introducing Tanjore Tiffins: Bangalore\\u2019s Latest QSR Offering Vegetarian and Non-Vegetarian South Indian Cuisine Opens in Indiranagar18 Jul 2024 | 8:50 PM&NBSPsee more..Saina Nehwal Inaugurates Badminton Pros Academy at Dosti West County \\u2013 Balkum, Thane (W)18 Jul 2024 | 8:40 PMsee more..\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nUNI PhotoMILWAUKEE, July 19, 2024 (UNI/Xinhua) -- Former U.S. President Donald Trump (2nd L, front) and Republican vice presidential candidate J.D. Vance (R, front) gesture during the Republican National Convention in Milwaukee, Wisconsin, the United States, on July 18, 2024. Trump formally accepted the GOP presidential nomination Thursday night at the Republican National Convention being held in Milwaukee. UNI PHOTO-11FMOSCOW, July 19, 2024 (UNI/Xinhua) -- A participant performs during the World Circus Art Festival \\\"IDOL-2024\\\" in Moscow, Russia, on July 18, 2024. The festival is held from July 18 to 21 in Moscow. UNI PHOTO-10FNEW DELHI, JUL 19 (UNI):- Union Minister for Youth Affairs and Sports and Labour and Employment, Mansukh Mandaviya at the launch of the 2nd Phase of KIRTI (Khelo India Rising Talent Identification) Program at JLN Stadium, in New Delhi on Friday. UNI PHOTO-21UNEW DELHI, JUL 19 (UNI):- Union Minister for Youth Affairs and Sports and Labour and Employment, Mansukh Mandaviya addressing at the launch of the 2nd Phase of KIRTI (Khelo India Rising Talent Identification) Program at JLN Stadium, in New Delhi on Friday. UNI PHOTO-20UNEW DELHI, JUL 19 (UNI):- Union Minister for Youth Affairs and Sports and Labour and Employment, Mansukh Mandaviya addressing at the launch of the 2nd Phase of KIRTI (Khelo India Rising Talent Identification) Program at JLN Stadium, in New Delhi on Friday. UNI PHOTO-19UNEW DELHI, JUL 19 (UNI):- Union Minister for Youth Affairs and Sports and Labour and Employment, Mansukh Mandaviya interacting with players during the launch of the 2nd Phase of KIRTI (Khelo India Rising Talent Identification) Program at JLN Stadium, in New Delhi on Friday. UNI PHOTO-18UNEW DELHI, JUL 19 (UNI):- Union Minister for Youth Affairs and Sports and Labour and Employment, Mansukh Mandaviya interacting with players during the launch of the 2nd Phase of KIRTI (Khelo India Rising Talent Identification) Program at JLN Stadium, in New Delhi on Friday. UNI PHOTO-17UGUWAHATI, JULY 19 (UNI):- Assam Chief Minister Himanta Biswa Sarma briefing newsmen after  launching  an App on Amrit Brikshya Andolan  at CM office, in Guwahati on Friday.UNI PHOTO-16UGUWAHATI, JULY 19 (UNI):- Assam Chief Minister Himanta Biswa Sarma  launching  an App on Amrit Brikshya Andolan  at CM office, in Guwahati on Friday.UNI PHOTO-15UOXFORDSHIRE, July 19, 2024 (UNI/Xinhua) -- British Prime Minister Keir Starmer (L) walks with Britain's King Charles III during the fourth meeting of the European Political Community (EPC) at Blenheim Palace in Oxfordshire, Britain, July 18, 2024. Some 50 European leaders gathered in the United Kingdom (UK) on Thursday for the fourth meeting of the EPC as the UK aims to reshape ties with Europe amid global challenges. UNI PHOTO-9FMEXICO CITY, July 19, 2024 (UNI/Xinhua) -- Mexico's president-elect Claudia Sheinbaum (2nd R) poses for a group photo with three of her future cabinet members in Mexico City, Mexico, July 18, 2024. Sheinbaum, scheduled to take office on Oct. 1, presented three more members of her future cabinet on Thursday.\\r   At a press conference held in downtown Mexico City, Sheinbaum introduced Marath Baruch Bolanos as Secretary of Labor and Social Welfare, Josefina Rodriguez Zamora as Secretary of Tourism, and Claudia Curiel de Icaza as Secretary of Culture. UNI PHOTO-8FNEW DELHI, JULY 19 (UNI):- Delhi Minister Atishi addressing a press conference, in New Delhi on Friday. UNI PHOTO-9UNEW DELHI, JULY 19 (UNI):- Delhi Minister Atishi addressing a press conference, in New Delhi on Friday. UNI PHOTO-8UBENGALURU, JULY 19 (UNI):- BJP MLCs protesting against the Valmiki Corporation scam in front of Gandhi statue at Vidhan Sabha premises, in Bengaluru on Friday. UNI PHOTO-7UGUWAHATI, JULY 19 (UNI):-  Children cool off themselves at a spring on a  hot summer day, in Guwahati on Friday.UNI PHOTO- 14UGUWAHATI, JULY 19 (UNI):-  Children cool off themselves at a spring on a  hot summer day, in Guwahati on Friday.UNI PHOTO- 13UGUWAHATI, JULY 19 (UNI):-  Children cool off themselves at a spring on a  hot summer day, in Guwahati on Friday.UNI PHOTO- 12URAIPUR, JULY 19 (UNI):- Chhattisgarh Chief Minister Vishnu Dev Sai paying last respect to the mortal remains of the soldier Bharat Lal Sahu at Mana, in Raipur on Friday. Who was martyred in the IED blast by the Naxalist at Tarrem area of Bijapur district. UNI PHOTO-11UNEW DELHI, JULY 19 (UNI):- Delhi Minister Atishi addressing a press conference, in New Delhi on Friday. UNI PHOTO-10UBENGALURU, JULY 19 (UNI):- BJP MLCs protesting against the Valmiki Corporation scam in front of Gandhi statue at Vidhan Sabha premises, in Bengaluru on Friday. UNI PHOTO-6U\\n\\n\\n\\n\\n\\nOther Links\\n\\n\\n\\nUNIVARTA (News Agency)\\nIndian News Agency\\n\\n\\nUNI-Urdu Service(News Agency)\\nIndian News Agency\\n\\n\\n Newswrap\\n\\n\\n Newswrap1\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\nFriday, Jul 19 2024 | Time 15:03 Hrs(IST)\\n\\n\\n\\nHome\\nNews\\nPhoto\\nHindi\\nUrdu\\nPRESS RELEASES\\nWeb Hits\\nFeedBack\\n\\n\\n\\n\\nAbout UNI\\nContact us\\nSiteMap\\nJOBS\\nTender\\nTerms of Use\\nDisclaimer\\nPrivacy policy\\n\\n\\n\\nFollow us on :- \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nContact us at :- \\n\\nUnited News of India\\n\\r\\n      9, Rafi Marg, New Delhi-110001\\r\\n      \\r\\n      Email:vsat@uniindia.com\\r\\n      \\r\\n      Contact: 011-23714434 / 23357614 (O)\\r\\n      \\n\\n\\n \\r\\n            Copyright @ United News of India. All rights reserved.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  },\n  {\n    \"lc\": 1,\n    \"type\": \"constructor\",\n    \"id\": [\n      \"langchain\",\n      \"schema\",\n      \"document\",\n      \"Document\"\n    ],\n    \"kwargs\": {\n      \"metadata\": {\n        \"source\": \"https://wonderfulengineering.com/10-best-screen-protectors-for-honor-90-smart/\",\n        \"title\": \"10 Best Screen Protectors For Honor 90 Smart\",\n        \"description\": \"This article will guide you through the 10 best screen protectors for Honor 90 Smart, providing detailed descriptions.\",\n        \"language\": \"en-US\"\n      },\n      \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n10 Best Screen Protectors For Honor 90 Smart\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSkip to content\\n\\n\\n\\n\\n\\n \\nMenu\\n\\nTechnology\\n\\nBioMedical\\n\\n\\nCars Bikes\\nRobotics\\nArchitecture\\nMilitary Tech\\nDIY Projects\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\nSearch for:\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTechnology\\n\\nBioMedical\\n\\n\\nCars Bikes\\nRobotics\\nArchitecture\\nMilitary Tech\\nDIY Projects\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n10 Best Screen Protectors For Honor 90 Smart Minahil AbidJuly 13, 20240 \\n\\n\\n\\n\\n\\n  \\n\\nTwitter\\n\\n\\n\\n\\n\\n  \\n\\nFacebook\\n\\n\\n\\n\\n\\n\\n\\nGoogle+\\n\\n\\n\\n\\n\\n  \\n\\nPinterest\\n\\n\\n\\n\\n\\n  \\n\\nTumblr\\n\\n\\n\\n\\n\\n  \\n\\nLinkedin\\n\\n\\n\\n\\n\\n   \\n\\nReddit\\n\\n\\n\\n\\n\\n  \\n\\nEmail\\n\\n\\n\\n\\n\\n \\n\\nAs the smartphone market continues to evolve, the Honor 90 Smart has emerged as a popular choice due to its impressive features and sleek design. Protecting your investment with a high-quality screen protector is essential to maintain the device\\u2019s pristine condition and ensure a long lifespan. This article will guide you through the 10 best screen protectors for Honor 90 Smart, providing detailed descriptions to help you make an informed decision.\\n10 SHAMMA SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nSHAMMA is renowned for producing reliable and durable mobile accessories, and their screen protector for the Honor 90 Smart is no exception. This tempered glass protector offers superior scratch resistance and comes with an innovative installation tray that ensures perfect alignment. With a 9H hardness rating, it can withstand significant impact and resist scratches from everyday objects like keys and coins. The oleophobic coating reduces fingerprints and smudges, keeping the screen clear and vibrant.\\nAvailable here\\n9. HGJTFANY TEMPERED GLASS SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nHGJTFANY tempered glass screen protector is another excellent choice for Honor 90 Smart users. It boasts a 9H hardness rating and offers full-screen coverage, including the curved edges. The protector is designed to be ultra-clear, ensuring high-definition viewing and maintaining the original touch experience. Its hydrophobic and oleophobic coatings help keep the screen clean by repelling water and oil.\\nAvailable here\\n8. VBSYUWSA SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nFor those who frequently use their phones outdoors, the Vbsyuwsa screen protector is an excellent option. This protector not only guards against scratches and minor impacts but also reduces glare from sunlight, making it easier to see the screen in bright conditions. Made from high-quality film, it provides a smooth touch experience without compromising clarity.\\nAvailable here\\n7. NEOYUKL TEMPERED GLASS SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nNEOYUKL\\u2019s tempered glass screen protector is designed to offer maximum protection for the Honor 90 Smart while maintaining the device\\u2019s original touch sensitivity. With a 9H hardness rating and reinforced edges, this protector protects against drops and scratches. The installation frame ensures an easy, bubble-free application, and the protector\\u2019s high transparency preserves the screen\\u2019s brightness and clarity.\\nAvailable here\\n6. MAOUICI SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nThe MAOUICI screen protector for the Honor 90 Smart combines affordability with high-quality protection. This tempered glass protector has a 9H hardness rating and is designed to be ultra-thin, ensuring it does not interfere with the phone\\u2019s touch sensitivity. The protector comes with a complete installation kit, including cleaning wipes and dust removal stickers, making the installation process straightforward and hassle-free.\\nAvailable here\\n5. AQGGIIXY GLASS SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nAQGGIIXY glass screen protector offers edge-to-edge coverage for the Honor 90 Smart, providing comprehensive protection for the entire screen. With its 9H hardness rating, this tempered glass protector can withstand significant impact and prevent scratches. The oleophobic coating helps reduce fingerprints and smudges, ensuring the screen remains clear. The precise laser-cut design ensures a perfect fit without interfering with the front camera or sensors.\\nAvailable here\\n4. MOOISVS SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nMOOISVS screen protector is crafted from high-quality tempered glass and provides robust protection for the Honor 90 Smart. It has a 9H hardness rating features an anti-scratch surface that can withstand everyday wear and tear. The protector also includes an anti-fingerprint coating to clean and clear the screen. The package comes with three protectors, ensuring that you have spares available.\\nAvailable here\\n3. KJYFOANI TEMPERED GLASS SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nThe KJYFOANI tempered glass screen protector offers durability and clarity for the Honor 90 Smart. Its 9H hardness rating ensures strong protection against scratches and impacts. The protector is ultra-clear and maintains the original screen brightness and touch sensitivity. The package includes an installation frame, wet and dry wipes, and dust removal stickers to ensure a smooth and bubble-free installation.\\nAvailable here\\n2. MR.SHIELD SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nMr. Shield\\u2019s screen protector is designed to offer high protection for the Honor 90 Smart at an affordable price. Made from premium tempered glass with a 9H hardness rating, it protects against scratches and drops. The protector is ultra-thin and maintains the original touch experience. It also features rounded edges for a comfortable grip and easy installation.\\nAvailable here\\n1. IBYWIND SCREEN PROTECTOR FOR HONOR 90 SMART:\\n\\nTrianium\\u2019s screen protector, with its durable tempered glass construction, provides comprehensive protection for the Honor 90 Smart. The 9H hardness rating ensures the screen remains scratch-free and protected from impacts. The protector is designed to be ultra-clear, preserving the phone\\u2019s original display quality. The package includes three protectors, an installation guide, and accessories to ensure a hassle-free installation.\\nAvailable here\\nChoose one of these 10 best screen protectors for the Honor 90 Smart, and you\\u2019ll always have style and protection at your fingertips.\\n\\n\\n\\n\\n\\n\\n\\n  \\n\\nTwitter\\n\\n\\n\\n\\n\\n  \\n\\nFacebook\\n\\n\\n\\n\\n\\n\\n\\nGoogle+\\n\\n\\n\\n\\n\\n  \\n\\nPinterest\\n\\n\\n\\n\\n\\n  \\n\\nTumblr\\n\\n\\n\\n\\n\\n  \\n\\nLinkedin\\n\\n\\n\\n\\n\\n   \\n\\nReddit\\n\\n\\n\\n\\n\\n  \\n\\nEmail\\n\\n\\n\\n\\n\\n\\nPrevious article\\n10 Best Screen Protectors For Honor Magic 6\\n\\n\\nNext article\\n10 Best Screen Protectors For Tecno Camon 30 Premier\\n\\n\\n\\nRelated Articles\\n\\n\\n\\n\\n \\nTop 10 \\n\\n\\n10 Best Screen Protectors For Honor X50 GT \\n\\n\\n\\n\\n\\n \\nTop 10 \\n\\n\\n10 Best Screen Protectors For Asus ROG Phone 8 Pro \\n\\n\\n\\n\\n\\n \\nTop 10 \\n\\n\\n10 Best Screen Protectors For Vivo Y200i \\n\\n\\n\\n\\n< Next article Previous article >\\n\\n\\n\\n\\nLeave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * \\nEmail * \\n\\n\\n Notify me of follow-up comments by email. Notify me of new posts by email. \\n\\n \\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n-->\\n\\n\\n\\nRecent Posts\\n\\n\\nWatch A Tesla Cybertruck Racing An Old Chevy Corvette \\u2013 With A Surprising Result\\n\\n\\nChina Is Planning To Deflect A Near-Earth Asteroid In 2030\\n\\n\\nChina Has Armed A Nuclear Bomber With A 930-Mile-Range Hypersonic Weapon\\n\\n\\nThis Bicycle-Pedalling Poodle Has Become An Overnight Internet Sensation\\n\\n\\nMicrosoft\\u2019s AI-powered, Canva-Like Designer App Is Coming To iOS And Android\\n\\n\\n \\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTrending\\nHot\\nPopular\\nAbout\\nPrivacy Policy\\nContact Us\\n \\n\\n\\n\\t\\t\\t\\t\\tCopyright \\u00a9 2024 Wonderful Engineering. All Rights Reserved.\\t\\t\\t\\t\\n\\n\\n\\n\\n \\n\\n\\n\\u00a0\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nLoading Comments...\\n\\n\\n\\n\\u00a0\\n\\n\\nWrite a Comment...\\n\\n\\n\\n\\nEmail (Required)\\n\\n\\n\\nName (Required)\\n\\n\\n\\nWebsite\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n      \"type\": \"Document\"\n    }\n  }\n]"