"[\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://www.openpr.com/news/3556331/new-radar-sensor-for-collision-avoidance-positioning\",\n          \"title\": \"New radar sensor for collision avoidance & positioning:\",\n          \"description\": \"Press release - OndoSense - New radar sensor for collision avoidance & positioning: OndoSense WA detects objects at close range from 0.1 m - published on openPR.com\",\n          \"language\": \"en\"\n        },\n        \"page_content\": \"\\n\\n\\n\\n\\n\\nNew radar sensor for collision avoidance & positioning:\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPR-WikiImprint\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch \\u00a0 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nCategories\\n\\nAdvertising, Media Consulting, Marketing Research\\nArts & Culture\\nAssociations & Organizations\\nBusiness, Economy, Finances, Banking & Insurance\\nEnergy & Environment\\nFashion, Lifestyle, Trends\\nHealth & Medicine\\nIndustry, Real Estate & Construction\\nIT, New Media & Software\\nLeisure, Entertainment, Miscellaneous\\nLogistics & Transport\\nMedia & Telecommunications\\nPolitics, Law & Society\\nScience & Education\\nSports\\nTourism, Cars, Traffic\\nRSS-Newsfeeds\\n\\n\\n\\nSubmit Press Release\\n\\nSubmit Press Release Free of Charge\\nPressemitteilung kostenlos ver\\u00f6ffentlichen \\u00a0 \\n\\n\\n\\nOrder Credits\\n\\n\\nArchive\\n\\n\\nMagazine\\n\\n\\nAbout Us\\n\\nAbout / FAQ\\nNewsletter\\nTerms & Conditions\\nPrivacy Policy\\nImprint\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPress release\\n\\n\\nNew radar sensor for collision avoidance & positioning: OndoSense WA detects objects at close range from 0.1 m\\n\\n\\n            06-28-2024 08:41 AM CET | Industry, Real Estate & Construction\\nPress release from: OndoSense\\n\\nThe robust anti-collision radar OndoSense reach WA offers up to 4 sensor zones and detects objects from 0.1 to 25 meters. \\u00a9 OndoSFreiburg (D), June 2024 - OndoSense is expanding its sensor portfolio: The expert for high-precision, high-performance radar technology has developed a compact radar sensor for collision avoidance, vehicle detection & object positioning. With its wide detection range, the OndoSense reach WA (Wide Angle) is particularly suited for detecting obstacles such as vehicles, people or objects as well as for positioning robots and machines. It detects static and moving objects even at close range from 0.1 meters and can be easily integrated even in confined spaces, thanks to its very small design. With up to 4 adjustable sensor zones, the OndoSense reach WA is ideal for flexible monitoring of security areas or collision avoidance of mobile robots or other vehicles. Thanks to innovative radar technology, the radar sensor always reliably detects objects of any nature, even outdoors or in difficult environments with dirt, smoke, steam, rain or poor lighting conditions. And as a result of its high measuring rate of 200 Hz, it always reliably detects obstacles even with fast movements. The OndoSense reach WA is suitable for collision avoidance, vehicle detection, object positioning and limit level control in transport & logistics, mining, shipping, mechanical and plant engineering, and agriculture.\\n\\nAn OndoSense reach WA test package is currently available at an exclusive price of EUR 759 (limited offer): https://ondosense.com/en/os-reach-wa/\\n\\nOptimal object detection in close range from 0.1 meters\\n\\nThe OndoSense reach WA detects obstacles such as vehicles, people, walls and other static or moving objects from 0.1 meters to at least 25 meters. \\\"Our sensor offers the smallest blind zone on the market for anti-collision radars. This makes the OndoSense reach WA ideal for applications in which objects in close range must be reliably detected. This includes, for example, the detection or positioning of cars in the car wash, the prevention of collisions between aircraft and ground support equipment at the airport or the positioning of drilling machines or washing robots on walls or in tunnels. Our radar system thus enables safe operation without costly unplanned downtimes,\\\" explains Rainer Waltersbacher, Co-CEO of OndoSense.\\n\\n4 adjustable sensor zones - for flexible monitoring of safety areas\\n\\nIn addition, the OndoSense reach WA offers up to 4 sensor zones, which can be easily adjusted independently of one another via 3 switching points in the configuration software. The radar sensor thus offers flexible, reliable monitoring of the safety areas of machines and robots as well as safe collision avoidance of automated guided vehicles (AGVs) in the ports or intralogistics. By connecting the sensor to the programmable logic controller (PLC), the speed of the AGV can, for example, be automatically adjusted in several stages up to the emergency stop to reliably avoid collision-related damage with expensive, lengthy repairs.\\n\\nSmallest anti-collision sensor on the radar market\\n\\nWith its M30 design and a length of just 92 millimeters, the OndoSense reach WA is one of the smallest radar sensors for collision protection & object positioning. This means that the sensor can be easily integrated into vehicles, machines or robots even in small spaces. With a measuring rate of up to 200 Hz, the OndoSense reach WA is also suitable for applications in which detection speed plays an important role - e. g. when detecting moving obstacles or avoiding collisions between vehicles and mobile robots. And thanks to an opening angle of 15 degrees and a measuring precision of \\u00b11 mm, the OndoSense reach WA is suitable for precise positioning of machines or robot arms where the target object is tilted - i. e. not optimally aligned with the radar sensor.\\n\\nThe radar sensor has an RS485 communication protocol, 3 digital switching outputs (PNP/NPN) and an analog current interface (4-20 mA). An IO-Link version will be available from 2025. The sensor can operate interfaces such as Profinet or CAN via a gateway.\\n\\nReliable obstacle and object detection even in dirt, steam or rain\\n\\nThe OndoSense reach WA radar sensor for collision avoidance & object positioning detects static and moving objects even in dirt, smoke, steam, rain, snow, poor lighting conditions and light flashes. The radar also detects all materials, regardless of their properties. Thanks to its dust-tight, jet-proof housing (IP 67) and its durable PTFE lens, the robust radar sensor is also suitable for demanding environments and outdoor applications.\\n\\nThe powerful and robust OndoSense reach WA radar is ideal for collision avoidance, obstacle detection, vehicle and object detection and position control in transport & logistics, mining, shipping, mechanical and plant engineering or agriculture.\\n\\nMore applications: https://ondosense.com/en/radar-sensors-industries-applications-solutions/collision-avoidance/\\n\\nOndoSense GmbH\\r\\nB\\u00f6tzinger Str. 60\\r\\n79111 Freiburg\\r\\nGermany\\n\\nAbout OndoSense\\n\\nOndoSense realizes breakthrough radar sensor technology for a digitized industrial world. With sensor solutions based on high-precision, robust radar technology and smart sensor software, we ensure customers get relevant data for the intelligent control of production plants and machines. That way, we are helping to drive digital transformation in the industry. Our innovative, high-performance radar sensors can be used reliably in a wide range of applications - even in challenging environments with dust, steam, smoke, fire, or noise. OndoSense was founded in 2018 by two radar experts from the Fraunhofer Institute for Applied Solid State Physics IAF.\\n\\nhttps://ondosense.comThis release was published on openPR.\\n\\n\\n\\n\\n Permanent link to this press release: \\n\\n\\n\\n Copy\\n\\n\\n\\n Please set a link in the press area of your homepage to this press release on openPR.  openPR disclaims liability for any content contained in this release. \\n\\n\\n\\n \\u00a0 Share\\n \\u00a0 Tweet \\n \\n \\u00a0 Email \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nYou can edit or delete your press release New radar sensor for collision avoidance & positioning: OndoSense WA detects objects at close range from 0.1 m here\\n\\n\\n\\n\\n\\n\\n Delete press release\\n\\n\\n\\n\\n\\n\\n Edit press release\\n\\n\\nNews-ID: 3556331 \\u2022 Views:  \\u2026\\n\\n\\n\\n\\n\\nMore Releases from OndoSense\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n02-15-2024 | Industry, Real Estate & Constr \\u2026  OndoSense\\n\\n\\n\\n                                                    OndoSense expands sensor portfolio: OndoSense reach - smallest dimensions, great \\u2026                                                \\n\\n\\n\\n                                            Millimeter accuracy, high measuring speed, wide measuring range: The OndoSense reach radar distance sensor offers high performance and reliability - even in difficult environments. As one of the smallest radar sensors for distance measurements, it is also suitable for confined measurement scenarios.\\r\\n--> More on OndoSense reach: https://ondosense.com/en/high-precision-radar-sensors/radar-sensor-distance-measurement-object-detection-ondosense-reach/\\n\\nOndoSense expands its portfolio of high-performance and reliable industrial sensors: Based on the world's first micrometer-accurate distance radar OndoSense apex, the German radar expert\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMore Releases for AGV\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n08-03-2022 | Advertising, Media Consulting, \\u2026  Ken Research\\n\\n\\n\\n                                                    North America Automated Guided Vehicles (AGV) Market: Ken Research                                                \\n\\n\\n\\n                                            The report titled \\\"North America Automated Guided Vehicles Market Outlook and Forecast to 2027 - Driven by Rising Demand for Automation in Material Handling, Enhanced Workplace Safety and Improved Productivity: Ken Research\\\" provides a comprehensive analysis of the North America Automated Guided Vehicles Market. The report provides industry size basis revenue and value chain analysis, market segmentation based on Product Type, Navigation Technology Type, Application Type, Type of End User\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n02-13-2022 | Industry, Real Estate & Constr \\u2026  ReportsnReports\\n\\n\\n\\n                                                    Latest AGV for Cold Storage Market 2022 | Detailed Report                                                \\n\\n\\n\\n                                            The AGV for Cold Storage research report combines vital data incorporating the competitive landscape, global, regional, and country-specific market size, market growth analysis, market share, recent developments, and market growth in segmentation. Furthermore, the AGV for Cold Storage research report offers information and thoughtful facts like share, revenue, historical data, and global market share. It also highlights vital aspects like opportunities, driving, product scope, market overview, and driving force.\\n\\nDownload FREE\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n12-02-2021 | IT, New Media & Software  Visiongain IT\\n\\n\\n\\n                                                    Automated Guided Vehicle (AGV) Market Report Up to 2031                                                \\n\\n\\n\\n                                            Visiongain has published a new report on Automated Guided Vehicle (AGV) Market Report to 2031: Forecasts by mode of operation (Indoor, Outdoor), by navigation technology (Inductive Guidance, Natural Navigation, Magnetic Guidance, Laser Guidance, Others), by application (Packaging, Logistics & Warehousing, Trailer Loading & Unloading, Others), by industry vertical (Metals & Heavy Machinery, Automotive, Semiconductors & Electronics, Printing Industry, Food & Beverages, Others). PLUS Profiles of Leading Automated Guided Vehicle Companies\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n10-28-2020 | Advertising, Media Consulting, \\u2026  GLOBAL INFO RESEARCH\\n\\n\\n\\n                                                    Global AGV Driverless Forklift Market Analysis by 2020-2025                                                \\n\\n\\n\\n                                            Global Info Research offers a latest published report on AGV Driverless Forklift Analysis and Forecast 2019-2025 delivering key insights and providing a competitive advantage to clients through a detailed report. This report focuses on the key global AGV Driverless Forklift  Concentrate players, to define, describe and analyze the value, market share, market competition landscape, SWOT analysis and development plans in next few years.\\n\\nClick to view the full report TOC,\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n11-04-2019 | Industry, Real Estate & Constr \\u2026  ENGMATEC GmbH\\n\\n\\n\\n                                                    Board handling with AGV at productronica                                                \\n\\n\\n\\n                                            At this year's productronica in Munich, the automation specialist ENGMATEC presents a test line with test handler and board handling. This time a 2-fold loader/unloader module will be used for handling the PCB magazines. The board handling module has a corresponding interface to be supplied with magazines via a Automated Guided Vehicle (AGV). Loading and unloading takes place autonomously by the AGV. In the trade fair constellation, the control of\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n02-11-2019 | Industry, Real Estate & Constr \\u2026  Market Density\\n\\n\\n\\n                                                    Global Paper AGV Market Research Report 2018                                                \\n\\n\\n\\n                                            Global Paper AGV Market is anticipated to develop amazingly in the conjecture time frame attributable to the ascent popular for material taking care of hardware and expedient reception of mechanization in different ventures. Robotized guided vehicles are customized versatile vehicles are essentially utilized in enterprises to transport materials around an assembling office\\n\\nGet sample copy of report:\\t\\r\\nhttps://www.marketdensity.com/contact?ref=Sample&reportid=5772\\n\\nTable of Contents\\r\\n1 Paper AGV Market Overview \\r\\n1.1 Product Overview and Scope of Paper AGV\\u2026 \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nComments about openPR\\n\\n\\n \\u00a0\\n\\n                        \\n\\n\\n                        I can't but agree to the positive statements about your portal: easy to use, clear layout, very good search function, and quick editing!Jens O'Brien, Borgmeier Media Communication\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n                            Your Press Release on Google News\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n                            Press Release in German on openPR.de\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n            \\u00a9 2004 - 2024 openPR. All rights reserved.\\n\\n            \\nFAQ | Imprint | Privacy Policy | Terms & Conditions | Contact Point DSA | Reporting Form DSA | Cookie Settings\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch \\u00a0 \\n\\n\\n\\n\\n\\n\\n\\n\\nHome\\n\\n\\nCategories\\n\\nAdvertising, Media Consulting, Marketing Research\\nArts & Culture\\nAssociations & Organizations\\nBusiness, Economy, Finances, Banking & Insurance\\nEnergy & Environment\\nFashion, Lifestyle, Trends\\nHealth & Medicine\\nIndustry, Real Estate & Construction\\nIT, New Media & Software\\nLeisure, Entertainment, Miscellaneous\\nLogistics & Transport\\nMedia & Telecommunications\\nPolitics, Law & Society\\nScience & Education\\nSports\\nTourism, Cars, Traffic\\nRSS-Newsfeeds\\n\\n\\n\\nSubmit Press Release\\n\\nSubmit Press Release Free of Charge\\nPressemitteilung kostenlos ver\\u00f6ffentlichen \\u00a0 \\n\\n\\n\\nOrder Credits\\n\\n\\nArchive\\n\\n\\nMagazine\\n\\n\\nPR-Wiki\\n\\n\\nAbout Us\\n\\nAbout / FAQ\\nNewsletter\\nTerms & Conditions\\nPrivacy Policy\\nImprint\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ],\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://www.pandct.com/news/the-benefits-of-using-guided-wave-radar-for-level-sensing-in-harsh-environments\",\n          \"title\": \"Security Verification\",\n          \"language\": \"No language found.\"\n        },\n        \"page_content\": \"\\n\\n\\n\\n\\nSecurity Verification\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTo help us keep this website secure, please wait while we verify you're not a robot! It will only take a few seconds...\\n\\n\\n\\nLoading...\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ],\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://technode.com/2024/07/01/chinese-companies-take-on-teslas-full-self-driving-with-non-lidar-approach-end-to-end-ai/\",\n          \"title\": \"China's carmakers take on Tesla FSD with vision approach, E2E AI \\u00b7 TechNode\",\n          \"description\": \"As Tesla\\u2019s most advanced driver assistance software (ADAS) is becoming an immediate threat due to its impending arrival in China, major Chinese electric\",\n          \"language\": \"en-US\"\n        },\n        \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nChina's carmakers take on Tesla FSD with vision approach, E2E AI \\u00b7 TechNode\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\nSubscribe to the TechNode Briefing Newsletter\\nEvery Wednesday and Friday, TechNode\\u2019s Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\\n\\n\\n \\n\\n\\n\\n\\nSign up\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tAlready have an account?\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\tSign in\\t\\t\\t\\t\\t\\n\\n\\nSubscribe to TechNode Briefing Newsletter\\n\\nEvery Wednesday and Friday, TechNode\\u2019s Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\\n \\n\\n\\n\\n\\n\\n\\n\\nSubscribe\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tOR\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tSign in with Google\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\nBy signing up, you agree to our privacy policy. \\n\\n\\n\\n\\n\\n\\n\\n\\nThank you for registering!\\n\\n\\n\\n\\nAn account was already registered with this email.Please check your inbox for an authentication link. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSupport Us\\nYour support helps TechNode continue to provide credible, on-the-ground journalism and industry insights about the Chinese tech industry.\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\tOne-time\\t\\t\\n\\n\\t\\t\\t\\tMonthly\\t\\t\\n\\n\\t\\t\\t\\tAnnually\\t\\t\\n\\n\\n\\n\\n\\t\\t\\tOne-time\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$60\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$120\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$365\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tMonthly\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$10\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$20\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$30\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tAnnually\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$60\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$120\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$365\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tYour contribution is appreciated.\\t\\t\\n\\n\\t\\t\\tDonate Now\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tClose\\t\\t\\n\\nDonate\\nSign In \\n\\n\\nSearch for:\\n\\n\\n\\n \\n\\t\\t\\tSearch\\t\\t\\n\\n\\n\\nNEWS\\nFEATURES\\nTOPICS\\n\\nOpen dropdown menu\\n\\n\\nAI\\nAuto and EV\\nE-commerce\\nContent\\nSemiconductor\\nGadget review\\nBEYOND EXPO\\n\\n\\nPARTNERS\\n\\nOpen dropdown menu\\n\\n\\n2023 INCLUSION-Conference on the Bund\\n\\n\\n \\n\\n\\n\\n\\n\\n\\t\\t\\tClose\\t\\t\\n\\n\\nSkip to content\\n\\n\\n\\n\\n\\n\\nNEWS\\nFEATURES\\nTOPICS\\n\\nOpen dropdown menu\\n\\n\\nAI\\nAuto and EV\\nE-commerce\\nContent\\nSemiconductor\\nGadget review\\nBEYOND EXPO\\n\\n\\nPARTNERS\\n\\nOpen dropdown menu\\n\\n\\n2023 INCLUSION-Conference on the Bund\\n\\n\\n \\n\\n\\n\\n\\n\\nTechNode\\n\\n\\t\\t\\t\\t\\tLatest news and trends about tech in China\\t\\t\\t\\t\\n\\n\\n\\n\\n\\nDonate\\nSign In \\n\\n\\n\\n\\n\\t\\t\\tOpen Search\\t\\t\\n\\n\\n\\n\\n\\n\\nSearch for:\\n\\n\\n\\n \\n\\t\\t\\tSearch\\t\\t\\n\\n\\n\\n\\n\\n\\n Menu\\n\\n\\nSign In \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPosted inHeavy Hitters \\n\\t\\t\\tChinese companies take on Tesla\\u2019s Full Self-Driving with non-lidar approach, end-to-end AI\\t\\t\\n\\n\\n\\n\\nby\\nJill Shen \\nJul 1, 2024Jul 1, 2024 \\nShare this:Click to share on Twitter (Opens in new window)Click to share on Facebook (Opens in new window) \\n\\n\\n\\nA Tesla Model 3 and a Cybertruck were showcased at the BEYOND EXPO 2024, held in Macao between May 22-25, 2024. Credit: BEYOND EXPO\\n\\n\\n\\n \\nEvery Wednesday and Friday, TechNode\\u2019s Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\\n\\n\\n \\n\\n\\n\\n\\nSign up\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nAs Tesla\\u2019s most advanced driver assistance software (ADAS) is becoming an immediate threat due to its impending arrival in China, major Chinese electric vehicle makers and auto tech companies are hurrying to pivot their strategies towards a more pragmatic yet challenging approach to developing similar offerings. Although Tesla\\u2019s rivals have for years been looking to cut out expensive components and master the newest artificial intelligence models, the game seems to be different this time.\\nBoth NIO and Xpeng Motors are now embracing the so-called computer vision approach, championed by Tesla, hoping their upcoming models will achieve human-like downtown driving in cities via the use of fitted cameras and radar, rather than more expensive laser sensor units. Sinpro.ai, a supplier to NIO of ultra-high-resolution four-dimensional (4D) imaging radar, said it is prepared for delivery later this year with an annual capacity of 800,000 units. Tesla has reportedly replaced radar sensors on some models after years of attempting to remove them.\\n\\u201cIt will be a difficult task for Tesla\\u2019s Full Self-Driving (FSD) software to deal with scenarios in China where it is common that a large number of electric scooters are usually ahead in the same lane with motor vehicles,\\u201d Li Liyun, vice president of autonomous driving at Xpeng, wrote on June 27 on Chinese Twitter-like microblogging platform Weibo. Xpeng is planning to remove lidar from its upcoming sedan, scheduled for launch later this year, local media has reported.\\nXpeng and NIO are also following Tesla\\u2019s suit by transitioning to an \\u201cend-to-end\\u201d autonomous driving method after using modular-based neural networks that are heavily reliant on explicit coding. Meanwhile, more traditional automakers are turning to domestic tech companies for help, such as Huawei and DJI, to catch up with the latest AI trend. Despite big challenges pressuring the industry, some early movers have the potential to compete with the US pioneer, Liu Guanghao, partner at Shanghai-based venture capital firm Befor Capital, told TechNode.\\nREAD MORE: China opens door wider to Tesla as local giants disrupt the EV sector with AI-defined vehicles\\nVision-based approach\\nA break from previous strategies of using expensive chips and sensors to enable ADAS capabilities, the latest approach centers on reducing the cost of components in hopes of making more room for further price cuts. Many now have their eyes on the use of radar, ditched by Tesla in 2021 due to limitations in identifying stationary objects with low image resolution, as some parts makers now said it is coming close to lidar in terms of performance \\u2013 but at a lower price tag.\\n\\u201cThere is more overlap between lidar and our sixth-generation radar systems as we significantly improve the resolution,\\u201d Juergen Brandl, Head of Market China, Business Area Autonomous Mobility at Continental Group, told TechNode. \\u201cRadar could soon see through [objects] but lidar has some problems with the distance especially in difficult situations like fog and rain.\\u201d The German firm\\u2019s newest front-facing radar boasts a detection distance of 280 and 140 meters (174 and 87 miles) for vehicles and slow-walking pedestrians, respectively.\\nAdvanced radar solutions like this also create three-dimensional point cloud datasets like lidars, helping automakers and developers move towards fully end-to-end models with raw data collection from multiple sensors to train their self-driving systems. \\u201cWe can play a big role in the development of Level 2 plus ADAS systems in China,\\u201d Brandl said, adding that the company\\u2019s product is below the price of a lidar unit with \\u201cvery good\\u201c output in terms of point cloud data.\\nSome disagree however, saying the technology is still at an early stage. Production of Continental\\u2019s latest-gen radar started early this year and the company began delivering the world\\u2019s first 4D radar in 2021, which detects an object\\u2019s vertical information in addition to distance, direction, and relative velocity, generating more dense point clouds than a contentional radar. Meanwhile, major Chinese lidar makers have consistently enhanced the performance of their products and lowered the prices to just over RMB 1,000 ($137.6) per unit in recent years.\\nThe key is whether 3D/4D radar could prove to be a more \\u201ccost competitive\\u201d option compared with lidar, said Liu. \\u201cI believe both [radar and lidar] have their special advantages and disadvantages,\\u201d Brandl said. \\u201dI think time or the market will tell whether we need both of them or one solution only.\\u201d\\nEither way, prospects for early players are bright. Momenta, a self-driving car company backed by General Motors and Toyota, expects the bill of materials, or total cost of components, for the City NOA (Navigation on ADAS) function to be slashed to RMB 4,000-5,000 from the current RMB 7,000-10,000 in the next two years. The intent is to survive an unprecedented price war in China that has been ongoing for more than a year.\\nEnd-to-end AI\\nChinese carmakers used to brag about their coverage of cities where their assisted driving software is said to enable cars to handle on-ramp to off-ramp driving, automatic highway lane changing, and congested streets. However, many are now pivoting their focus to provide a more human-like driving experience and a full end-to-end AI model is now seen as key to winning the battle.\\nDescribed by Tesla chief executive Elon Musk as \\u201cbasically photons in and controls out,\\u201d such end-to-end neural networks play an integral role in a vehicle\\u2019s decision-making process, taking raw sensor data as input and producing control actions as output. This contrasts with the conventional approaches that see each functionality, from perception to planning and action, developed individually using rule-based designs, which are often inadequate\\u00a0 in addressing the vast number of scenarios that occur on the road, a team of researchers said in a recent report.\\nThe result is that people still feel their cars pilot themselves inhumanly even when kitted out with some of the most cutting-edge ADAS on the market, partly because human driving behavior tends to be consistent rather than discrete. It is very difficult for the current AV (autonomous vehicle) stack to make coherent, long-term decisions, said Wu Xinzhou, Nvidia\\u2019s vice president of automotive at its annual developer conference GTC in March.\\nRecent surveys have shown automakers that customers are generally dissatisfied with existing ADAS functions. Nearly half of respondents take the controls 1-2 times per 100 kilometers (62 miles) as the city NOA functions do not react appropriately, while others make more frequent interventions, according to a recent survey compiled by China\\u2019s Gaogong Industry Institute. \\u201cWhen the driver has to interfere pretty often, then you cannot say this is autonomous driving,\\u201d said Brandl.\\nXpeng is aiming for less than one intervention per 1,000 kilometers in major traffic areas in China, CEO He Xiaopeng announced early this year, without giving a timeframe. This was followed by a new software update for its XNGP ADAS in May enhanced by the first end-to-end AI model for production vehicles in China, according to the EV maker. NIO reshuffled its autonomous driving department recently, rolling up its perception as well as planning and control teams into a single group with a focus on new AI models, Chinese media outlet LatePost reported on June 19.\\nIt requires huge amounts of data, for example, millions of video clips, to train AI systems, as well as deep pockets and access to AI chips. Musk told investors in April that his company will increase the number of Nvidia\\u2019s flagship AI processors it uses from 35,000 to 85,000 by the end of this year. He wrote in a post on X earlier that month that the investment in training computers, gigantic data pipelines, and video storage will be well over $10 billion cumulatively this year.\\nSuch major investment and effort is not something all companies can handle however. \\u201cIt would be so hard for most traditional automakers to do this by themselves. The best way is to pick a supplier,\\u201d Liu said.\\nThe entry of Tesla\\u2019s FSD into China may feel like a new challenge therefore, but it may also coincide with a new era of partnerships around self-driving technologies.\\n \\n\\nSupport TechNode\\nWith a small team, TechNode provides timely news and thoughtfully researched articles for worldwide readers interested in learning more about the Chinese tech industry.\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\tOne-time\\t\\t\\n\\n\\t\\t\\t\\tMonthly\\t\\t\\n\\n\\t\\t\\t\\tAnnually\\t\\t\\n\\n\\n\\n\\n\\t\\t\\tOne-time\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$60\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$120\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$365\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tMonthly\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$10\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$20\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$30\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tAnnually\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$60\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$120\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$365\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tOther\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tDonation amount\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t$\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\tYour contribution is appreciated.\\t\\t\\n\\n\\t\\t\\tDonate Now\\t\\t\\n\\n\\n\\n\\n\\nRelated\\n \\n\\nTagged: Connected cars,\\u00a0Features,\\u00a0Highlight,\\u00a0Huawei,\\u00a0Mobility,\\u00a0New Energy Vehicles,\\u00a0Nio,\\u00a0Tesla,\\u00a0Unmanned vehicles,\\u00a0Xpeng \\n\\n\\n \\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tJill Shen\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\tJill Shen is Shanghai-based technology reporter. She covers Chinese mobility, autonomous vehicles, and electric cars. Connect with her via e-mail: jill.shen@technode.com or Twitter: @jill_shen_sh\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\tMore by Jill Shen\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\nLatest stories\\n\\n\\nBEYOND Expo 2025: Unveiling Possibilities \\u2013 Asia\\u2019s Premier Tech Expo Announcing 2025 Dates in Macao\\nJul 17, 2024\\n\\n\\nLanding AI | Autotech startup led by former Tesla engineer unveils FSD-like system\\nJul 17, 2024\\n\\n\\niQiyi removes ad skip option from basic membership, prompting renewed backlash\\nJul 17, 2024\\n\\n\\nOnePlus Pad 2 debuts with upgraded vibrating tip stylus\\nJul 17, 2024\\n\\n\\nJD to sell select high-end goods for $2.50 every month as it looks to compete on price\\nJul 17, 2024\\n\\n\\nNVIDIA plans RTX 5090D for China next Q1, with performance cutbacks despite architecture boost\\nJul 17, 2024\\n\\n\\nPopular articles\\n\\nQinglong, China\\u2019s first full-sized general-purpose humanoid robot, unveiled at World Artificial Intelligence Conference 2024\\n\\n\\nLanding AI | Autotech startup led by former Tesla engineer unveils FSD-like system\\n\\n\\nNVIDIA plans RTX 5090D for China next Q1, with performance cutbacks despite architecture boost\\n\\n\\nChinese bubble tea maker Chagee reportedly hires Starbucks talent, mulls US IPO\\u00a0\\n\\n\\nmiHoYo's Zenless Zone Zero review: unique combat experience, artistic design but lackluster gacha mechanics\\n\\n\\nApple secures first batch of TSMC's 2nm chips for iPhone 17 series\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\nSectionsData\\nFeatures\\nNews\\nVideo\\nPodcasts\\nAboutAbout us\\nJoin us\\nWrite for us\\nTips\\nTechNode GroupTechNode Global\\nOrigin Conference\\nEditionsTechNode \\u4e2d\\u6587\\nTechNode \\u0440\\u0443\\u0441\\u0441\\u043a\\u0438\\u0439\\nTechNode Espa\\u00f1ol\\n \\n\\n\\n\\n\\n\\n\\u6caaICP\\u590714046707\\u53f7-4\\n \\n\\n\\n\\u00a9 2024 TechNode\\n\\n\\t\\t\\t\\t\\tPowered by Newspack\\t\\t\\t\\t\\nPrivacy Policy \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nI don't have an account\\nI already have an account\\n\\n\\nSign In\\n\\n\\n\\n \\n\\n \\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\tWe've recently sent you an authentication link. Please, check your inbox!\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\tSign in with a password below, or sign in using your email.\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\tGet a code sent to your email to sign in, or sign in using a password.\\t\\t\\t\\t\\t\\t\\n\\n\\t\\t\\t\\t\\t\\t\\tEnter the code you received via email to sign in, or sign in using a password.\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\tSubscribe to our newsletters:\\t\\t\\t\\t\\t\\t\\t\\t\\nEvery Wednesday and Friday, TechNode\\u2019s Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSign in\\n\\n\\n\\nSign in with your email\\n\\n\\nLost your password?\\n\\n\\n\\n\\n\\nSign in\\n\\n\\n\\nTry a different email\\n\\n\\nSend another code\\n\\n\\n\\n\\n\\nSend authorization code\\n\\n\\n\\nSign in with a password\\n\\n\\n\\n\\n\\nSign up\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tOR\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\t\\t\\t\\tSign in with Google\\t\\t\\t\\t\\n\\n\\n\\n\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tBy signing up, you agree to our privacy policy.\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nClose\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ],\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://www.techradar.com/pro/cheapest-smartphone-with-thermal-and-ir-night-vision-sensors-goes-on-sale-for-less-than-dollar300-ulefone-armor-25t-pro-promises-to-be-a-superb-rugged-handset-and-weve-called-in-one-for-a-review\",\n          \"title\": \"Cheapest smartphone with thermal and IR night vision sensors goes on sale for less than $300 \\u2014 Ulefone Armor 25T Pro promises to be a superb rugged handset and we've called in one for a review | TechRadar\",\n          \"description\": \"It's super-durable with a Kevlar-textured back cover\",\n          \"language\": \"en\"\n        },\n        \"page_content\": \"\\n\\n\\n\\n\\n\\nCheapest smartphone with thermal and IR night vision sensors goes on sale for less than $300 \\u2014 Ulefone Armor 25T Pro promises to be a superb rugged handset and we've called in one for a review | TechRadar\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n  \\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\nSkip to main content\\n\\n\\n\\nTech Radar\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTech Radar Pro\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTech Radar Gaming\\n\\n\\n\\n\\n\\n\\n\\nOpen menu\\nClose menu\\n\\n\\n\\n\\n\\nTech Radar Pro\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTechRadar the business technology experts\\n\\n\\n \\n\\nSearch\\n\\n \\n\\n\\nSearch TechRadar\\n\\n\\n\\n \\n\\n\\n\\n\\nRSS\\n\\n\\n\\n\\n \\n\\n \\n\\n \\n\\n \\n\\nUS EditionAsiaSingaporeEuropeDanmarkSuomiNorgeSverigeUKItaliaNederlandBelgi\\u00eb (Nederlands)FranceDeutschlandEspa\\u00f1aNorth AmericaUS (English)CanadaM\\u00e9xicoAustralasiaAustraliaNew Zealand\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\nNews\\n\\n\\n\\n\\nReviews\\n\\n\\n\\n\\nFeatures\\n\\n\\n\\n\\nExpert Insights\\n\\n\\n\\n\\nWebsite builders\\n\\n\\n\\n\\nWeb hosting\\n\\n\\n\\n\\nSecurity\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n \\n\\n\\nTrendingPrime Day standing desk dealsPrime Day office chair dealsPrime Day best PC dealsExpert Insights\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPro\\n\\n\\n\\nCheapest smartphone with thermal and IR night vision sensors goes on sale for less than $300 \\u2014 Ulefone Armor 25T Pro promises to be a superb rugged handset and we've called in one for a review\\n\\n\\nNews\\nBy Wayne Williams published 30 June 2024 \\n\\nIt's super-durable with a Kevlar-textured back cover\\n\\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nWhen you purchase through links on our site, we may earn an affiliate commission. Here\\u2019s how it works.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n(Image credit: Ulefone)\\n\\n\\n\\n\\nChinese tech firm Ulefone, best known for rugged devices like the Armor 8 Pro, has launched its latest offering, the Armor 25T Pro, a 5G smartphone featuring both thermal imaging and night vision capabilities.The ThermoVue thermal imaging sensor offers a resolution of up to 160 x 120 pixels and a refresh rate of up to 25Hz. Ulefone says the sensor can be used for tasks such as detecting leaks, inspecting buildings, and ensuring safety during outdoor activities, but it can be put to any tasks you can think of.Prime Day deals are here - shop our expert picksThe phone also comes with a ThermoVue app for capturing thermal images and videos.Kevlar-textured back coverThe Armor 25T Pro also includes an infrared night vision camera, equipped with a 64MP OMNIVISION OV64B sensor and Ulefone's NightElf Ultra 3.0 algorithm. This allows users to capture clear images in low-light conditions, enhancing security and wildlife monitoring capabilities.The Armor 25T Pro is powered by a MediaTek Dimensity 6300 5G SoC, paired with up to 12GB of RAM and 256GB of storage. The device boasts a 6.78-inch FHD+ display with a 120Hz refresh rate. It runs Android 14.A 6500mAh battery ensures long-lasting power for all-day usage, with 33W fast charging and 30W wireless charging capabilities. In terms of connectivity, the Armor 25T Pro supports 5G and Wi-Fi 802.11ac. The device also comes with a fingerprint sensor.Designed to be durable, the Armor 25T Pro meets IP68/IP69K and MIL-STD-810H standards. It features a Kevlar-textured back cover for added style and protection and despite its rugged build, the device maintains a slim and lightweight profile.Are you a pro? Subscribe to our newsletterSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!Contact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.Armor 25T Pro is available to order from AliExpress for $299.99, which is currently 40% off the usual MSRP of $499.99. We\\u2019ve requested one so keep an eye out for our review soon.More from TechRadar ProThese are the best rugged smartphones aroundTANK3 PRO rugged smartphone has a DLP projector and a 200mp cameraUlefone's Armor Pad 3 Pro has the biggest battery in a tablet\\n\\nWayne WilliamsSocial Links NavigationEditorWayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK\\u2019s PC magazines, and launched, edited and published a number of them too.\\nMore about proAI enhances customer experience by behaving like humansAmazon Just Walk Out technology is coming to one of London's most iconic venuesLatestFour ways to reconcile developer and security teamsSee more latest\\u00a0\\u25ba\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMost PopularA US Congresswoman lost her voice to disease, now AI has given it backIt's not you, Galaxy Ring just sold out from Samsung, but we've found another way for you to put a ring on itApple re-releases Homepod Mini in Midnight black and sparks discussion of next-gen modelAMD confirms Ryzen 9000 CPUs will go on sale on July 31 \\u2013 but we\\u2019re still guessing at pricing for Zen 5 chipsCrypto websites registered to Squarespace are being hijacked and redirected by scammersOpenAI may be working on AI that can perform research without human help \\u2013 which should go fineWorld's lightest portable monitor is a stunning 14-inch technological piece of art from Vaio \\u2014 Vision+ 14 weighs 325g and has a 14-inch, 400 nits displayiPhone 16 specs predictions: everything we expect to see from every modelFinally! Netflix reveals release date for a new real-life dating show that I've been waiting months for and I'm so excitedPrime Video movie of the day: Clint Eastwood's never been better than in A Fistful of DollarsThis new ransomware tries to stop victims recovery by using passphrases\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nMOST POPULARMOST SHARED1My fake company was hit by a ransomware attack \\u2014 here\\u2019s what I learned to do, and what not to do 2Quordle today \\u2013 hints and answers for Saturday, June 29 (game #887)3Target's 4th of July sale is filled with hundreds of deals - here are the 15 best47 new movies and TV shows to stream on Netflix, Prime Video, Max, and more this weekend (June 28)55 Netflix thriller movies with over 90% on Rotten Tomatoes you can't miss1I tried the first smartphone-based telescope and got next-level photos of the moon \\u2013 next up, galaxies and nebulae2Ryse SmartShades are a pricey but intuitive way to bring old-school-shades into the world of the smart home3Even Apple Intelligence can\\u2019t save the smart home if Apple won\\u2019t fix its infuriating Home app4Microsoft has gone too far: including a Game Pass ad in the Settings app ushers in a whole new age of ridiculous over-advertising5Microsoft's Copilot+ AI PCs aren't all that special right now, but there's one major reason why that's about to change\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nTechRadar is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\\n\\n\\nAbout Us\\nContact Future's experts\\nContact Us\\nTerms and conditions\\nPrivacy policy\\nCookies policy\\nAdvertise with us\\nWeb notifications\\nAccessibility Statement\\nCareers\\n\\n\\n\\u00a9\\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\\nNew York,\\nNY 10036. \\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ],\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://pulse2.com/bitsensing-advanced-radar-solutions-company-raises-25-million-in-series-b/\",\n          \"title\": \"bitsensing: Advanced Radar Solutions Company Raises $25 Million In Series B\",\n          \"description\": \"bitsensing - a leading provider of advanced radar solutions - announced the closing of Series B funding round at $25 million. This significant investment - which was led by prominent venture capital firms and strategic investors emphasizes bitsensing\\u2019s role in the radar technology industry and will propel the company toward its ambitious global growth and innovation goals to bring radar everywhere.\",\n          \"language\": \"en\"\n        },\n        \"page_content\": \"\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nbitsensing: Advanced Radar Solutions Company Raises $25 Million In Series B\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nVC\\nPE\\nM&A\\nAsset Management\\nAI\\nCybersecurity\\nProfiles\\nContact\\n\\n \\n\\n\\n\\n\\n\\u00d7\\n\\nSearch Pulse 2.0\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nbitsensing: Advanced Radar Solutions Company Raises $25 Million In Series B\\nBy Amit Chowdhry \\u2022 Jun 25, 2024\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nbitsensing: Advanced Radar Solutions Company Raises $25 Million In Series B\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nbitsensing \\u2013 a leading provider of advanced radar solutions \\u2013 announced the closing of Series B funding round at $25 million. This significant investment \\u2013 which was led by prominent venture capital firms and strategic investors emphasizes bitsensing\\u2019s role in the radar technology industry and will propel the company toward its ambitious global growth and innovation goals to bring radar everywhere.\\nThe Series B funding round will be utilized to scale bitsensing\\u2019s operations, invest in research and development, and explore new market opportunities. And the company plans to expand its team, enhance its product portfolio, and establish strategic partnerships to drive growth and deliver value to its customers worldwide.\\nbitsensing\\u2019s latest funding round was backed by Korea Development Bank, HL Mando Corporation, Industrial Bank of Korea, Aju Capital, Life Asset Management, and SCL Investment \\u2013 who recognizes the company\\u2019s potential to transform various sectors such as automotive, smart cities, and health tech with its state-of-the-art radar technology. This marks the fourth consecutive time that HL Mando Corporation has participated in funding bitsensing, reaffirming its strong belief in the company\\u2019s vision and capabilities.\\nbitsensing has been an innovator in the radar technology innovation space, expanding the use of its high-performance, automotive-grade radar across a variety of applications in autonomous driving, smart cities, health tech, and beyond. Designed to improve safety, efficiency, and convenience across various applications, bitsensing\\u2019s radar systems are currently driving innovation across the following sectors:\\nbitsensing\\u2019s imaging radar product transforms the way that autonomous vehicle understands its surroundings by providing high-resolution 4D imaging. And with a range coverage of over 300 meters, its unique array patterning technique and radar signal processing algorithms deliver the ultimate reliability.\\nPlus, its advanced corner radar product provides a surround detection solution for autonomous vehicle systems with a 50% advancement in detection range compared to conventional radar.\\nbitsensing\\u2019s Traffic Insight Monitoring Sensor (TIMOS) is an all-in-one traffic sensor that integrates an AI computing device within an intelligent transport system (ITS) solution. And it provides visibility and intelligence across 12 lanes of traffic, vehicle class detection (i.e. cars, motorcycles, etc.), and the ability to identify a host of safety issues, including jaywalking, wrong-way driving, speed violations, and stationary vehicles. It is currently being used across six countries, including the Nonsan-Cheonan Expressway in South Korea.\\nbitsensing\\u2019s radar is also used in application services for digital health, focused on sleep care. And its radar monitors sleep quality, apnea events, limb movements and also provides data analysis like sleep scores, summaries and lifestyle recommendations.\\nIn the past year, bitsensing has achieved several significant milestones, further cementing its position as a leader in the radar technology sector, including the top evaluation, TI-1, in the Tech Ranking, a testament to its technological prowess and innovative capabilities. And bitsensing was designated as a national core technology company, highlighting its critical role in advancing technological innovation in South Korea. The company has also successfully secured multiple global projects, showcasing its ability to meet the diverse needs of international markets and solidifying its presence on the global stage.\\nKEY QUOTE:\\n\\u201cWe truly believe in the transformative role our cutting-edge radar solutions will have across a host of industries and want to make \\u2018radar everywhere\\u2019 a reality. We are thrilled to have the support of such esteemed investors and this funding round will accelerate the next phase of bitsensing\\u2019s growth. With this new investment, we\\u2019ll be focused on the further development of our technology, expanding our product offerings, and enhancing our global market presence.\\u201d\\n\\u2013 Dr. Jae-Eun Lee, CEO of bitsensing\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n \\nPulse 2.0 focuses on business news, profiles, and deal flow coverage.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\u00a0\\n\\n\\n\\n\\n\\n\\n\\n\\n  \\u00a9 2024 Pulse 2.0 LLC. All rights reserved. \\n\\nAbout\\nContact\\nDisclaimer\\nPrivacy\\nEthics\\nMission\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ],\n  [\n    {\n      \"lc\": 1,\n      \"type\": \"constructor\",\n      \"id\": [\n        \"langchain\",\n        \"schema\",\n        \"document\",\n        \"Document\"\n      ],\n      \"kwargs\": {\n        \"metadata\": {\n          \"source\": \"https://telecom.economictimes.indiatimes.com/news/portal-in-portal/satcom/galaxeye-space-idex-dio-to-develop-multi-sensor-fusion-processing-system-for-iaf-satellites/111288896\",\n          \"title\": \"GalaxEye Space, iDEX DIO to develop multi-sensor fusion processing system for IAF satellites, ET Telecom\",\n          \"description\": \"GalaxEye Space: The innovative system will analyse data from Synthetic Aperture Radar (SAR), Earth Observation (EO), Infrared and Hyper-Spectral sensors before transmitting it to ground stations.\",\n          \"language\": \"en\"\n        },\n        \"page_content\": \"\\n\\n\\n\\nGalaxEye Space, iDEX DIO to develop multi-sensor fusion processing system for IAF satellites, ET Telecom\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nLogin\\n\\n\\n\\n\\nGet App\\n\\n\\n\\n\\n\\n\\n\\nNews\\n\\n\\n\\n\\nIndustryDevicesSatcomInterviewsETTSpecialPolicyMVAS/AppsInternetReviewsTelecom Equipment Enterprise ServicesPrepaid/Postpaid5G CornerAmericasAsiaBangladeshChinaIndonesiaJapanMalaysiaSingaporeEUFranceGermanyAfricaAustraliaBritainRussiaMiddle EastView all News\\n\\n\\n\\n\\nExclusives\\n\\n\\n\\n\\n\\nLeaders Speak\\n\\n\\n\\n\\n\\nEvents\\n\\n\\n\\n\\n\\nAwards\\n\\n\\n\\n\\n\\nWebinars\\n\\n\\n\\n\\n\\n\\nMore\\n\\n\\n\\nNewsletters\\nMasterClasses\\nAbout Us\\nContact Us\\nAdvertise With Us\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSearch\\n\\n\\n\\n\\n\\n\\n\\n\\nSatcom\\nIndustry\\nPolicy\\nTelecom Equipment\\nEnterprise Services\\nDevices\\nInterviews\\nTele-Talk\\n\\nMore\\n\\n\\n\\nJobs & CareersTele-StatsSmartphone \\n\\n\\n\\n\\n\\n\\n\\nMore\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSatcom 2 min read\\n\\n\\nGalaxEye Space, iDEX DIO to develop multi-sensor fusion processing system for IAF satellites\\n\\nThe innovative system will analyse data from Synthetic Aperture Radar (SAR), Earth Observation (EO), Infrared and Hyper-Spectral sensors before transmitting it to ground stations.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n                                    Telegram\\n                                \\n\\n\\n\\n\\n                                    Facebook\\n                                \\n\\n\\n\\n\\n                                    Copy Link\\n                                \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIANS\\n\\n\\nUpdated On Jun 26, 2024 at 05:28 PM IST\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nNew Delhi: Space-tech startup GalaxEye Space on Wednesday announced a partnership with iDEX DIO, under the Ministry of Defence, to develop a multi-sensor fusion processing system for miniature satellites capable of carrying multiple payloads up to 150 kg for the Indian Air Force (IAF). \\\"The collaboration aligns with the Make In India initiative, demonstrating GalaxEye Space's commitment to fostering self-reliance in the defence sector, with support from iDEX DIO,\\\" said the Bengaluru-based company.The innovative system will analyse data from Synthetic Aperture Radar (SAR), Earth Observation (EO), Infrared and Hyper-Spectral sensors before transmitting it to ground stations. \\n\\nAdvt\\n\\n\\n\\n\\n\\nThe device, to be designed as an independent, pluggable module, can be attached to any multi-sensor satellite, providing high processing throughput and power efficiency. It is compact in size, lightweight, and is compatible with existing systems, and provides ease of maintenance. The technology aims to efficiently handle the large data volumes generated by Low Earth Orbit (LEO) imaging satellites while adhering to strict power, size, and weight constraints, and ensuring reliable performance in the harsh conditions of space.In line with its mission to innovate at every stage of satellite development, GalaxEye Space is also on track to launch the world's first multi-sensor synthetic aperture radar with electro-optical (EO) remote sensing imagery (SAR + EO) by Q1 of FY 2025. \\\"The groundbreaking satellite is set to disrupt traditional earth observation methods, marking a significant milestone in the industry,\\\" the startup said.In May, GalaxEye signed a Memorandum of Understanding (MoU) with the Indian National Space Promotion and Authorisation Centre (IN-SPACe) to get access to the Indian Space Research Organisation's (ISRO) cutting-edge laboratories and testing infrastructure.The company had, in 2023, developed India's first indigenous drone equipped with SAR, and is now working towards building the country's first private constellation of Earth observation satellites. \\n\\nIANS\\n\\n\\n\\nPublished On Jun 26, 2024 at 05:25 PM IST\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n                                        Telegram\\n                                    \\n\\n\\n\\n\\n                                        Facebook\\n                                    \\n\\n\\n\\n\\n                                        Copy Link\\n                                    \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nBe the first one to comment.\\nComment Now\\n\\n\\nCOMMENTS\\n\\n\\nComment Now\\nRead Comment (1)\\n\\n\\n\\n\\n\\n\\n\\n\\nAll Comments \\n\\n\\nBy commenting, you agree to the Prohibited Content Policy\\nPost\\n\\n\\n\\nBy commenting, you agree to the Prohibited Content Policy\\nPost\\n\\n\\n\\nFind this Comment Offensive?\\nChoose your reason below and click on the submit button. This will alert our moderators to take actions\\nREASONS FOR REPORTING\\n\\n\\n\\nFoul Language\\n\\n\\n\\nDefamatory\\n\\n\\n\\nInciting hatred against a certain community\\n\\n\\n\\nOut of Context / Spam\\n\\n\\n\\nOthers\\n\\n\\n\\n\\n\\nReport\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nJoin the community of 2M+ industry professionals\\nSubscribe to our newsletter to get latest insights & analysis.\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nDownload ETTelecom App \\n\\nGet Realtime updates\\nSave your favourite articles\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nScan to download App\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nGalaxEye Space\\niDEX DIO\\nIAF satellites\\nMake In India initiative\\nsatellite\\nsatellites news\\ntechnology news\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nNews \\n\\n\\nSee whats happening in Telecom sector right now\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nExclusive \\n\\n\\nRead and get insights from specially curated unique stories from editorial\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nLeaders Speak\\n\\n\\nBusiness leaders sharing their insights\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nEvents\\n\\n\\nExplore and discuss challenges & trends in India's leading B2B events\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nAwards \\n\\n\\nRecognise work that not only stood out but was also purposeful\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nWebinars \\n\\n\\nJoin leaders & experts for roundtables, conferences, panels and discussions\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nJoin the community of 2M+ industry professionals\\nSubscribe to our Daily Newsletter\\n\\n\\n\\n\\n\\nBy continuing you agree to our Privacy Policy & Terms & Conditions\\n\\n\\n\\n\\n\\n\\nAdvertise With Us\\n\\nWe have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc.\\nGet in Touch\\n\\n\\n\\n\\n\\nDownload ETTelecom App \\n\\nSave your favourite articles with seamless reading experience\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nGet updates on your preferred social platform\\n\\nFollow us for the latest news, insider access to events and more.\\n\\n \\n\\n\\n\\n\\n\\nAbout Us\\nContact Us\\nNewsletters\\n\\n\\n\\nGuest-Post Guidelines\\nRSS Feed\\nSitemap\\n\\n\\nRSS Feed\\nSitemap\\nGuest-Post Guidelines\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nThe Economic Times Business Verticals\\n\\n\\n\\n\\nAuto\\nRetail\\nHealth\\nEnergy\\nCIO\\nReal Estate\\nMarketing & Advertising\\nCFO\\nIT Security\\nBFSI\\nGovernment\\nHospitality\\nHR\\nLegal\\nET TravelWorld\\nInfra\\nB2B\\nCIOSEA\\nHRSEA\\nHREMEA\\nEducation\\nEnergyWorldMEA\\nManufacturing\\nPharma\\n\\n\\n\\n\\n\\n\\n\\n@2024 ETTelecom.com. All Right Reserved.\\nPrivacy Policy\\nTerms and Conditions\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nHomeNewsGalaxEye Space, iDEX DIO to develop multi-sensor fusion processing system for IAF satellites\\n\\n\\n\",\n        \"type\": \"Document\"\n      }\n    }\n  ]\n]"